{
  "LangCode": 0,
  "Constellations": {
    "unknown": [
      {
        "Name": "Unknown Constellation",
        "Type": null,
        "Descriptions": [
          "Information about this Constellation is coming soon."
        ]
      }
    ],
    "albedo": [
      {
        "Name": "Flower of Eden",
        "Type": "C1",
        "Descriptions": [
          "Transient Blossoms generated by Albedo's Abiogenesis: Solar Isotoma regenerate 1.2 Energy for Albedo."
        ]
      },
      {
        "Name": "Opening of Phanerozoic",
        "Type": "C2",
        "Descriptions": [
          "Transient Blossoms generated by Abiogenesis: Solar Isotoma grant Albedo Fatal Reckoning for 30s:",
          "Unleashing Rite of Progeniture: Tectonic Tide consumes all stacks of Fatal Reckoning. Each stack of Fatal Reckoning consumed increases the DMG dealt by Fatal Blossoms and Rite of Progeniture: Tectonic Tide's burst DMG by 30% of Albedo's DEF.",
          "This effect stacks up to 4 times."
        ]
      },
      {
        "Name": "Grace of Helios",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Abiogenesis: Solar Isotoma by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Descent of Divinity",
        "Type": "C4",
        "Descriptions": [
          "Active party members within the Solar Isotoma field have their Plunging Attack DMG increased by 30%."
        ]
      },
      {
        "Name": "Tide of Hadean",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Rite of Progeniture: Tectonic Tide by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Dust of Purification",
        "Type": "C6",
        "Descriptions": [
          "Active party members within the Solar Isotoma field who are protected by a shield created by Crystallize have their DMG increased by 17%."
        ]
      }
    ],
    "alhaitham": [
      {
        "Name": "Intuition",
        "Type": "C1",
        "Descriptions": [
          "When a Projection Attack hits an opponent, Universality: An Elaboration on Form's CD is decreased by 1.2s. This effect can be triggered once every 1s."
        ]
      },
      {
        "Name": "Debate",
        "Type": "C2",
        "Descriptions": [
          "When Alhaitham generates a Chisel-Light Mirror, his Elemental Mastery will be increased by 50 for 8 seconds, max 4 stacks. Each stack's duration is counted independently. This effect can be triggered even when the maximum number of Chisel-Light Mirrors has been reached."
        ]
      },
      {
        "Name": "Negation",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Universality: An Elaboration on Form by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Elucidation",
        "Type": "C4",
        "Descriptions": [
          "When Particular Field: Fetters of Phenomena is unleashed, the following effects will become active based on the number of Chisel-Light Mirrors consumed and created this time around:",
          "Each Mirror consumed will increase the Elemental Mastery of all other nearby party members by 30 for 15s.",
          "Each Mirror generated will grant Alhaitham a 10% Dendro DMG Bonus for 15s.",
          "The pre-existing duration of the aforementioned effects will be cleared if you use Particular Field: Fetters of Phenomena again while they are in effect."
        ]
      },
      {
        "Name": "Sagacity",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Particular Field: Fetters of Phenomena by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Structuration",
        "Type": "C6",
        "Descriptions": [
          "Alhaitham gains the following effects:",
          "2 seconds after Particular Field: Fetters of Phenomena is unleashed, he will generate 3 Chisel-Light Mirrors regardless of the number of mirrors consumed.",
          "If Alhaitham generates Chisel-Light Mirrors when their numbers have already maxed out, his CRIT Rate and CRIT DMG will increase by 10% and 70% respectively for 6s.",
          "If this effect is triggered again during its initial duration, the duration remaining will be increased by 6s."
        ]
      }
    ],
    "aloy": [
      {
        "Name": "Star of Another World",
        "Type": "C1",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      },
      {
        "Name": "Star of Another World",
        "Type": "C2",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      },
      {
        "Name": "Star of Another World",
        "Type": "C3",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      },
      {
        "Name": "Star of Another World",
        "Type": "C4",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      },
      {
        "Name": "Star of Another World",
        "Type": "C5",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      },
      {
        "Name": "Star of Another World",
        "Type": "C6",
        "Descriptions": [
          "The time has not yet come for this person's corner of the night sky to light up."
        ]
      }
    ],
    "amber": [
      {
        "Name": "One Arrow to Rule Them All",
        "Type": "C1",
        "Descriptions": [
          "Fires 2 arrows per Aimed Shot. The second arrow deals 20% of the first arrow's DMG."
        ]
      },
      {
        "Name": "Bunny Triggered",
        "Type": "C2",
        "Descriptions": [
          "Baron Bunny, new and improved! Hitting Baron Bunny's foot with a fully-charged Aimed Shot manually detonates it.",
          "Explosion via manual detonation deals 200% additional DMG."
        ]
      },
      {
        "Name": "It Burns!",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Fiery Rain by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "It's Not Just Any Doll...",
        "Type": "C4",
        "Descriptions": [
          "Decreases Explosive Puppet's CD by 20%. Adds 1 additional charge."
        ]
      },
      {
        "Name": "It's Baron Bunny!",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Explosive Puppet by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Wildfire",
        "Type": "C6",
        "Descriptions": [
          "Fiery Rain increases all party members' Movement SPD by 15% and ATK by 15% for 10s."
        ]
      }
    ],
    "kamisato_ayaka": [
      {
        "Name": "Snowswept Sakura",
        "Type": "C1",
        "Descriptions": [
          "When Kamisato Ayaka's Normal or Charged Attacks deal Cryo DMG to opponents, it has a 50% chance of decreasing the CD of Kamisato Art: Hyouka by 0.3s. This effect can occur once every 0.1s."
        ]
      },
      {
        "Name": "Blizzard Blade Seki no To",
        "Type": "C2",
        "Descriptions": [
          "When casting Kamisato Art: Soumetsu, unleashes 2 smaller additional Frostflake Seki no To, each dealing 20% of the original storm's DMG."
        ]
      },
      {
        "Name": "Frostbloom Kamifubuki",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Kamisato Art: Soumetsu by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Ebb and Flow",
        "Type": "C4",
        "Descriptions": [
          "Opponents damaged by Kamisato Art: Soumetsu's Frostflake Seki no To will have their DEF decreased by 30% for 6s."
        ]
      },
      {
        "Name": "Blossom Cloud Irutsuki",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Kamisato Art: Hyouka by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Dance of Suigetsu",
        "Type": "C6",
        "Descriptions": [
          "Kamisato Ayaka gains Usurahi Butou every 10s, increasing her Charged Attack DMG by 298%. This buff will be cleared 0.5s after Ayaka's Charged ATK hits an opponent, after which the timer for this ability will restart."
        ]
      }
    ],
    "kamisato_ayato": [
      {
        "Name": "Kyouka Fuushi",
        "Type": "C1",
        "Descriptions": [
          "Shunsuiken DMG is increased by 40% against opponents with 50% HP or less."
        ]
      },
      {
        "Name": "World Source",
        "Type": "C2",
        "Descriptions": [
          "Namisen's maximum stack count is increased to 5. When Kamisato Ayato has at least 3 Namisen stacks, his Max HP is increased by 50%."
        ]
      },
      {
        "Name": "To Admire the Flowers",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Kamisato Art: Kyouka by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Endless Flow",
        "Type": "C4",
        "Descriptions": [
          "After using Kamisato Art: Suiyuu, all nearby party members will have 15% increased Normal Attack SPD for 15s."
        ]
      },
      {
        "Name": "Bansui Ichiro",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Kamisato Art: Suiyuu by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Boundless Origin",
        "Type": "C6",
        "Descriptions": [
          "After using Kamisato Art: Kyouka, Ayato's next Shunsuiken attack will create 2 extra Shunsuiken strikes when they hit opponents, each one dealing 450% of Ayato's ATK as DMG.",
          "Both these Shunsuiken attacks will not be affected by Namisen."
        ]
      }
    ],
    "baizhu": [
      {
        "Name": "Attentive Observation",
        "Type": "C1",
        "Descriptions": [
          "Universal Diagnosis gains 1 additional charge."
        ]
      },
      {
        "Name": "Incisive Discernment",
        "Type": "C2",
        "Descriptions": [
          "When your own active character hits a nearby opponent with their attacks, Baizhu will unleash a Gossamer Sprite: Splice.",
          "Gossamer Sprite: Splice will initiate 1 attack before returning, dealing 250% of Baizhu's ATK as Dendro DMG and healing for 20% of Universal Diagnosis's Gossamer Sprite's normal healing.",
          "DMG dealt this way is considered Elemental Skill DMG.",
          "This effect can be triggered once every 5s."
        ]
      },
      {
        "Name": "All Aspects Stabilized",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Holistic Revivification by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Ancient Art of Perception",
        "Type": "C4",
        "Descriptions": [
          "For 15s after Holistic Revivification is used, Baizhu will increase all nearby party members' Elemental Mastery by 80."
        ]
      },
      {
        "Name": "The Hidden Ebb and Flow",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Universal Diagnosis by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Elimination of Malicious Qi",
        "Type": "C6",
        "Descriptions": [
          "Increases the DMG dealt by Holistic Revivification's Spiritveins by 8% of Baizhu's Max HP.",
          "Additionally, when a Gossamer Sprite or Gossamer Sprite: Splice hits opponents, there is a 100% chance of generating one of Holistic Revivification's Seamless Shields. This effect can only be triggered once by each Gossamer Sprite or Gossamer Sprite: Splice."
        ]
      }
    ],
    "barbara": [
      {
        "Name": "Gleeful Songs",
        "Type": "C1",
        "Descriptions": [
          "Barbara regenerates 1 Energy every 10s."
        ]
      },
      {
        "Name": "Vitality Burst",
        "Type": "C2",
        "Descriptions": [
          "Decreases the CD of Let the Show Begin♪ by 15%.",
          "During the ability's duration, your active character gains a 15% Hydro DMG Bonus."
        ]
      },
      {
        "Name": "Star of Tomorrow",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Shining Miracle♪ by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Attentiveness be My Power",
        "Type": "C4",
        "Descriptions": [
          "Every opponent Barbara hits with her Charged Attack regenerates 1 Energy for her.",
          "A maximum of 5 energy can be regenerated in this manner with any one Charged Attack."
        ]
      },
      {
        "Name": "The Purest Companionship",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Let the Show Begin♪ by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Dedicating Everything to You",
        "Type": "C6",
        "Descriptions": [
          "When Barbara is in the party but not on the field, and one of your own party members falls:",
          "Automatically revives the fallen character.",
          "Fully restores the revived character's HP to 100%.",
          "This effect can only occur once every 15 mins."
        ]
      }
    ],
    "beidou": [
      {
        "Name": "Sea Beast's Scourge",
        "Type": "C1",
        "Descriptions": [
          "When Stormbreaker is used:",
          "Creates a shield that absorbs up to 16% of Beidou's Max HP for 15s.",
          "This shield absorbs Electro DMG 250% more effectively."
        ]
      },
      {
        "Name": "Upon the Turbulent Sea, the Thunder Arises",
        "Type": "C2",
        "Descriptions": [
          "Stormbreaker's arc lightning can jump to 2 additional targets."
        ]
      },
      {
        "Name": "Summoner of Storm",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Tidecaller by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Stunning Revenge",
        "Type": "C4",
        "Descriptions": [
          "Upon being attacked, Beidou's Normal Attacks gain an additional instance of 20% Electro DMG for 10s."
        ]
      },
      {
        "Name": "Crimson Tidewalker",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Stormbreaker by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Bane of Evil",
        "Type": "C6",
        "Descriptions": [
          "During the duration of Stormbreaker, the Electro RES of surrounding opponents is decreased by 15%."
        ]
      }
    ],
    "bennett": [
      {
        "Name": "Grand Expectation",
        "Type": "C1",
        "Descriptions": [
          "Fantastic Voyage's ATK increase no longer has an HP restriction, and gains an additional 20% of Bennett's Base ATK."
        ]
      },
      {
        "Name": "Impasse Conqueror",
        "Type": "C2",
        "Descriptions": [
          "When Bennett's HP falls below 70%, his Energy Recharge is increased by 30%."
        ]
      },
      {
        "Name": "Unstoppable Fervor",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Passion Overload by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Unexpected Odyssey",
        "Type": "C4",
        "Descriptions": [
          "Using a Normal Attack when executing the second attack of Passion Overload's Charge Level 1 allows an additional attack to be performed.",
          "This additional attack does 135% of the second attack's DMG."
        ]
      },
      {
        "Name": "True Explorer",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Fantastic Voyage by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Fire Ventures with Me",
        "Type": "C6",
        "Descriptions": [
          "Sword, Claymore, or Polearm-wielding characters inside Fantastic Voyage's radius gain a 15% Pyro DMG Bonus and their weapons are infused with Pyro."
        ]
      }
    ],
    "candace": [
      {
        "Name": "Returning Heiress of the Scarlet Sands",
        "Type": "C1",
        "Descriptions": [
          "The duration of Prayer of the Crimson Crown effect triggered by Sacred Rite: Wagtail's Tide is increased by 3s."
        ]
      },
      {
        "Name": "Moon-Piercing Brilliance",
        "Type": "C2",
        "Descriptions": [
          "When Sacred Rite: Heron's Sanctum hits opponents, Candace's Max HP will be increased by 20% for 15s."
        ]
      },
      {
        "Name": "Hunter's Supplication",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Sacred Rite: Wagtail's Tide by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sentinel Oath",
        "Type": "C4",
        "Descriptions": [
          "Shortens the Hold CD of Sacred Rite: Heron's Sanctum to be the same as that of the Tapping CD."
        ]
      },
      {
        "Name": "Heterochromatic Gaze",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Sacred Rite: Heron's Sanctum by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Overflow",
        "Type": "C6",
        "Descriptions": [
          "When characters (excluding Candace herself) affected by the Prayer of the Crimson Crown caused by Sacred Rite: Wagtail's Tide deal Elemental DMG to opponents using Normal Attacks, an attack wave will be unleashed that deals AoE Hydro DMG equal to 15% of Candace's Max HP.",
          "This effect can trigger once every 2.3s and is considered Elemental Burst DMG."
        ]
      }
    ],
    "charlotte": [
      {
        "Name": "A Need to Verify Facts",
        "Type": "C1",
        "Descriptions": [
          "After Still Photo: Comprehensive Confirmation heals a character, it will mark them with Verification, which will heal them once every 2s for 80% of Charlotte's ATK. This effect lasts 6s."
        ]
      },
      {
        "Name": "A Duty to Pursue Truth",
        "Type": "C2",
        "Descriptions": [
          "When using Framing: Freezing Point Composition, when Monsieur Verite hits 1/2/3 (or more) opponents, Charlotte's own ATK will be increased by 10%/20%/30% for 12s."
        ]
      },
      {
        "Name": "An Imperative to Independence",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Still Photo: Comprehensive Confirmation by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "A Responsibility to Oversee",
        "Type": "C4",
        "Descriptions": [
          "When Still Photo: Comprehensive Confirmation hits an opponent marked by Snappy Silhouette or Focused Impression, it will deal 10% more DMG and restore 2 Energy to Charlotte. This restoration can be triggered 5 times every 20s."
        ]
      },
      {
        "Name": "A Principle of Conscience",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Framing: Freezing Point Composition by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "A Summation of Interest",
        "Type": "C6",
        "Descriptions": [
          "When the active character's Normal and Charged Attacks hit an opponent marked by Framing: Freezing Point Composition's Focused Impression, Monsieur Verite will initiate a coordinated attack that deals 180% of Charlotte's ATK as AoE Cryo DMG and heals active character(s) within the AoE for 42% of Charlotte's ATK. This effect can be triggered once every 6s and both DMG and healing dealt in this way will be considered as having been done by Charlotte's Elemental Burst."
        ]
      }
    ],
    "chevreuse": [
      {
        "Name": "Stable Front Line's Resolve",
        "Type": "C1",
        "Descriptions": [
          "When the active character with the \"Coordinated Tactics\" status (not including Chevreuse herself) triggers the Overloaded reaction, they will recover 6 Energy. This effect can be triggered once every 10s.",
          "You must first unlock the Passive Talent \"Vanguard's Coordinated Tactics.\""
        ]
      },
      {
        "Name": "Sniper Induced Explosion",
        "Type": "C2",
        "Descriptions": [
          "After Holding Short-Range Rapid Interdiction Fire and hitting a target, 2 chain explosions will be triggered near the location where said target is hit. Each explosion deals Pyro DMG equal to 120% of Chevreuse's ATK. This effect can be triggered up to once every 10s, and DMG dealt this way is considered Elemental Skill DMG."
        ]
      },
      {
        "Name": "Practiced Field Stripping Technique",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Short-Range Rapid Interdiction Fire by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Secret to Rapid-Fire Multishots",
        "Type": "C4",
        "Descriptions": [
          "After using Ring of Bursting Grenades, the Hold mode of Short-Range Rapid Interdiction Fire will not go on cooldown when Chevreuse uses it.",
          "This effect is removed after Short-Range Rapid Interdiction Fire has been fired twice using Hold or after 6s."
        ]
      },
      {
        "Name": "Enhanced Incendiary Firepower",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Ring of Bursting Grenades by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "In Pursuit of Ending Evil",
        "Type": "C6",
        "Descriptions": [
          "After 12s of the healing effect from Short-Range Rapid Interdiction Fire, all nearby party members recover HP equivalent to 10% of Chevreuse's Max HP once.",
          "After a party member is healed by Short-Range Rapid Interdiction Fire, they gain a 20% Pyro DMG Bonus and Electro DMG Bonus for 8s. Max 3 stacks. Each stack's duration is counted independently."
        ]
      }
    ],
    "chongyun": [
      {
        "Name": "Ice Unleashed",
        "Type": "C1",
        "Descriptions": [
          "The last attack of Chongyun's Normal Attack combo releases 3 ice blades. Each blade deals 50% of Chongyun's ATK as Cryo DMG to all opponents in its path."
        ]
      },
      {
        "Name": "Atmospheric Revolution",
        "Type": "C2",
        "Descriptions": [
          "Elemental Skills and Elemental Bursts cast within the Frost Field created by Spirit Blade: Chonghua's Layered Frost have their CD time decreased by 15%."
        ]
      },
      {
        "Name": "Cloudburst",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Spirit Blade: Cloud-Parting Star by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Frozen Skies",
        "Type": "C4",
        "Descriptions": [
          "Chongyun regenerates 1 Energy every time he hits an opponent affected by Cryo.",
          "This effect can only occur once every 2s."
        ]
      },
      {
        "Name": "The True Path",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Spirit Blade: Chonghua's Layered Frost by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Rally of Four Blades",
        "Type": "C6",
        "Descriptions": [
          "Spirit Blade: Cloud-Parting Star deals 15% more DMG to opponents with a lower percentage of their Max HP remaining than Chongyun.",
          "This skill will also summon 1 additional spirit blade."
        ]
      }
    ],
    "collei": [
      {
        "Name": "Deepwood Patrol",
        "Type": "C1",
        "Descriptions": [
          "When in the party and not on the field, Collei's Energy Recharge is increased by 20%."
        ]
      },
      {
        "Name": "Through Hill and Copse",
        "Type": "C2",
        "Descriptions": [
          "The Passive Talent Floral Sidewinder is changed to this:",
          "The Floral Ring will grant the character the Sprout effect from Floral Sidewinder upon return, dealing 40% of Collei's ATK as Dendro DMG to nearby opponents for 3s.",
          "From the moment of using Floral Brush to the moment when this instance of Sprout effect ends, if any of your party members triggers Burning, Quicken, Aggravate, Spread, Bloom, Hyperbloom, or Burgeon reactions, the Sprout effect will be extended by 3s.",
          "The Sprout effect can only be extended this way once. If another Sprout effect is triggered during its initial duration, the initial effect will be removed.",
          "Requires you to have unlocked the Floral Sidewinder Passive Talent."
        ]
      },
      {
        "Name": "Scent of Summer",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Floral Brush by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Gift of the Woods",
        "Type": "C4",
        "Descriptions": [
          "Using Trump-Card Kitty will increase all nearby characters' Elemental Mastery by 60 for 12s (not including Collei herself)."
        ]
      },
      {
        "Name": "All Embers",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Trump-Card Kitty by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Forest of Falling Arrows",
        "Type": "C6",
        "Descriptions": [
          "When the Floral Ring hits, it will create a miniature Cuilein-Anbar that will deal 200% of Collei's ATK as Dendro DMG.",
          "Each Floral Brush can only create one such miniature Cuilein-Anbar."
        ]
      }
    ],
    "cyno": [
      {
        "Name": "Ordinance: Unceasing Vigil",
        "Type": "C1",
        "Descriptions": [
          "After using Sacred Rite: Wolf's Swiftness, Cyno's Normal Attack SPD will be increased by 20% for 10s. If the Judication effect of his Passive Talent Featherfall Judgment is triggered during Secret Rite: Chasmic Soulfarer, the duration of this increase will be refreshed.",
          "You need to unlock the Passive Talent \"Featherfall Judgement.\""
        ]
      },
      {
        "Name": "Ceremony: Homecoming of Spirits",
        "Type": "C2",
        "Descriptions": [
          "When Cyno's Normal Attacks hit opponents, his Electro DMG Bonus will increase by 10% for 4s. This effect can be triggered once every 0.1s. Max 5 stacks."
        ]
      },
      {
        "Name": "Precept: Lawful Enforcer",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Sacred Rite: Wolf's Swiftness by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Austerity: Forbidding Guard",
        "Type": "C4",
        "Descriptions": [
          "When Cyno is in the Pactsworn Pathclearer state triggered by Sacred Rite: Wolf's Swiftness, after he triggers Electro-Charged, Superconduct, Overloaded, Quicken, Aggravate, Hyperbloom, or an Electro Swirl reaction, he will restore 3 Elemental Energy for all nearby party members (except himself.)",
          "This effect can occur 5 times within one use of Sacred Rite: Wolf’s Swiftness."
        ]
      },
      {
        "Name": "Funerary Rite: The Passing of Starlight",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Secret Rite: Chasmic Soulfarer by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Raiment: Just Scales",
        "Type": "C6",
        "Descriptions": [
          "After using Sacred Rite: Wolf's Swiftness or triggering the Judication effect of the Passive Talent \"Featherfall Judgment,\" Cyno will gain 4 stacks of the \"Day of the Jackal\" effect. When he hits opponents with Normal Attacks, he will consume 1 stack of \"Day of the Jackal\" to fire off one Duststalker Bolt.",
          "\"Day of the Jackal\" lasts for 8s. Max 8 stacks. It will be canceled once Pactsworn Pathclearer ends.",
          "A maximum of 1 Duststalker Bolt can be unleashed this way every 0.4s.",
          "You must first unlock the Passive Talent \"Featherfall Judgment.\""
        ]
      }
    ],
    "dehya": [
      {
        "Name": "The Flame Incandescent",
        "Type": "C1",
        "Descriptions": [
          "Dehya's Max HP is increased by 20%, and she deals bonus DMG based on her Max HP when using the following attacks:",
          "Molten Inferno's DMG will be increased by 3.6% of her Max HP.",
          "Leonine Bite's DMG will be increased by 6% of her Max HP."
        ]
      },
      {
        "Name": "The Sand-Blades Glittering",
        "Type": "C2",
        "Descriptions": [
          "When Dehya uses Molten Inferno: Ranging Flame, the duration of the recreated Fiery Sanctum field will be increased by 6s.",
          "Additionally, when a Fiery Sanctum exists on the field, DMG dealt by its next coordinated attack will be increased by 50% when active character(s) within the Fiery Sanctum field are attacked."
        ]
      },
      {
        "Name": "A Rage Swift as Fire",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Leonine Bite by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "An Oath Abiding",
        "Type": "C4",
        "Descriptions": [
          "When Flame-Mane's Fist and Incineration Drive attacks unleashed during Leonine Bite hit opponents, they will restore 1.5 Energy for Dehya and 2.5% of her Max HP. This effect can be triggered once every 0.2s."
        ]
      },
      {
        "Name": "The Alpha Unleashed",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Molten Inferno by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Burning Claws Cleaving",
        "Type": "C6",
        "Descriptions": [
          "Increases the Level of Molten Inferno by 3.",
          "Additionally, after a Flame-Mane's Fist attack hits an opponent and deals CRIT Hits during a single Blazing Lioness state, it will cause the CRIT DMG of Leonine Bite to increase by 15% for the rest of Blazing Lioness's duration and extend that duration by 0.5s. This effect can be triggered every 0.2s. The duration can be extended for a maximum of 2s and CRIT DMG can be increased by a maximum of 60% this way."
        ]
      }
    ],
    "diluc": [
      {
        "Name": "Conviction",
        "Type": "C1",
        "Descriptions": [
          "Diluc deals 15% more DMG to opponents whose HP is above 50%."
        ]
      },
      {
        "Name": "Searing Ember",
        "Type": "C2",
        "Descriptions": [
          "When Diluc takes DMG, his ATK increases by 10% and his ATK SPD increases by 5%. Lasts for 10s.",
          "This effect can stack up to 3 times and can only occur once every 1.5s."
        ]
      },
      {
        "Name": "Fire and Steel",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Searing Onslaught by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Flowing Flame",
        "Type": "C4",
        "Descriptions": [
          "Casting Searing Onslaught in rhythm greatly increases damage dealt.",
          "2s after casting Searing Onslaught, casting the next Searing Onslaught in the combo deals 40% additional DMG. This effect lasts for 2s."
        ]
      },
      {
        "Name": "Phoenix, Harbinger of Dawn",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Dawn by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Flaming Sword, Nemesis of the Dark",
        "Type": "C6",
        "Descriptions": [
          "After casting Searing Onslaught, the next 2 Normal Attacks within the next 6s will have their DMG and ATK SPD increased by 30%.",
          "Additionally, Searing Onslaught will not interrupt the Normal Attack combo."
        ]
      }
    ],
    "diona": [
      {
        "Name": "A Lingering Flavor",
        "Type": "C1",
        "Descriptions": [
          "Regenerates 15 Energy for Diona after the effects of Signature Mix end."
        ]
      },
      {
        "Name": "Shaken, Not Purred",
        "Type": "C2",
        "Descriptions": [
          "Increases Icy Paws' DMG by 15%, and increases its shield's DMG Absorption by 15%.",
          "Additionally, when paws hit their targets, creates a shield for other nearby characters on the field with 50% of the Icy Paws shield's DMG Absorption for 5s."
        ]
      },
      {
        "Name": "A—Another Round?",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Signature Mix by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Wine Industry Slayer",
        "Type": "C4",
        "Descriptions": [
          "Within the radius of Signature Mix, Diona's charge time for aimed shots is reduced by 60%."
        ]
      },
      {
        "Name": "Double Shot, On The Rocks",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Icy Paws by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Cat's Tail Closing Time",
        "Type": "C6",
        "Descriptions": [
          "Characters within Signature Mix's radius will gain the following effects based on their HP amounts:",
          "Increases Incoming Healing Bonus by 30% when HP falls below or is equal to 50%.",
          "Elemental Mastery increased by 200 when HP is above 50%."
        ]
      }
    ],
    "dori": [
      {
        "Name": "Additional Investment",
        "Type": "C1",
        "Descriptions": [
          "The number of After-Sales Service Rounds created by Troubleshooter Shots is increased by 1."
        ]
      },
      {
        "Name": "Special Franchise",
        "Type": "C2",
        "Descriptions": [
          "When you are in combat and the Jinni heals the character it is connected to, it will fire a Jinni Toop from that character's position that deals 50% of Dori's ATK DMG."
        ]
      },
      {
        "Name": "Wonders Never Cease",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Alcazarzaray's Exactitude by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Discretionary Supplement",
        "Type": "C4",
        "Descriptions": [
          "The character connected to the Jinni will obtain the following buffs based on their current HP and Energy:",
          "When their HP is lower than 50%, they gain 50% Incoming Healing Bonus.",
          "When their Energy is less than 50%, they gain 30% Energy Recharge."
        ]
      },
      {
        "Name": "Value for Mora",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Spirit-Warding Lamp: Troubleshooter Cannon by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sprinkling Weight",
        "Type": "C6",
        "Descriptions": [
          "Dori gains the following effects for 3s after using Spirit-Warding Lamp: Troubleshooter Cannon:",
          "Electro Infusion.",
          "When Normal Attacks hit opponents, all nearby party members will heal HP equivalent to 4% of Dori's Max HP. This type of healing can occur once every 0.1s."
        ]
      }
    ],
    "eula": [
      {
        "Name": "Tidal Illusion",
        "Type": "C1",
        "Descriptions": [
          "Every time Icetide Vortex's Grimheart stacks are consumed, Eula's Physical DMG is increased by 30% for 6s.",
          "Each stack consumed will increase the duration of this effect by 6s up to a maximum of 18s."
        ]
      },
      {
        "Name": "Lady of Seafoam",
        "Type": "C2",
        "Descriptions": [
          "Decreases the CD of Icetide Vortex's Holding Mode, rendering it identical to Tapping CD."
        ]
      },
      {
        "Name": "Lawrence Pedigree",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Glacial Illumination by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Obstinacy of One's Inferiors",
        "Type": "C4",
        "Descriptions": [
          "Lightfall Swords deal 25% increased DMG against opponents with less than 50% HP."
        ]
      },
      {
        "Name": "Chivalric Quality",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Icetide Vortex by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Noble Obligation",
        "Type": "C6",
        "Descriptions": [
          "Lightfall Swords created by Glacial Illumination start with 5 stacks of energy. Normal Attacks, Elemental Skills, and Elemental Bursts have a 50% chance to grant the Lightfall Sword an additional stack of energy."
        ]
      }
    ],
    "faruzan": [
      {
        "Name": "Truth by Any Means",
        "Type": "C1",
        "Descriptions": [
          "Faruzan can fire off a maximum of 2 Hurricane Arrows using fully charged Aimed Shots while under the effect of a single Manifest Gale created by Wind Realm of Nasamjnin."
        ]
      },
      {
        "Name": "Overzealous Intellect",
        "Type": "C2",
        "Descriptions": [
          "The duration of the Dazzling Polyhedron created by The Wind's Secret Ways is increased by 6s."
        ]
      },
      {
        "Name": "Spirit-Orchard Stroll",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Wind Realm of Nasamjnin by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Divine Comprehension",
        "Type": "C4",
        "Descriptions": [
          "The vortex created by Pressurized Collapses will restore Energy to Faruzan based on the number of opponents hit: If it hits 1 opponent, it will restore 2 Energy for Faruzan. Each additional opponent hit will restore 0.5 more Energy for Faruzan.",
          "A maximum of 4 Energy can be restored to her per vortex."
        ]
      },
      {
        "Name": "Wonderland of Rumination",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of The Wind's Secret Ways by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Wondrous Path of Truth",
        "Type": "C6",
        "Descriptions": [
          "Characters affected by The Wind's Secret Ways' Prayerful Wind's Benefit have 40% increased CRIT DMG when they deal Anemo DMG. When the active character deals DMG while affected by Prayerful Wind's Benefit, they will apply Pressurized Collapse to the opponent damaged. This effect can be triggered once every 3s. This CD is shared between all party members."
        ]
      }
    ],
    "fischl": [
      {
        "Name": "Gaze of the Deep",
        "Type": "C1",
        "Descriptions": [
          "Even when Oz is not present in combat, he can still watch over Fischl through his raven eyes. When Fischl performs a Normal Attack against an opponent, Oz fires a joint attack, dealing DMG equal to 22% of Fischl's ATK."
        ]
      },
      {
        "Name": "Devourer of All Sins",
        "Type": "C2",
        "Descriptions": [
          "When Nightrider is used, it deals an additional 200% ATK as DMG, and its AoE is increased by 50%."
        ]
      },
      {
        "Name": "Wings of Nightmare",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Nightrider by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Her Pilgrimage of Bleak",
        "Type": "C4",
        "Descriptions": [
          "When Midnight Phantasmagoria is used, it deals 222% of ATK as Electro DMG to surrounding opponents.",
          "When the skill duration ends, Fischl regenerates 20% of her HP."
        ]
      },
      {
        "Name": "Against the Fleeing Light",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Midnight Phantasmagoria by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Evernight Raven",
        "Type": "C6",
        "Descriptions": [
          "Extends the duration of Oz's presence on the field by 2s. Additionally, Oz performs joint attacks with your active character when present, dealing 30% of Fischl's ATK as Electro DMG."
        ]
      }
    ],
    "freminet": [
      {
        "Name": "Dreams of the Foamy Deep",
        "Type": "C1",
        "Descriptions": [
          "The CRIT Rate of Pressurized Floe: Shattering Pressure will be increased by 15%."
        ]
      },
      {
        "Name": "Penguins and the Land of Plenty",
        "Type": "C2",
        "Descriptions": [
          "Unleashing Pressurized Floe: Shattering Pressure will restore 2 Energy to Freminet. If a Pressure Level 4 Shattering Pressure is unleashed, this will restore 3 Energy."
        ]
      },
      {
        "Name": "Song of the Eddies and Bleached Sands",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Normal Attack: Flowing Eddies by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Dance of the Snowy Moon and Flute",
        "Type": "C4",
        "Descriptions": [
          "After Freminet triggers Frozen, Shatter, or Superconduct against opponents, his ATK will be increased by 9% for 6s. Max 2 stacks. This can be triggered once every 0.3s."
        ]
      },
      {
        "Name": "Nights of Hearth and Happiness",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Pressurized Floe by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Moment of Waking and Resolve",
        "Type": "C6",
        "Descriptions": [
          "After Freminet triggers Frozen, Shatter, or Superconduct against opponents, his CRIT DMG will be increased by 12% for 6s. Max 3 stacks. This can be triggered once every 0.3s."
        ]
      }
    ],
    "furina": [
      {
        "Name": "\"Love Is a Rebellious Bird That None Can Tame\"",
        "Type": "C1",
        "Descriptions": [
          "When using Let the People Rejoice, Furina will gain 150 Fanfare.",
          "Additionally, Furina's Fanfare limit is increased by 100."
        ]
      },
      {
        "Name": "\"A Woman Adapts Like Duckweed in Water\"",
        "Type": "C2",
        "Descriptions": [
          "While Let the People Rejoice lasts, Furina's Fanfare gain from increases or decreases in nearby characters' HP is increased by 250%. Each point of Fanfare above the limit will increase Furina's Max HP by 0.35%. Her maximum Max HP increase is 140%."
        ]
      },
      {
        "Name": "\"My Secret Is Hidden Within Me, No One Will Know My Name\"",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Let the People Rejoice by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "\"They Know Not Life, Who Dwelt in the Netherworld Not!\"",
        "Type": "C4",
        "Descriptions": [
          "When the Salon Members from Salon Solitaire hit an opponent, or the Singer of Many Waters restores HP to the active character, Furina will restore 4 Energy. This effect triggers once every 5s."
        ]
      },
      {
        "Name": "\"His Name I Now Know, It Is...!\"",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Salon Solitaire by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "\"Hear Me — Let Us Raise the Chalice of Love!\"",
        "Type": "C6",
        "Descriptions": [
          "When using Salon Solitaire, Furina gains \"Center of Attention\" for 10s.",
          "Throughout the duration, Furina's Normal Attacks, Charged Attacks, and Plunging Attacks are converted into Hydro DMG which cannot be overridden by any other elemental infusion. DMG is also increased by an amount equivalent to 18% of Furina's max HP.",
          "Throughout the duration, Furina's Normal Attacks (not including Arkhe: Seats Sacred and Secular Attacks), Charged Attacks, and the impact of Plunging Attacks will cause different effects up to every 0.1s after hitting opponents depending on her current Arkhe alignment:",
          "Arkhe: Ousia",
          "Every 1s, all nearby characters in the party will be healed by 4% of Furina's max HP, for a duration of 2.9s. Triggering this effect again will extend its duration.",
          "Arkhe: Pneuma",
          "This Normal Attack (not including Arkhe: Seats Sacred and Secular Attacks), Charged Attack, or Plunging Attack ground impact DMG will be further increased by an amount equivalent to 25% of Furina's max HP. When any of the attacks mentioned previously hit an opponent, all nearby characters in the party will consume 1% of their current HP.",
          "During the duration of each instance of \"Center of Attention,\" the above effects can be triggered up to 6 times. \"Center of Attention\" will end when its effects have triggered 6 times or when the duration expires."
        ]
      }
    ],
    "ganyu": [
      {
        "Name": "Dew-Drinker",
        "Type": "C1",
        "Descriptions": [
          "Taking DMG from a Charge Level 2 Frostflake Arrow or Frostflake Arrow Bloom decreases opponents' Cryo RES by 15% for 6s.",
          "A hit regenerates 2 Energy for Ganyu. This effect can only occur once per Charge Level 2 Frostflake Arrow, regardless if Frostflake Arrow itself or its Bloom hit the target."
        ]
      },
      {
        "Name": "The Auspicious",
        "Type": "C2",
        "Descriptions": [
          "Trail of the Qilin gains 1 additional charge."
        ]
      },
      {
        "Name": "Cloud-Strider",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Celestial Shower by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Westward Sojourn",
        "Type": "C4",
        "Descriptions": [
          "Opponents standing within the AoE of Celestial Shower take increased DMG. This effect strengthens over time.",
          "Increased DMG taken begins at 5% and increases by 5% every 3s, up to a maximum of 25%.",
          "The effect lingers for 3s after the opponent leaves the AoE."
        ]
      },
      {
        "Name": "The Merciful",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Trail of the Qilin by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Clement",
        "Type": "C6",
        "Descriptions": [
          "Using Trail of the Qilin causes the next Frostflake Arrow shot within 30s to not require charging."
        ]
      }
    ],
    "gorou": [
      {
        "Name": "Rushing Hound: Swift as the Wind",
        "Type": "C1",
        "Descriptions": [
          "When characters (other than Gorou) within the AoE of Gorou's General's War Banner or General's Glory deal Geo DMG to opponents, the CD of Gorou's Inuzaka All-Round Defense is decreased by 2s. This effect can occur once every 10s."
        ]
      },
      {
        "Name": "Sitting Hound: Steady as a Clock",
        "Type": "C2",
        "Descriptions": [
          "While General's Glory is in effect, its duration is extended by 1s when a nearby active character obtains an Elemental Shard from a Crystallize reaction. This effect can occur once every 0.1s. Max extension is 3s."
        ]
      },
      {
        "Name": "Mauling Hound: Fierce as Fire",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Inuzaka All-Round Defense by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Lapping Hound: Warm as Water",
        "Type": "C4",
        "Descriptions": [
          "When General's Glory is in the \"Impregnable\" or \"Crunch\" states, it will also heal active characters within its AoE by 50% of Gorou's own DEF every 1.5s."
        ]
      },
      {
        "Name": "Striking Hound: Thunderous Force",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Juuga: Forward Unto Victory by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Valiant Hound: Mountainous Fealty",
        "Type": "C6",
        "Descriptions": [
          "For 12s after using Inuzaka All-Round Defense or Juuga: Forward Unto Victory, increases the CRIT DMG of all nearby party members' Geo DMG based on the buff level of the skill's field at the time of use:",
          "\"Standing Firm\": +10%",
          "\"Impregnable\": +20%",
          "\"Crunch\": +40%",
          "This effect cannot stack and will take reference from the last instance of the effect that is triggered."
        ]
      }
    ],
    "shikanoin_heizou": [
      {
        "Name": "Named Juvenile Casebook",
        "Type": "C1",
        "Descriptions": [
          "For 5s after Shikanoin Heizou takes the field, his Normal Attack SPD is increased by 15%. He also gains 1 Declension stack for Heartstopper Strike. This effect can be triggered once every 10s."
        ]
      },
      {
        "Name": "Investigative Collection",
        "Type": "C2",
        "Descriptions": [
          "The pull effect of the Arresting Windtunnel created by Windmuster Kick is enhanced, and its duration is increased to 1s."
        ]
      },
      {
        "Name": "Esoteric Puzzle Book",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Heartstopper Strike by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Tome of Lies",
        "Type": "C4",
        "Descriptions": [
          "The first Windmuster Iris explosion in each Windmuster Kick will regenerate 9 Elemental Energy for Shikanoin Heizou. Every subsequent explosion in that Windmuster Kick will each regenerate an additional 1.5 Energy for Heizou.",
          "One Windmuster Kick can regenerate a total of 13.5 Energy for Heizou in this manner."
        ]
      },
      {
        "Name": "Secret Archive",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Windmuster Kick by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Curious Casefiles",
        "Type": "C6",
        "Descriptions": [
          "Each Declension stack will increase the CRIT Rate of the Heartstopper Strike unleashed by 4%. When Heizou possesses Conviction, this Heartstopper Strike's CRIT DMG is increased by 32%."
        ]
      }
    ],
    "hu_tao": [
      {
        "Name": "Crimson Bouquet",
        "Type": "C1",
        "Descriptions": [
          "While in a Paramita Papilio state activated by Guide to Afterlife, Hu Tao's Charge Attacks do not consume Stamina."
        ]
      },
      {
        "Name": "Ominous Rainfall",
        "Type": "C2",
        "Descriptions": [
          "Increases the Blood Blossom DMG by an amount equal to 10% of Hu Tao's Max HP at the time the effect is applied.",
          "Additionally, Spirit Soother will also apply the Blood Blossom effect."
        ]
      },
      {
        "Name": "Lingering Carmine",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Guide to Afterlife by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Garden of Eternal Rest",
        "Type": "C4",
        "Descriptions": [
          "Upon defeating an enemy affected by a Blood Blossom that Hu Tao applied herself, all nearby allies in the party (excluding Hu Tao herself) will have their CRIT Rate increased by 12% for 15s."
        ]
      },
      {
        "Name": "Floral Incense",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Spirit Soother by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Butterfly's Embrace",
        "Type": "C6",
        "Descriptions": [
          "Triggers when Hu Tao's HP drops below 25%, or when she suffers a lethal strike:",
          "Hu Tao will not fall as a result of the DMG sustained. Additionally, for the next 10s, all of her Elemental and Physical RES is increased by 200%, her CRIT Rate is increased by 100%, and her resistance to interruption is greatly increased.",
          "This effect triggers automatically when Hu Tao has 1 HP left.",
          "Can only occur once every 60s."
        ]
      }
    ],
    "arataki_itto": [
      {
        "Name": "Stay a While and Listen Up",
        "Type": "C1",
        "Descriptions": [
          "After using Royal Descent: Behold, Itto the Evil!, Arataki Itto gains 2 stacks of Superlative Superstrength. After 1s, Itto will gain 1 stack of Superlative Superstrength every 0.5s for 1.5s."
        ]
      },
      {
        "Name": "Gather 'Round, It's a Brawl!",
        "Type": "C2",
        "Descriptions": [
          "After using Royal Descent: Behold, Itto the Evil!, each party member whose Element is Geo will decrease that skill's CD by 1.5s and restore 6 Energy to Arataki Itto.",
          "CD can be decreased by up to 4.5s in this manner. Max 18 Energy can be restored in this manner."
        ]
      },
      {
        "Name": "Horns Lowered, Coming Through",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Masatsu Zetsugi: Akaushi Burst! by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Jailhouse Bread and Butter",
        "Type": "C4",
        "Descriptions": [
          "When the Raging Oni King state caused by Royal Descent: Behold, Itto the Evil! ends, all nearby party members gain 20% DEF and 20% ATK for 10s."
        ]
      },
      {
        "Name": "10 Years of Hanamizaka Fame",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Royal Descent: Behold, Itto the Evil! by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Arataki Itto, Present!",
        "Type": "C6",
        "Descriptions": [
          "Arataki Itto's Charged Attacks deal +70% Crit DMG. Additionally, when he uses Arataki Kesagiri, he has a 50% chance to not consume stacks of Superlative Superstrength."
        ]
      }
    ],
    "jean": [
      {
        "Name": "Spiraling Tempest",
        "Type": "C1",
        "Descriptions": [
          "Increases the pulling speed of Gale Blade after holding for more than 1s, and increases the DMG dealt by 40%."
        ]
      },
      {
        "Name": "People's Aegis",
        "Type": "C2",
        "Descriptions": [
          "When Jean picks up an Elemental Orb/Particle, all party members have their Movement SPD and ATK SPD increased by 15% for 15s."
        ]
      },
      {
        "Name": "When the West Wind Arises",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Dandelion Breeze by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Lands of Dandelion",
        "Type": "C4",
        "Descriptions": [
          "Within the Field created by Dandelion Breeze, all opponents have their Anemo RES decreased by 40%."
        ]
      },
      {
        "Name": "Outbursting Gust",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Gale Blade by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Lion's Fang, Fair Protector of Mondstadt",
        "Type": "C6",
        "Descriptions": [
          "Incoming DMG is decreased by 35% within the Field created by Dandelion Breeze. Upon leaving the Dandelion Field, this effect lasts for 3 attacks or 10s."
        ]
      }
    ],
    "kaeya": [
      {
        "Name": "Excellent Blood",
        "Type": "C1",
        "Descriptions": [
          "The CRIT Rate of Kaeya's Normal and Charge Attacks against opponents affected by Cryo is increased by 15%."
        ]
      },
      {
        "Name": "Never-Ending Performance",
        "Type": "C2",
        "Descriptions": [
          "Every time Glacial Waltz defeats an opponent during its duration, its duration is increased by 2.5s, up to a maximum of 15s."
        ]
      },
      {
        "Name": "Dance of Frost",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Frostgnaw by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Frozen Kiss",
        "Type": "C4",
        "Descriptions": [
          "Triggers automatically when Kaeya's HP falls below 20%:",
          "Creates a shield that absorbs damage equal to 30% of Kaeya's Max HP. Lasts for 20s.",
          "This shield absorbs Cryo DMG with 250% efficiency.",
          "Can only occur once every 60s."
        ]
      },
      {
        "Name": "Frostbiting Embrace",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Glacial Waltz by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Glacial Whirlwind",
        "Type": "C6",
        "Descriptions": [
          "Glacial Waltz will generate 1 additional icicle, and will regenerate 15 Energy when cast."
        ]
      }
    ],
    "kaveh": [
      {
        "Name": "Sublime Salutations",
        "Type": "C1",
        "Descriptions": [
          "Within 3s after using Artistic Ingenuity, Kaveh's Dendro RES and Incoming Healing Bonus will be increased by 50% and 25% respectively."
        ]
      },
      {
        "Name": "Grace of Royal Roads",
        "Type": "C2",
        "Descriptions": [
          "Kaveh's Normal Attack SPD increases by 15% during Painted Dome."
        ]
      },
      {
        "Name": "Profferings of Dur Untash",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Painted Dome by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Feast of Apadana",
        "Type": "C4",
        "Descriptions": [
          "Dendro Cores created from Bloom reactions Kaveh triggers will deal 60% more DMG when they burst."
        ]
      },
      {
        "Name": "Treasures of Bonkhanak",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Artistic Ingenuity by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Pairidaeza's Dreams",
        "Type": "C6",
        "Descriptions": [
          "When Kaveh's Normal, Charged, or Plunging Attacks hit opponents during Painted Dome, they will unleash Pairidaeza's Light upon the opponent's position, dealing 61.8% of Kaveh's ATK as AoE Dendro DMG and causing all Dendro Cores within that AoE to burst. This effect can be triggered once every 3s."
        ]
      }
    ],
    "kaedehara_kazuha": [
      {
        "Name": "Scarlet Hills",
        "Type": "C1",
        "Descriptions": [
          "Decreases Chihayaburu's CD by 10%.",
          "Using Kazuha Slash resets the CD of Chihayaburu."
        ]
      },
      {
        "Name": "Yamaarashi Tailwind",
        "Type": "C2",
        "Descriptions": [
          "The Autumn Whirlwind field created by Kazuha Slash has the following effects:",
          "Increases Kaedehara Kazuha's own Elemental Mastery by 200.",
          "Increases the Elemental Mastery of characters within the field by 200.",
          "The Elemental Mastery-increasing effects of this Constellation do not stack."
        ]
      },
      {
        "Name": "Maple Monogatari",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Chihayaburu by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Oozora Genpou",
        "Type": "C4",
        "Descriptions": [
          "When Kaedehara Kazuha's Energy is lower than 45, he obtains the following effects:",
          "Pressing or Holding Chihayaburu regenerates 3 or 4 Energy for Kaedehara Kazuha, respectively.",
          "When gliding, Kaedehara Kazuha regenerates 2 Energy per second."
        ]
      },
      {
        "Name": "Wisdom of Bansei",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Kazuha Slash by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Crimson Momiji",
        "Type": "C6",
        "Descriptions": [
          "After using Chihayaburu or Kazuha Slash, Kaedehara Kazuha gains an Anemo Infusion for 5s. Additionally, each point of Elemental Mastery will increase the DMG dealt by Kaedehara Kazuha's Normal, Charged, and Plunging Attack by 0.2%."
        ]
      }
    ],
    "keqing": [
      {
        "Name": "Thundering Might",
        "Type": "C1",
        "Descriptions": [
          "Recasting Stellar Restoration while a Lightning Stiletto is present causes Keqing to deal 50% of her ATK as AoE Electro DMG at the start point and terminus of her Blink."
        ]
      },
      {
        "Name": "Keen Extraction",
        "Type": "C2",
        "Descriptions": [
          "When Keqing's Normal and Charged Attacks hit opponents affected by Electro, they have a 50% chance of producing an Elemental Particle.",
          "This effect can only occur once every 5s."
        ]
      },
      {
        "Name": "Foreseen Reformation",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Starward Sword by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Attunement",
        "Type": "C4",
        "Descriptions": [
          "For 10s after Keqing triggers an Electro-related Elemental Reaction, her ATK is increased by 25%."
        ]
      },
      {
        "Name": "Beckoning Stars",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Stellar Restoration by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Tenacious Star",
        "Type": "C6",
        "Descriptions": [
          "When initiating a Normal Attack, a Charged Attack, Elemental Skill or Elemental Burst, Keqing gains a 6% Electro DMG Bonus for 8s.",
          "Effects triggered by Normal Attacks, Charged Attacks, Elemental Skills and Elemental Bursts are considered independent entities."
        ]
      }
    ],
    "kirara": [
      {
        "Name": "Material Circulation",
        "Type": "C1",
        "Descriptions": [
          "Every 8,000 Max HP Kirara possesses will cause her to create 1 extra Cat Grass Cardamom when she uses Secret Art: Surprise Dispatch. A maximum of 4 extra can be created this way."
        ]
      },
      {
        "Name": "Perfectly Packaged",
        "Type": "C2",
        "Descriptions": [
          "When Kirara is in the Urgent Neko Parcel state of Meow-teor Kick, she will grant other party members she crashes into Critical Transport Shields.",
          "The DMG absorption of Critical Transport Shield is 40% of the maximum absorption Meow-teor Kick's normal Shields of Safe Transport are capable of, and will absorb Dendro DMG with 250% effectiveness.",
          "Critical Transport Shields last 12s and can be triggered once on each character every 10s."
        ]
      },
      {
        "Name": "Universal Recognition",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Meow-teor Kick by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Steed of Skanda",
        "Type": "C4",
        "Descriptions": [
          "After active character(s) protected by Shields of Safe Transport or Critical Transport Shields hit opponents with Normal, Charged, or Plunging Attacks, Kirara will perform a coordinated attack with them using Small Cat Grass Cardamoms, dealing 200% of her ATK as Dendro DMG. DMG dealt this way is considered Elemental Burst DMG. This effect can be triggered once every 3.8s. This CD is shared between all party members."
        ]
      },
      {
        "Name": "A Thousand Miles in a Day",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Secret Art: Surprise Dispatch by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Countless Sights to See",
        "Type": "C6",
        "Descriptions": [
          "All nearby party members will gain 12% All Elemental DMG Bonus within 15s after Kirara uses her Elemental Skill or Burst."
        ]
      }
    ],
    "klee": [
      {
        "Name": "Chained Reactions",
        "Type": "C1",
        "Descriptions": [
          "Attacks and Skills have a certain chance to summon sparks that bombard opponents, dealing DMG equal to 120% of Sparks 'n' Splash's DMG."
        ]
      },
      {
        "Name": "Explosive Frags",
        "Type": "C2",
        "Descriptions": [
          "Being hit by Jumpy Dumpty's mines decreases opponents' DEF by 23% for 10s."
        ]
      },
      {
        "Name": "Exquisite Compound",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Jumpy Dumpty by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sparkly Explosion",
        "Type": "C4",
        "Descriptions": [
          "If Klee leaves the field during the duration of Sparks 'n' Splash, her departure triggers an explosion that deals 555% of her ATK as AoE Pyro DMG."
        ]
      },
      {
        "Name": "Nova Burst",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Sparks 'n' Splash by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Blazing Delight",
        "Type": "C6",
        "Descriptions": [
          "While under the effects of Sparks 'n' Splash, Klee will regenerate 3 Energy for all members of the party (excluding Klee) every 3s.",
          "When Sparks 'n' Splash is used, all party members will gain a 10% Pyro DMG Bonus for 25s."
        ]
      }
    ],
    "sangonomiya_kokomi": [
      {
        "Name": "At Water's Edge",
        "Type": "C1",
        "Descriptions": [
          "While donning the Ceremonial Garment created by Nereid's Ascension, the final Normal Attack in Sangonomiya Kokomi's combo will unleash a swimming fish to deal 30% of her Max HP as Hydro DMG.",
          "This DMG is not considered Normal Attack DMG."
        ]
      },
      {
        "Name": "The Clouds Like Waves Rippling",
        "Type": "C2",
        "Descriptions": [
          "Sangonomiya Kokomi gains the following Healing Bonuses with regard to characters with 50% or less HP via the following methods:",
          "Kurage's Oath Bake-Kurage: 4.5% of Kokomi's Max HP.",
          "Nereid's Ascension Normal and Charged Attacks: 0.6% of Kokomi's Max HP."
        ]
      },
      {
        "Name": "The Moon, A Ship O'er the Seas",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Nereid's Ascension by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Moon Overlooks the Waters",
        "Type": "C4",
        "Descriptions": [
          "While donning the Ceremonial Garment created by Nereid's Ascension, Sangonomiya Kokomi's Normal Attack SPD is increased by 10%, and Normal Attacks that hit opponents will restore 0.8 Energy for her.",
          "This effect can occur once every 0.2s."
        ]
      },
      {
        "Name": "All Streams Flow to the Sea",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Kurage's Oath by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sango Isshin",
        "Type": "C6",
        "Descriptions": [
          "While donning the Ceremonial Garment created by Nereid's Ascension, Sangonomiya Kokomi gains a 40% Hydro DMG Bonus for 4s after her Normal and Charged Attacks heal a character with 80% or more HP."
        ]
      }
    ],
    "layla": [
      {
        "Name": "Fortress of Fantasy",
        "Type": "C1",
        "Descriptions": [
          "The Shield Absorption of the Curtain of Slumber generated by Nights of Formal Focus is increased by 20%.",
          "Additionally, when unleashing Nights of Formal Focus, she will generate a shield for any nearby party members who are not being protected by a Curtain of Slumber. This shield will have 35% of the absorption of a Curtain of Slumber, will last for 12s, and will absorb Cryo DMG with 250% effectiveness."
        ]
      },
      {
        "Name": "Light's Remit",
        "Type": "C2",
        "Descriptions": [
          "When Shooting Stars from Nights of Formal Focus strike opponents, they will each restore 1 Energy to Layla. Each Shooting Star can restore Energy to her in this manner once."
        ]
      },
      {
        "Name": "Secrets of the Night",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Nights of Formal Focus by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Starry Illumination",
        "Type": "C4",
        "Descriptions": [
          "When Nights of Formal Focus starts to fire off Shooting Stars, it will grant all nearby party members the Dawn Star effect, causing their Normal and Charged Attack DMG to increase based on 5% of Layla's Max HP.",
          "Dawn Star can last up to 3s and will be removed 0.05s after dealing Normal or Charged Attack DMG."
        ]
      },
      {
        "Name": "Stream of Consciousness",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Dream of the Star-Stream Shaker by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Radiant Soulfire",
        "Type": "C6",
        "Descriptions": [
          "Shooting Stars from Nights of Formal Focus deal 40% increased DMG, and Starlight Slugs from Dream of the Star-Stream Shaker deal 40% increased DMG.",
          "Additionally, the interval between the creation of Night Stars via Nights of Formal Focus is decreased by 20%."
        ]
      }
    ],
    "lisa": [
      {
        "Name": "Infinite Circuit",
        "Type": "C1",
        "Descriptions": [
          "Lisa regenerates 2 Energy for every opponent hit while holding Violet Arc.",
          "A maximum of 10 Energy can be regenerated in this manner at any one time."
        ]
      },
      {
        "Name": "Electromagnetic Field",
        "Type": "C2",
        "Descriptions": [
          "Holding Violet Arc has the following effects:",
          "Increases DEF by 25%.",
          "Increases Lisa's resistance to interruption."
        ]
      },
      {
        "Name": "Resonant Thunder",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Lightning Rose by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Plasma Eruption",
        "Type": "C4",
        "Descriptions": [
          "Increases the number of lightning bolts released by Lightning Rose by 1-3."
        ]
      },
      {
        "Name": "Electrocute",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Violet Arc by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Pulsating Witch",
        "Type": "C6",
        "Descriptions": [
          "When Lisa takes the field, she applies 3 stacks of Violet Arc's Conductive status onto nearby opponents.",
          "This effect can only occur once every 5s."
        ]
      }
    ],
    "lynette": [
      {
        "Name": "A Cold Blade Like a Shadow",
        "Type": "C1",
        "Descriptions": [
          "When Enigmatic Feint's Enigma Thrust hits an opponent with Shadowsign, a vortex will be created at that opponent's position that will pull nearby opponents in."
        ]
      },
      {
        "Name": "Endless Mysteries",
        "Type": "C2",
        "Descriptions": [
          "Whenever the Bogglecat Box summoned by Magic Trick: Astonishing Shift fires a Vivid Shot, it will fire an extra Vivid Shot."
        ]
      },
      {
        "Name": "Cognition-Inverting Gaze",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Magic Trick: Astonishing Shift by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Tacit Coordination",
        "Type": "C4",
        "Descriptions": [
          "Increases Enigmatic Feint's charges by 1."
        ]
      },
      {
        "Name": "Obscuring Ambiguity",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Enigmatic Feint by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Watchful Eye",
        "Type": "C6",
        "Descriptions": [
          "When Lynette uses Enigmatic Feint's Enigma Thrust, she will gain an Anemo Infusion and 20% Anemo DMG Bonus for 6s."
        ]
      }
    ],
    "lyney": [
      {
        "Name": "Whimsical Wonders",
        "Type": "C1",
        "Descriptions": [
          "Lyney can have 2 Grin-Malkin Hats present at once.",
          "Additionally, Prop Arrows will summon 2 Grin-Malkin Hats and grant Lyney 1 extra stack of Prop Surplus. This effect can occur once every 15s."
        ]
      },
      {
        "Name": "Loquacious Cajoling",
        "Type": "C2",
        "Descriptions": [
          "When Lyney is on the field, he will gain a stack of Crisp Focus every 2s. This will increase his CRIT DMG by 20%. Max 3 stacks. This effect will be canceled when Lyney leaves the field."
        ]
      },
      {
        "Name": "Prestidigitation",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Normal Attack: Card Force Translocation by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Well-Versed, Well-Rehearsed",
        "Type": "C4",
        "Descriptions": [
          "After an opponent is hit by Lyney's Pyro Charged Attack, this opponent's Pyro RES will be decreased by 20% for 6s."
        ]
      },
      {
        "Name": "To Pierce Enigmas",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Wondrous Trick: Miracle Parade by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Guarded Smile",
        "Type": "C6",
        "Descriptions": [
          "When Lyney fires a Prop Arrow, he will fire a Pyrotechnic Strike: Reprised that will deal 80% of a Pyrotechnic Strike's DMG. This DMG is considered Charged Attack DMG."
        ]
      }
    ],
    "mika": [
      {
        "Name": "Factor Confluence",
        "Type": "C1",
        "Descriptions": [
          "The Soulwind state of Starfrost Swirl can decrease the healing interval between instances caused by Skyfeather Song's Eagleplume state. This decrease percentage is equal to the ATK SPD increase provided by Soulwind."
        ]
      },
      {
        "Name": "Companion's Ingress",
        "Type": "C2",
        "Descriptions": [
          "When Starfrost Swirl's Flowfrost Arrow first hits an opponent, or its Rimestar Flare hits an opponent, 1 Detector stack from Passive Talent \"Suppressive Barrage\" will be generated.",
          "You must have unlocked the Passive Talent \"Suppressive Barrage\" first."
        ]
      },
      {
        "Name": "Reconnaissance Experience",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Skyfeather Song by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sunfrost Encomium",
        "Type": "C4",
        "Descriptions": [
          "When Mika's own Skyfeather Song's Eagleplume state heals party members, this will restore 3 Energy to Mika. This form of Energy restoration can occur 5 times during the Eagleplume state created by 1 use of Skyfeather Song."
        ]
      },
      {
        "Name": "Signal Arrow",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Starfrost Swirl by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Companion's Counsel",
        "Type": "C6",
        "Descriptions": [
          "The maximum number of Detector stacks that Starfrost Swirl's Soulwind can gain is increased by 1. You need to have unlocked the Passive Talent \"Suppressive Barrage\" first.",
          "Additionally, active characters affected by Soulwind will deal 60% more Physical CRIT DMG."
        ]
      }
    ],
    "mona": [
      {
        "Name": "Prophecy of Submersion",
        "Type": "C1",
        "Descriptions": [
          "When any of your own party members hits an opponent affected by an Omen, the effects of Hydro-related Elemental Reactions are enhanced for 8s:",
          "Electro-Charged DMG increases by 15%.",
          "Vaporize DMG increases by 15%.",
          "Hydro Swirl DMG increases by 15%.",
          "Frozen duration is extended by 15%."
        ]
      },
      {
        "Name": "Lunar Chain",
        "Type": "C2",
        "Descriptions": [
          "When a Normal Attack hits, there is a 20% chance that it will be automatically followed by a Charged Attack.",
          "This effect can only occur once every 5s."
        ]
      },
      {
        "Name": "Restless Revolution",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Stellaris Phantasm by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Prophecy of Oblivion",
        "Type": "C4",
        "Descriptions": [
          "When any party member attacks an opponent affected by an Omen, their CRIT Rate is increased by 15%."
        ]
      },
      {
        "Name": "Mockery of Fortuna",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Mirror Reflection of Doom by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Rhetorics of Calamitas",
        "Type": "C6",
        "Descriptions": [
          "Upon entering Illusory Torrent, Mona gains a 60% increase to the DMG of her next Charged Attack per second of movement.",
          "A maximum DMG Bonus of 180% can be achieved in this manner. The effect lasts for no more than 8s."
        ]
      }
    ],
    "nahida": [
      {
        "Name": "The Seed of Stored Knowledge",
        "Type": "C1",
        "Descriptions": [
          "When the Shrine of Maya is unleashed and the Elemental Types of the party members are being tabulated, the count will add 1 to the number of Pyro, Electro, and Hydro characters respectively."
        ]
      },
      {
        "Name": "The Root of All Fullness",
        "Type": "C2",
        "Descriptions": [
          "Opponents that are marked by Seeds of Skandha applied by Nahida herself will be affected by the following effects:",
          "Burning, Bloom, Hyperbloom, and Burgeon Reaction DMG can score CRIT Hits. CRIT Rate and CRIT DMG are fixed at 20% and 100% respectively.",
          "Within 8s of being affected by Quicken, Aggravate, Spread, DEF is decreased by 30%."
        ]
      },
      {
        "Name": "The Shoot of Conscious Attainment",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of All Schemes to Know by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Stem of Manifest Inference",
        "Type": "C4",
        "Descriptions": [
          "When 1/2/3/(4 or more) nearby opponents are affected by All Schemes to Know's Seeds of Skandha, Nahida's Elemental Mastery will be increased by 100/120/140/160."
        ]
      },
      {
        "Name": "The Leaves of Enlightening Speech",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Illusory Heart by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Fruit of Reason's Culmination",
        "Type": "C6",
        "Descriptions": [
          "When Nahida hits an opponent affected by All Schemes to Know's Seeds of Skandha with Normal or Charged Attacks after unleashing Illusory Heart, she will use Tri-Karma Purification: Karmic Oblivion on this opponent and all connected opponents, dealing Dendro DMG based on 200% of Nahida's ATK and 400% of her Elemental Mastery.",
          "DMG dealt by Tri-Karma Purification: Karmic Oblivion is considered Elemental Skill DMG and can be triggered once every 0.2s.",
          "This effect can last up to 10s and will be removed after Nahida has unleashed 6 instances of Tri-Karma Purification: Karmic Oblivion."
        ]
      }
    ],
    "navia": [
      {
        "Name": "A Lady's Rules for Keeping a Courteous Distance",
        "Type": "C1",
        "Descriptions": [
          "Each stack of Crystal Shrapnel consumed when Navia uses Ceremonial Crystalshot will restore 3 Energy to her and decrease the CD of As the Sunlit Sky's Singing Salute by 1s. Up to 9 Energy can be gained this way, and the CD of \"As the Sunlit Sky's Singing Salute\" can be decreased by up to 3s."
        ]
      },
      {
        "Name": "The President's Pursuit of Victory",
        "Type": "C2",
        "Descriptions": [
          "Each stack of Crystal Shrapnel consumed will increase the CRIT Rate of this Ceremonial Crystalshot instance by 12%. CRIT Rate can be increased by up to 36% in this way.",
          "In addition, when Ceremonial Crystalshot hits an opponent, one Cannon Fire Support shot from As the Sunlit Sky's Singing Salute will strike near the location of the hit. Up to one instance of Cannon Fire Support can be triggered each time Ceremonial Crystalshot is used, and DMG dealt by said Cannon Fire Support this way is considered Elemental Burst DMG."
        ]
      },
      {
        "Name": "Businesswoman's Broad Vision",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Ceremonial Crystalshot by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Oathsworn Never Capitulate",
        "Type": "C4",
        "Descriptions": [
          "When As the Sunlit Sky's Singing Salute hits an opponent, that opponent's Geo RES will be decreased by 20% for 8s."
        ]
      },
      {
        "Name": "Negotiator's Resolute Negotiations",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of As the Sunlit Sky's Singing Salute by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "The Flexible Finesse of the Spina's President",
        "Type": "C6",
        "Descriptions": [
          "If more than 3 stacks of Crystal Shrapnel are consumed when using Ceremonial Crystalshot, each stack consumed beyond the first 3 increases the CRIT DMG of that Ceremonial Crystalshot by 45%, and any stacks consumed beyond the first 3 are returned to Navia."
        ]
      }
    ],
    "neuvillette": [
      {
        "Name": "Venerable Institution",
        "Type": "C1",
        "Descriptions": [
          "When Neuvillette takes the field, he will obtain 1 stack of Past Draconic Glories from the Passive Talent \"Heir to the Ancient Sea's Authority.\" You must first unlock the Passive Talent \"Heir to the Ancient Sea's Authority.\"",
          "Additionally, his interruption resistance will be increased while using the Charged Attack Empowerment: Legal Evaluation and the Charged Attack: Equitable Judgment."
        ]
      },
      {
        "Name": "Juridical Exhortation",
        "Type": "C2",
        "Descriptions": [
          "The Passive Talent \"Heir to the Ancient Sea's Authority\" will be enhanced: Each stack of Past Draconic Glories will increase the CRIT DMG of Charged Attack: Equitable Judgment by 14%. The maximum increase that can be achieved this way is 42%.",
          "You must first unlock the Passive Talent \"Heir to the Ancient Sea's Authority.\""
        ]
      },
      {
        "Name": "Ancient Postulation",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Normal Attack: As Water Seeks Equilibrium by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Crown of Commiseration",
        "Type": "C4",
        "Descriptions": [
          "When Neuvillette is on the field and is healed, 1 Sourcewater Droplet will be generated. This effect can occur once every 4s."
        ]
      },
      {
        "Name": "Axiomatic Judgment",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of O Tides, I Have Returned by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Wrathful Recompense",
        "Type": "C6",
        "Descriptions": [
          "When using Charged Attack: Equitable Judgment, Neuvillette can absorb nearby Sourcewater Droplets in an AoE. Each absorbed Droplet will increase the duration of Charged Attack: Equitable Judgment by 1s.",
          "Additionally, when Equitable Judgment hits opponents, it will fire off 2 additional currents every 2s, each of which will deal 10% of Neuvillette's Max HP as Hydro DMG. DMG dealt this way will count as DMG dealt by Equitable Judgment."
        ]
      }
    ],
    "nilou": [
      {
        "Name": "Dance of the Waning Moon",
        "Type": "C1",
        "Descriptions": [
          "Dance of Haftkarsvar will be enhanced as follows:",
          "Luminous Illusion DMG is increased by 65%.",
          "The Tranquility Aura's duration is extended by 6s."
        ]
      },
      {
        "Name": "The Starry Skies Their Flowers Rain",
        "Type": "C2",
        "Descriptions": [
          "After characters affected by the Golden Chalice's Bounty deal Hydro DMG to an opponent, that opponent's Hydro RES will be decreased by 35% for 10s. After a triggered Bloom reaction deals DMG to opponents, their Dendro RES will be decreased by 35% for 10s.",
          "You need to have unlocked the \"Court of Dancing Petals\" Talent."
        ]
      },
      {
        "Name": "Beguiling Shadowstep",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Dance of Abzendegi: Distant Dreams, Listening Spring by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Fricative Pulse",
        "Type": "C4",
        "Descriptions": [
          "After the third dance step of Dance of Haftkarsvar's Pirouette hits opponents, Nilou will gain 15 Elemental Energy, and DMG from her Dance of Abzendegi: Distant Dreams, Listening Spring will be increased by 50% for 8s."
        ]
      },
      {
        "Name": "Twirling Light",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Dance of Haftkarsvar by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Frostbreaker's Melody",
        "Type": "C6",
        "Descriptions": [
          "For every 1,000 points of Max HP, Nilou's CRIT Rate and CRIT DMG will increase by 0.6% and 1.2% respectively.",
          "The maximum increase in CRIT Rate and CRIT DMG via this method is 30% and 60% respectively."
        ]
      }
    ],
    "ningguang": [
      {
        "Name": "Piercing Fragments",
        "Type": "C1",
        "Descriptions": [
          "When a Normal Attack hits, it deals AoE DMG."
        ]
      },
      {
        "Name": "Shock Effect",
        "Type": "C2",
        "Descriptions": [
          "When Jade Screen is shattered, its CD will reset.",
          "Can occur once every 6s."
        ]
      },
      {
        "Name": "Majesty be the Array of Stars",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Starshatter by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Exquisite be the Jade, Outshining All Beneath",
        "Type": "C4",
        "Descriptions": [
          "Jade Screen increases nearby characters' Elemental RES by 10%."
        ]
      },
      {
        "Name": "Invincible be the Jade Screen",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Jade Screen by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Grandeur be the Seven Stars",
        "Type": "C6",
        "Descriptions": [
          "When Starshatter is used, Ningguang gains 7 Star Jades."
        ]
      }
    ],
    "noelle": [
      {
        "Name": "I Got Your Back",
        "Type": "C1",
        "Descriptions": [
          "While Sweeping Time and Breastplate are both in effect, the chance of Breastplate's healing effects activating is increased to 100%."
        ]
      },
      {
        "Name": "Combat Maid",
        "Type": "C2",
        "Descriptions": [
          "Decreases the Stamina Consumption of Noelle's Charged Attacks by 20% and increases her Charged Attack DMG by 15%."
        ]
      },
      {
        "Name": "Invulnerable Maid",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Breastplate by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "To Be Cleaned",
        "Type": "C4",
        "Descriptions": [
          "When Breastplate's duration expires or it is destroyed by DMG, it will deal 400% ATK of Geo DMG to surrounding opponents."
        ]
      },
      {
        "Name": "Favonius Sweeper Master",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Sweeping Time by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Must Be Spotless",
        "Type": "C6",
        "Descriptions": [
          "Sweeping Time increases Noelle's ATK by an additional 50% of her DEF.",
          "Additionally, every opponent defeated during the skill's duration adds 1s to the duration, up to 10s."
        ]
      }
    ],
    "qiqi": [
      {
        "Name": "Ascetics of Frost",
        "Type": "C1",
        "Descriptions": [
          "When the Herald of Frost hits an opponent marked by a Fortune-Preserving Talisman, Qiqi regenerates 2 Energy."
        ]
      },
      {
        "Name": "Frozen to the Bone",
        "Type": "C2",
        "Descriptions": [
          "Qiqi's Normal and Charge Attack DMG against opponents affected by Cryo is increased by 15%."
        ]
      },
      {
        "Name": "Ascendant Praise",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Adeptus Art: Preserver of Fortune by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Divine Suppression",
        "Type": "C4",
        "Descriptions": [
          "Targets marked by the Fortune-Preserving Talisman have their ATK decreased by 20%."
        ]
      },
      {
        "Name": "Crimson Lotus Bloom",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Adeptus Art: Herald of Frost by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Rite of Resurrection",
        "Type": "C6",
        "Descriptions": [
          "Using Adeptus Art: Preserver of Fortune revives all fallen party members nearby and regenerates 50% of their HP.",
          "This effect can only occur once every 15 mins."
        ]
      }
    ],
    "raiden_shogun": [
      {
        "Name": "Ominous Inscription",
        "Type": "C1",
        "Descriptions": [
          "Chakra Desiderata will gather Resolve even faster. When Electro characters use their Elemental Bursts, the Resolve gained is increased by 80%. When characters of other Elemental Types use their Elemental Bursts, the Resolve gained is increased by 20%."
        ]
      },
      {
        "Name": "Steelbreaker",
        "Type": "C2",
        "Descriptions": [
          "While using Musou no Hitotachi and in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, the Raiden Shogun's attacks ignore 60% of opponents's DEF."
        ]
      },
      {
        "Name": "Shinkage Bygones",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Secret Art: Musou Shinsetsu by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Pledge of Propriety",
        "Type": "C4",
        "Descriptions": [
          "When the Musou Isshin state applied by Secret Art: Musou Shinsetsu expires, all nearby party members (excluding the Raiden Shogun) gain 30% bonus ATK for 10s."
        ]
      },
      {
        "Name": "Shogun's Descent",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Transcendence: Baleful Omen by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Wishbearer",
        "Type": "C6",
        "Descriptions": [
          "While in the Musou Isshin state applied by Secret Art: Musou Shinsetsu, attacks by the Raiden Shogun that are considered part of her Elemental Burst will decrease all nearby party members' (but not including the Raiden Shogun herself) Elemental Burst CD by 1s when they hit opponents.",
          "This effect can trigger once every 1s, and can trigger a total of 5 times during the state's duration."
        ]
      }
    ],
    "razor": [
      {
        "Name": "Wolf's Instinct",
        "Type": "C1",
        "Descriptions": [
          "Picking up an Elemental Orb or Particle increases Razor's DMG by 10% for 8s."
        ]
      },
      {
        "Name": "Suppression",
        "Type": "C2",
        "Descriptions": [
          "Increases CRIT Rate against opponents with less than 30% HP by 10%."
        ]
      },
      {
        "Name": "Soul Companion",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Lightning Fang by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Bite",
        "Type": "C4",
        "Descriptions": [
          "When casting Claw and Thunder (Press), opponents hit will have their DEF decreased by 15% for 7s."
        ]
      },
      {
        "Name": "Sharpened Claws",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Claw and Thunder by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Lupus Fulguris",
        "Type": "C6",
        "Descriptions": [
          "Every 10s, Razor's sword charges up, causing the next Normal Attack to release lightning that deals 100% of Razor's ATK as Electro DMG.",
          "When Razor is not using Lightning Fang, a lightning strike on an opponent will grant Razor an Electro Sigil for Claw and Thunder."
        ]
      }
    ],
    "rosaria": [
      {
        "Name": "Unholy Revelation",
        "Type": "C1",
        "Descriptions": [
          "When Rosaria deals a CRIT Hit, her ATK SPD increases by 10% and her Normal Attack DMG increases by 10% for 4s."
        ]
      },
      {
        "Name": "Land Without Promise",
        "Type": "C2",
        "Descriptions": [
          "The duration of the Ice Lance created by Rites of Termination is increased by 4s."
        ]
      },
      {
        "Name": "The Wages of Sin",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Ravaging Confession by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Painful Grace",
        "Type": "C4",
        "Descriptions": [
          "Ravaging Confession's CRIT Hits regenerate 5 Energy for Rosaria.",
          "Can only be triggered once each time Ravaging Confession is cast."
        ]
      },
      {
        "Name": "Last Rites",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Rites of Termination by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Divine Retribution",
        "Type": "C6",
        "Descriptions": [
          "Rites of Termination's attack decreases opponents' Physical RES by 20% for 10s."
        ]
      }
    ],
    "kujou_sara": [
      {
        "Name": "Crow's Eye",
        "Type": "C1",
        "Descriptions": [
          "When Tengu Juurai grant characters ATK Bonuses or hits opponents, the CD of Tengu Stormcall is decreased by 1s.",
          "This effect can be triggered once every 3s."
        ]
      },
      {
        "Name": "Dark Wings",
        "Type": "C2",
        "Descriptions": [
          "Unleashing Tengu Stormcall will leave a weaker Crowfeather at Kujou Sara's original position that will deal 30% of its original DMG."
        ]
      },
      {
        "Name": "The War Within",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Subjugation: Koukou Sendou by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Conclusive Proof",
        "Type": "C4",
        "Descriptions": [
          "The number of Tengu Juurai: Stormcluster released by Subjugation: Koukou Sendou is increased to 6."
        ]
      },
      {
        "Name": "Spellsinger",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Tengu Stormcall by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sin of Pride",
        "Type": "C6",
        "Descriptions": [
          "The Electro DMG of characters who have had their ATK increased by Tengu Juurai has its Crit DMG increased by 60%."
        ]
      }
    ],
    "sayu": [
      {
        "Name": "Multi-Task no Jutsu",
        "Type": "C1",
        "Descriptions": [
          "The Muji-Muji Daruma created by Yoohoo Art: Mujina Flurry will ignore HP limits and can simultaneously attack nearby opponents and heal characters."
        ]
      },
      {
        "Name": "Egress Prep",
        "Type": "C2",
        "Descriptions": [
          "Yoohoo Art: Fuuin Dash gains the following effects:",
          "DMG of Fuufuu Whirlwind Kick in Tapping (mobile)/Press (PC & PlayStation) Mode increased by 3.3%.",
          "Every 0.5s in the Fuufuu Windwheel state will increase the DMG of this Fuufuu Whirlwind Kick by 3.3%. The maximum DMG increase possible through this method is 66%."
        ]
      },
      {
        "Name": "Eh, the Bunshin Can Handle It",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Yoohoo Art: Mujina Flurry by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Skiving: New and Improved",
        "Type": "C4",
        "Descriptions": [
          "Sayu recovers 1.2 Energy when she triggers a Swirl reaction.",
          "This effect occurs once every 2s."
        ]
      },
      {
        "Name": "Speed Comes First",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Yoohoo Art: Fuuin Dash by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Sleep O'Clock",
        "Type": "C6",
        "Descriptions": [
          "The Muji-Muji Daruma created by Sayu's Yoohoo Art: Mujina Flurry will now also benefit from her Elemental Mastery. Each point of Sayu's Elemental Mastery will produce the following effects:",
          "Increases the damage dealt by the Muji-Muji Daruma's attacks by 0.2% ATK. A maximum of 400% ATK can be gained via this method.",
          "Increases the HP restored by the Muji-Muji Daruma by 3. A maximum of 6,000 additional HP can be restored in this manner."
        ]
      }
    ],
    "shenhe": [
      {
        "Name": "Clarity of Heart",
        "Type": "C1",
        "Descriptions": [
          "Spring Spirit Summoning can be used 1 more time."
        ]
      },
      {
        "Name": "Centered Spirit",
        "Type": "C2",
        "Descriptions": [
          "Divine Maiden's Deliverance lasts for 6 seconds longer.",
          "Active characters within the skill's field deals 15% increased Cryo CRIT DMG."
        ]
      },
      {
        "Name": "Seclusion",
        "Type": "C3",
        "Descriptions": [
          "Increases Level of Spring Spirit Summoning by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Insight",
        "Type": "C4",
        "Descriptions": [
          "When characters under the effect of Icy Quill applied by Shenhe triggers its DMG Bonus effects, Shenhe will gain a Skyfrost Mantra stack:",
          "When Shenhe uses Spring Spirit Summoning, she will consume all stacks of Skyfrost Mantra, increasing the DMG of that Spring Spirit Summoning by 5% for each stack consumed.",
          "Max 50 stacks. Stacks last for 60s."
        ]
      },
      {
        "Name": "Divine Attainment",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Divine Maiden's Deliverance by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Mystical Abandon",
        "Type": "C6",
        "Descriptions": [
          "When characters trigger Icy Quill's effects using Normal and Charged Attack DMG, it does not count toward the Trigger Quota."
        ]
      }
    ],
    "kuki_shinobu": [
      {
        "Name": "To Cloister Compassion",
        "Type": "C1",
        "Descriptions": [
          "Gyoei Narukami Kariyama Rite's AoE is increased by 50%."
        ]
      },
      {
        "Name": "To Forsake Fortune",
        "Type": "C2",
        "Descriptions": [
          "Grass Ring of Sanctification's duration is increased by 3s."
        ]
      },
      {
        "Name": "To Sequester Sorrow",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Sanctifying Ring by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "To Sever Sealing",
        "Type": "C4",
        "Descriptions": [
          "When the Normal, Charged, or Plunging Attacks of the character affected by Shinobu's Grass Ring of Sanctification hit opponents, a Thundergrass Mark will land on the opponent's position and deal AoE Electro DMG based on 9.7% of Shinobu's Max HP.",
          "This effect can occur once every 5s."
        ]
      },
      {
        "Name": "To Cease Courtesies",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Gyoei Narukami Kariyama Rite by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "To Ward Weakness",
        "Type": "C6",
        "Descriptions": [
          "When Kuki Shinobu takes lethal DMG, this instance of DMG will not take her down. This effect will automatically trigger when her HP reaches 1 and will trigger once every 60s.",
          "When Shinobu's HP drops below 25%, she will gain 150 Elemental Mastery for 15s. This effect will trigger once every 60s."
        ]
      }
    ],
    "sucrose": [
      {
        "Name": "Clustered Vacuum Field",
        "Type": "C1",
        "Descriptions": [
          "Astable Anemohypostasis Creation - 6308 gains 1 additional charge."
        ]
      },
      {
        "Name": "Beth: Unbound Form",
        "Type": "C2",
        "Descriptions": [
          "The duration of Forbidden Creation - Isomer 75 / Type II is increased by 2s."
        ]
      },
      {
        "Name": "Flawless Alchemistress",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Astable Anemohypostasis Creation - 6308 by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Alchemania",
        "Type": "C4",
        "Descriptions": [
          "Every 7 Normal and Charged Attacks, Sucrose will reduce the CD of Astable Anemohypostasis Creation - 6308 by 1-7s."
        ]
      },
      {
        "Name": "Caution: Standard Flask",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Forbidden Creation - Isomer 75 / Type II by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Chaotic Entropy",
        "Type": "C6",
        "Descriptions": [
          "If Forbidden Creation - Isomer 75 / Type II triggers an Elemental Absorption, all party members gain a 20% Elemental DMG Bonus for the corresponding absorbed element during its duration."
        ]
      }
    ],
    "tartaglia": [
      {
        "Name": "Foul Legacy: Tide Withholder",
        "Type": "C1",
        "Descriptions": [
          "Decreases the CD of Foul Legacy: Raging Tide by 20%."
        ]
      },
      {
        "Name": "Foul Legacy: Understream",
        "Type": "C2",
        "Descriptions": [
          "When opponents affected by Riptide are defeated, Tartaglia regenerates 4 Elemental Energy."
        ]
      },
      {
        "Name": "Abyssal Mayhem: Vortex of Turmoil",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Foul Legacy: Raging Tide by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Abyssal Mayhem: Hydrospout",
        "Type": "C4",
        "Descriptions": [
          "If Tartaglia is in Foul Legacy: Raging Tide's Melee Stance, triggers Riptide Slash against opponents on the field affected by Riptide every 4s, otherwise, triggers Riptide Flash.",
          "Riptide Slashes and Riptide Flashes triggered by this Constellation effect are not subject to the time intervals that would typically apply to these two Riptide effects, nor do they have any effect on those time intervals."
        ]
      },
      {
        "Name": "Havoc: Formless Blade",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Havoc: Obliteration by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Havoc: Annihilation",
        "Type": "C6",
        "Descriptions": [
          "When Havoc: Obliteration is cast in Melee Stance, the CD of Foul Legacy: Raging Tide is reset.",
          "This effect will only take place once Tartaglia returns to his Ranged Stance."
        ]
      }
    ],
    "thoma": [
      {
        "Name": "A Comrade's Duty",
        "Type": "C1",
        "Descriptions": [
          "When a character protected by Thoma's own Blazing Barrier (Thoma excluded) is attacked, Thoma's own Blazing Blessing CD is decreased by 3s, while his own Crimson Ooyoroi's CD is decreased by 3s.",
          "This effect can be triggered once every 20s."
        ]
      },
      {
        "Name": "A Subordinate's Skills",
        "Type": "C2",
        "Descriptions": [
          "Crimson Ooyoroi's duration is increased by 3s."
        ]
      },
      {
        "Name": "Fortified Resolve",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Blazing Blessing by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Long-Term Planning",
        "Type": "C4",
        "Descriptions": [
          "After using Crimson Ooyoroi, 15 Energy will be restored to Thoma."
        ]
      },
      {
        "Name": "Raging Wildfire",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Crimson Ooyoroi by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Burning Heart",
        "Type": "C6",
        "Descriptions": [
          "When a Blazing Barrier is obtained or refreshed, the DMG dealt by all party members' Normal, Charged, and Plunging Attacks is increased by 15% for 6s."
        ]
      }
    ],
    "tighnari": [
      {
        "Name": "Beginnings Determined at the Roots",
        "Type": "C1",
        "Descriptions": [
          "Tighnari's Charged Attack CRIT Rate is increased by 15%."
        ]
      },
      {
        "Name": "Origins Known From the Stem",
        "Type": "C2",
        "Descriptions": [
          "When there are opponents within the Vijnana-Khanda Field created by Vijnana-Phala Mine, Tighnari gains 20% Dendro DMG Bonus.",
          "The effect will last up to 6s if the field's duration ends or if it no longer has opponents within it."
        ]
      },
      {
        "Name": "Fortunes Read Amongst the Branches",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Fashioner's Tanglevine Shaft by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Withering Glimpsed in the Leaves",
        "Type": "C4",
        "Descriptions": [
          "When Fashioner's Tanglevine Shaft is unleashed, all nearby party members gain 60 Elemental Mastery for 8s. If the Fashioner's Tanglevine Shaft triggers a Burning, Bloom, Quicken, or Spread reaction, their Elemental Mastery will be further increased by 60. This latter case will also refresh the buff state's duration."
        ]
      },
      {
        "Name": "Comprehension Amidst the Flowers",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Vijnana-Phala Mine by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Karma Adjudged From the Leaden Fruit",
        "Type": "C6",
        "Descriptions": [
          "Wreath Arrow's charging time is decreased by 0.9s, and will produce 1 additional Clusterbloom Arrow upon hit. This arrow deals 150% of Tighnari's ATK as DMG."
        ]
      }
    ],
    "venti": [
      {
        "Name": "Splitting Gales",
        "Type": "C1",
        "Descriptions": [
          "Fires 2 additional arrows per Aimed Shot, each dealing 33% of the original arrow's DMG."
        ]
      },
      {
        "Name": "Breeze of Reminiscence",
        "Type": "C2",
        "Descriptions": [
          "Skyward Sonnet decreases opponents' Anemo RES and Physical RES by 12% for 10s.",
          "Opponents launched by Skyward Sonnet suffer an additional 12% Anemo RES and Physical RES decrease while airborne."
        ]
      },
      {
        "Name": "Ode to Thousand Winds",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Wind's Grand Ode by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Hurricane of Freedom",
        "Type": "C4",
        "Descriptions": [
          "When Venti picks up an Elemental Orb or Particle, he receives a 25% Anemo DMG Bonus for 10s."
        ]
      },
      {
        "Name": "Concerto dal Cielo",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Skyward Sonnet by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Storm of Defiance",
        "Type": "C6",
        "Descriptions": [
          "Targets who take DMG from Wind's Grand Ode have their Anemo RES decreased by 20%.",
          "If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
        ]
      }
    ],
    "wanderer": [
      {
        "Name": "Shoban: Ostentatious Plumage",
        "Type": "C1",
        "Descriptions": [
          "When in the Windfavored state, the Attack SPD of the Wanderer's Kuugo: Fushoudan and Kuugo: Toufukai is increased by 10%.",
          "Additionally, the wind arrows fired by the Passive Talent \"Gales of Reverie\" will deal an additional 25% of his ATK as DMG. You must unlock the Passive Talent \"Gales of Reverie\" first."
        ]
      },
      {
        "Name": "Niban: Moonlit Isle Amidst White Waves",
        "Type": "C2",
        "Descriptions": [
          "When in the Windfavored state, Kyougen: Five Ceremonial Plays will see its DMG increased by 4% per point of difference between the max amount of Kuugoryoku Points contrasted with Kuugoryoku's present capacity when using this skill.",
          "Through this method, you can increase Kyougen: Five Ceremonial Plays's DMG by a maximum of 200%."
        ]
      },
      {
        "Name": "Sanban: Moonflower Kusemai",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Kyougen: Five Ceremonial Plays by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Yonban: Set Adrift into Spring",
        "Type": "C4",
        "Descriptions": [
          "When casting Hanega: Song of the Wind, should the Passive Talent \"Jade-Claimed Flower\" be triggered, the character will gain buffs in correspondence to the contacted Elemental Type(s), and also obtain a random untriggered buff. A maximum of 3 such corresponding elemental buffs can exist simultaneously.",
          "You must unlock the Passive Talent \"Jade-Claimed Flower\" first."
        ]
      },
      {
        "Name": "Matsuban: Ancient Illuminator From Abroad",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Hanega: Song of the Wind by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Shugen: The Curtains' Melancholic Sway",
        "Type": "C6",
        "Descriptions": [
          "When the Wanderer actively hits an opponent with Kuugo: Fushoudan while in the Windfavored state, the following effects will occur:",
          "Deals an additional instance of Kuugo: Fushoudan at the position hit, dealing 40% of the attack's original DMG. This DMG will be considered Normal Attack DMG.",
          "When the Wanderer falls below 40 Kuugoryoku Points, restores 4 Points to him. Kuugoryoku Points can be restored in this manner once every 0.2s. This restoration can occur up to 5 times within one Windfavored duration."
        ]
      }
    ],
    "wriothesley": [
      {
        "Name": "Terror for the Evildoers",
        "Type": "C1",
        "Descriptions": [
          "The Gracious Rebuke from the Passive Talent \"There Shall Be a Plea for Justice\" is changed to this:",
          "When Wriothesley's HP is less than 60% or while he is in the Chilling Penalty state caused by Icefang Rush, when the fifth attack of Repelling Fists hits, it will create a Gracious Rebuke. 1 Gracious Rebuke effect can be obtained every 2.5s.",
          "Additionally, Rebuke: Vaulting Fist will obtain the following enhancement:",
          "The DMG Bonus gained will be further increased to 200%.",
          "When it hits while Wriothesley is in the Chilling Penalty state, that state's duration is extended by 4s. 1 such extension can occur per 1 Chilling Penalty duration.",
          "You must first unlock the Passive Talent \"There Shall Be a Plea for Justice.\""
        ]
      },
      {
        "Name": "Shackles for the Arrogant",
        "Type": "C2",
        "Descriptions": [
          "When using Darkgold Wolfbite, each Prosecution Edict stack from the Passive Talent \"There Shall Be a Reckoning for Sin\" will increase said ability's DMG dealt by 40%.",
          "You must first unlock the Passive Talent \"There Shall Be a Reckoning for Sin.\""
        ]
      },
      {
        "Name": "Punishment for the Frauds",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Normal Attack: Forceful Fists of Frost by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Redemption for the Suffering",
        "Type": "C4",
        "Descriptions": [
          "The HP restored to Wriothesley through Rebuke: Vaulting Fist will be increased to 50% of his Max HP. You must first unlock the Passive Talent \"There Shall Be a Plea for Justice.\"",
          "Additionally, when Wriothesley is healed, if the amount of healing overflows, the following effects will occur depending on whether he is on the field or not. If he is on the field, his ATK SPD will be increased by 20% for 4s. If he is off-field, all of your own party members' ATK SPD will be increased by 10% for 6s. These two methods of increasing ATK SPD cannot stack."
        ]
      },
      {
        "Name": "Mercy for the Wronged",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Darkgold Wolfbite by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Esteem for the Innocent",
        "Type": "C6",
        "Descriptions": [
          "The CRIT Rate of Rebuke: Vaulting Fist will be increased by 10%, and its CRIT DMG by 80%. When unleashed, it will also create an additional icicle that deals 100% of Rebuke: Vaulting Fist's Base DMG as Cryo DMG. DMG dealt this way is regarded as Charged Attack DMG.",
          "You must first unlock the Passive Talent \"There Shall Be a Plea for Justice.\""
        ]
      }
    ],
    "xiangling": [
      {
        "Name": "Crispy Outside, Tender Inside",
        "Type": "C1",
        "Descriptions": [
          "Opponents hit by Guoba's attacks have their Pyro RES reduced by 15% for 6s."
        ]
      },
      {
        "Name": "Oil Meets Fire",
        "Type": "C2",
        "Descriptions": [
          "The last attack in a Normal Attack sequence applies the Implode status onto the opponent for 2s. An explosion will occur once this duration ends, dealing 75% of Xiangling's ATK as AoE Pyro DMG."
        ]
      },
      {
        "Name": "Deepfry",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Pyronado by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Slowbake",
        "Type": "C4",
        "Descriptions": [
          "Pyronado's duration is increased by 40%."
        ]
      },
      {
        "Name": "Guoba Mad",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Guoba Attack by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Condensed Pyronado",
        "Type": "C6",
        "Descriptions": [
          "For the duration of Pyronado, all party members receive a 15% Pyro DMG Bonus."
        ]
      }
    ],
    "xiao": [
      {
        "Name": "Dissolution Eon: Destroyer of Worlds",
        "Type": "C1",
        "Descriptions": [
          "Increases Lemniscatic Wind Cycling's charges by 1."
        ]
      },
      {
        "Name": "Annihilation Eon: Blossom of Kaleidos",
        "Type": "C2",
        "Descriptions": [
          "When in the party and not on the field, Xiao's Energy Recharge is increased by 25%."
        ]
      },
      {
        "Name": "Conqueror of Evil: Wrath Deity",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Lemniscatic Wind Cycling by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Transcension: Extinction of Suffering",
        "Type": "C4",
        "Descriptions": [
          "When Xiao's HP falls below 50%, he gains a 100% DEF Bonus."
        ]
      },
      {
        "Name": "Evolution Eon: Origin of Ignorance",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Bane of All Evil by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Conqueror of Evil: Guardian Yaksha",
        "Type": "C6",
        "Descriptions": [
          "While under the effects of Bane of All Evil, hitting at least 2 opponents with Xiao's Plunging Attack will immediately grant him 1 charge of Lemniscatic Wind Cycling, and for the next 1s, he may use Lemniscatic Wind Cycling while ignoring its CD."
        ]
      }
    ],
    "xingqiu": [
      {
        "Name": "The Scent Remained",
        "Type": "C1",
        "Descriptions": [
          "Increases the maximum number of Rain Swords by 1."
        ]
      },
      {
        "Name": "Rainbow Upon the Azure Sky",
        "Type": "C2",
        "Descriptions": [
          "Extends the duration of Guhua Sword: Raincutter by 3s.",
          "Decreases the Hydro RES of opponents hit by sword rain attacks by 15% for 4s."
        ]
      },
      {
        "Name": "Weaver of Verses",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Guhua Sword: Raincutter by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Evilsoother",
        "Type": "C4",
        "Descriptions": [
          "Throughout the duration of Guhua Sword: Raincutter, the DMG dealt by Guhua Sword: Fatal Rainscreen is increased by 50%."
        ]
      },
      {
        "Name": "Embrace of Rain",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Guhua Sword: Fatal Rainscreen by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Hence, Call Them My Own Verses",
        "Type": "C6",
        "Descriptions": [
          "Activating 2 of Guhua Sword: Raincutter's sword rain attacks greatly enhances the third sword rain attack. On hit, the third sword rain attack also regenerates 3 Energy for Xingqiu."
        ]
      }
    ],
    "xinyan": [
      {
        "Name": "Fatal Acceleration",
        "Type": "C1",
        "Descriptions": [
          "Upon scoring a CRIT Hit, increases ATK SPD of Xinyan's Normal and Charged Attacks by 12% for 5s.",
          "Can only occur once every 5s."
        ]
      },
      {
        "Name": "Impromptu Opening",
        "Type": "C2",
        "Descriptions": [
          "Riff Revolution's Physical DMG has its CRIT Rate increased by 100%, and will form a shield at Shield Level 3: Rave when cast."
        ]
      },
      {
        "Name": "Double-Stop",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Sweeping Fervor by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Wildfire Rhythm",
        "Type": "C4",
        "Descriptions": [
          "Sweeping Fervor's swing DMG decreases opponent's Physical RES by 15% for 12s."
        ]
      },
      {
        "Name": "Screamin' for an Encore",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Riff Revolution by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Rockin' in a Flaming World",
        "Type": "C6",
        "Descriptions": [
          "Decreases the Stamina Consumption of Xinyan's Charged Attacks by 30%. Additionally, Xinyan's Charged Attacks gain an ATK Bonus equal to 50% of her DEF."
        ]
      }
    ],
    "yae_miko": [
      {
        "Name": "Yakan Offering",
        "Type": "C1",
        "Descriptions": [
          "Each time Great Secret Art: Tenko Kenshin activates a Tenko Thunderbolt, Yae Miko will restore 8 Elemental Energy for herself."
        ]
      },
      {
        "Name": "Fox's Mooncall",
        "Type": "C2",
        "Descriptions": [
          "Sesshou Sakura start at Level 2 when created, their max level is increased to 4, and their attack range is increased by 60%."
        ]
      },
      {
        "Name": "The Seven Glamours",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Yakan Evocation: Sesshou Sakura by 3.",
          "Maximum ugprade level is 15."
        ]
      },
      {
        "Name": "Sakura Channeling",
        "Type": "C4",
        "Descriptions": [
          "When Sesshou Sakura lightning hits opponents, the Electro DMG Bonus of all nearby party members is increased by 20% for 5s."
        ]
      },
      {
        "Name": "Mischievous Teasing",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Great Secret Art: Tenko Kenshin by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Forbidden Art: Daisesshou",
        "Type": "C6",
        "Descriptions": [
          "The Sesshou Sakura's attacks will ignore 60% of the opponent's DEF."
        ]
      }
    ],
    "yanfei": [
      {
        "Name": "The Law Knows No Kindness",
        "Type": "C1",
        "Descriptions": [
          "When Yanfei uses her Charged Attack, each existing Scarlet Seal additionally reduces the stamina cost of this Charged Attack by 10% and increases resistance against interruption during its release."
        ]
      },
      {
        "Name": "Right of Final Interpretation",
        "Type": "C2",
        "Descriptions": [
          "Increases Yanfei's Charged Attack CRIT Rate by 20% against enemies below 50% HP."
        ]
      },
      {
        "Name": "Samadhi Fire-Forged",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Signed Edict by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Supreme Amnesty",
        "Type": "C4",
        "Descriptions": [
          "When Done Deal is used:",
          "Creates a shield that absorbs up to 45% of Yanfei's Max HP for 15s.",
          "This shield absorbs Pyro DMG 250% more effectively."
        ]
      },
      {
        "Name": "Abiding Affidavit",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Done Deal by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Extra Clause",
        "Type": "C6",
        "Descriptions": [
          "Increases the maximum number of Scarlet Seals by 1."
        ]
      }
    ],
    "yaoyao": [
      {
        "Name": "Adeptus' Tutelage",
        "Type": "C1",
        "Descriptions": [
          "When White Jade Radishes explode, active characters within their AoE will gain 15% Dendro DMG Bonus for 8s and have 15 Stamina restored to them. This form of Stamina Restoration can only be triggered every 5s."
        ]
      },
      {
        "Name": "Innocent",
        "Type": "C2",
        "Descriptions": [
          "While affected by the Adeptal Legacy state caused by Moonjade Descent, if White Jade Radish explosions damage opponents, 3 Energy will be restored to Yaoyao. This form of Energy regeneration can occur once every 0.8s."
        ]
      },
      {
        "Name": "Loyal and Kind",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Raphanus Sky Cluster by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Winsome",
        "Type": "C4",
        "Descriptions": [
          "After using Raphanus Sky Cluster or Moonjade Descent, Yaoyao's Elemental Mastery will be increased based on 0.3% of her Max HP for 8s. The maximum Elemental Mastery she can gain this way is 120."
        ]
      },
      {
        "Name": "Compassionate",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Moonjade Descent by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Beneficent",
        "Type": "C6",
        "Descriptions": [
          "For every 2 White Jade Radishes Yuegui: Throwing Mode throws out, it will also throw a Mega Radish that will have a larger AoE than the standard White Jade Radish and have the following effects upon exploding:",
          "Deals AoE Dendro DMG based on 75% of Yaoyao's ATK.",
          "Restores HP for the active character based on 7.5% of Yaoyao's Max HP.",
          "Every Yuegei: Throwing Mode can throw out a maximum of 2 Mega Radishes."
        ]
      }
    ],
    "yelan": [
      {
        "Name": "Enter the Plotters",
        "Type": "C1",
        "Descriptions": [
          "Lingering Lifeline gains 1 additional charge."
        ]
      },
      {
        "Name": "Taking All Comers",
        "Type": "C2",
        "Descriptions": [
          "When Exquisite Throw conducts a coordinated attack, it will fire an additional water arrow that will deal 14% of Yelan's Max HP as Hydro DMG.",
          "This effect can trigger once every 1.8s."
        ]
      },
      {
        "Name": "Beware the Trickster's Dice",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Depth-Clarion Dice by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Bait-and-Switch",
        "Type": "C4",
        "Descriptions": [
          "Increases all party members' Max HP by 10% for 25s for every opponent marked by Lifeline when the Lifeline explodes. A maximum increase of 40% Max HP can be attained in this manner."
        ]
      },
      {
        "Name": "Dealer's Sleight",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Lingering Lifeline by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Winner Takes All",
        "Type": "C6",
        "Descriptions": [
          "After using Depth-Clarion Dice, Yelan will enter the Mastermind state.",
          "In this state, all of Yelan's Normal Attacks will be special Breakthrough Barbs. These Breakthrough Barbs will have similar abilities to normal ones and the DMG dealt will be considered Charged Attack DMG, dealing 156% of a normal Breakthrough Barb's DMG.",
          "The Mastermind state lasts 20s and will be cleared after Yelan fires 5 arrows."
        ]
      }
    ],
    "yoimiya": [
      {
        "Name": "Agate Ryuukin",
        "Type": "C1",
        "Descriptions": [
          "The Aurous Blaze created by Ryuukin Saxifrage lasts for an extra 4s.",
          "Additionally, when an opponent affected by Aurous Blaze is defeated within its duration, Yoimiya's ATK is increased by 20% for 20s."
        ]
      },
      {
        "Name": "A Procession of Bonfires",
        "Type": "C2",
        "Descriptions": [
          "When Yoimiya's Pyro DMG scores a CRIT Hit, Yoimiya will gain a 25% Pyro DMG Bonus for 6s.",
          "This effect can be triggered even when Yoimiya is not the active character."
        ]
      },
      {
        "Name": "Trickster's Flare",
        "Type": "C3",
        "Descriptions": [
          "Increase the Level of Niwabi Fire-Dance by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Pyrotechnic Professional",
        "Type": "C4",
        "Descriptions": [
          "When Yoimiya's own Aurous Blaze triggers an explosion, Niwabi Fire-Dance's CD is decreased by 1.2."
        ]
      },
      {
        "Name": "A Summer Festival's Eve",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Ryuukin Saxifrage by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Naganohara Meteor Swarm",
        "Type": "C6",
        "Descriptions": [
          "During Niwabi Fire-Dance, Yoimiya's Normal Attacks have a 50% chance of firing an extra Kindling Arrow that deals 60% of its original DMG. This DMG is considered Normal Attack DMG."
        ]
      }
    ],
    "yun_jin": [
      {
        "Name": "Thespian Gallop",
        "Type": "C1",
        "Descriptions": [
          "Opening Flourish's CD is decreased by 18%."
        ]
      },
      {
        "Name": "Myriad Mise-En-Scène",
        "Type": "C2",
        "Descriptions": [
          "After Cliffbreaker's Banner is unleashed, all nearby party members' Normal Attack DMG is increased by 15% for 12s."
        ]
      },
      {
        "Name": "Seafaring General",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Cliffbreaker's Banner by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Flower and a Fighter",
        "Type": "C4",
        "Descriptions": [
          "When Yun Jin triggers the Crystallize Reaction, her DEF is increased by 20% for 12s."
        ]
      },
      {
        "Name": "Famed Throughout the Land",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Opening Flourish by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Decorous Harmony",
        "Type": "C6",
        "Descriptions": [
          "Characters under the effects of the Flying Cloud Flag Formation have their Normal ATK SPD increased by 12%."
        ]
      }
    ],
    "zhongli": [
      {
        "Name": "Rock, the Backbone of Earth",
        "Type": "C1",
        "Descriptions": [
          "Increases the maximum number of Stone Steles created by Dominus Lapidis that may exist simultaneously to 2."
        ]
      },
      {
        "Name": "Stone, the Cradle of Jade",
        "Type": "C2",
        "Descriptions": [
          "Planet Befall grants nearby characters on the field a Jade Shield when it descends."
        ]
      },
      {
        "Name": "Jade, Shimmering through Darkness",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Dominus Lapidis by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Topaz, Unbreakable and Fearless",
        "Type": "C4",
        "Descriptions": [
          "Increases Planet Befall's AoE by 20% and increases the duration of Planet Befall's Petrification effect by 2s."
        ]
      },
      {
        "Name": "Lazuli, Herald of the Order",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Planet Befall by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Chrysos, Bounty of Dominator",
        "Type": "C6",
        "Descriptions": [
          "When the Jade Shield takes DMG, 40% of that incoming DMG is converted to HP for the current character.",
          "A single instance of regeneration cannot exceed 8% of that character's Max HP."
        ]
      }
    ],
    "traveler_anemo": [
      {
        "Name": "Raging Vortex",
        "Type": "C1",
        "Descriptions": [
          "Palm Vortex pulls in opponents and objects within a 5m radius."
        ]
      },
      {
        "Name": "Uprising Whirlwind",
        "Type": "C2",
        "Descriptions": [
          "Increases Energy Recharge by 16%."
        ]
      },
      {
        "Name": "Sweeping Gust",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Gust Surge by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Cherishing Breezes",
        "Type": "C4",
        "Descriptions": [
          "Reduces DMG taken while casting Palm Vortex by 10%."
        ]
      },
      {
        "Name": "Vortex Stellaris",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Palm Vortex by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Intertwined Winds",
        "Type": "C6",
        "Descriptions": [
          "Targets who take DMG from Gust Surge have their Anemo RES decreased by 20%.",
          "If an Elemental Absorption occurred, then their RES towards the corresponding Element is also decreased by 20%."
        ]
      }
    ],
    "traveler_geo": [
      {
        "Name": "Invincible Stonewall",
        "Type": "C1",
        "Descriptions": [
          "Party members within the radius of Wake of Earth have their CRIT Rate increased by 10% and have increased resistance against interruption."
        ]
      },
      {
        "Name": "Rockcore Meltdown",
        "Type": "C2",
        "Descriptions": [
          "When the meteorite created by Starfell Sword is destroyed, it will also explode, dealing additional AoE Geo DMG equal to the amount of damage dealt by Starfell Sword."
        ]
      },
      {
        "Name": "Will of the Rock",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Wake of Earth by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Reaction Force",
        "Type": "C4",
        "Descriptions": [
          "The shockwave triggered by Wake of Earth regenerates 5 Energy for every opponent hit.",
          "A maximum of 25 Energy can be regenerated in this manner at any one time."
        ]
      },
      {
        "Name": "Meteorite Impact",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Starfell Sword by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Everlasting Boulder",
        "Type": "C6",
        "Descriptions": [
          "The barrier created by Wake of Earth lasts 5s longer.",
          "The meteorite created by Starfell Sword lasts 10s longer."
        ]
      }
    ],
    "traveler_electro": [
      {
        "Name": "Spring Thunder of Fertility",
        "Type": "C1",
        "Descriptions": [
          "The number of Abundance Amulets that can be generated using Lightning Blade is increased to 3."
        ]
      },
      {
        "Name": "Violet Vehemence",
        "Type": "C2",
        "Descriptions": [
          "When Falling Thunder created by Bellowing Thunder hits an opponent, it will decrease their Electro RES by 15% for 8s."
        ]
      },
      {
        "Name": "Distant Crackling",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Bellowing Thunder by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Fickle Cloudstrike",
        "Type": "C4",
        "Descriptions": [
          "When a character obtains Abundance Amulets generated by Lightning Blade, if this character's Energy is less than 35%, the Energy restored by the Abundance Amulets is increased by 100%."
        ]
      },
      {
        "Name": "Clamor in the Wilds",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Lightning Blade by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "World-Shaker",
        "Type": "C6",
        "Descriptions": [
          "Every 2 Falling Thunder attacks triggered by Bellowing Thunder will significantly increase the DMG dealt by the next Falling Thunder, dealing 200% of its original DMG, and will restore an additional 1 Energy to the current character."
        ]
      }
    ],
    "traveler_dendro": [
      {
        "Name": "Symbiotic Creeper",
        "Type": "C1",
        "Descriptions": [
          "After Razorgrass Blade hits an opponent, it will regenerate 3.5 Energy for the Traveler."
        ]
      },
      {
        "Name": "Green Resilience",
        "Type": "C2",
        "Descriptions": [
          "Lea Lotus Lamp's duration is increased by 3s."
        ]
      },
      {
        "Name": "Whirling Weeds",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Razorgrass Blade by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Treacle Grass",
        "Type": "C4",
        "Descriptions": [
          "After the Lea Lotus Lamp triggers a Lotuslight Transfiguration, it will obtain 5 stacks of the Overflowing Lotuslight effect from the Passive Talent \"Verdant Overgrowth.\"",
          "You must have unlocked this Passive Talent first."
        ]
      },
      {
        "Name": "Viridian Transience",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Surgent Manifestation by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Withering Aggregation",
        "Type": "C6",
        "Descriptions": [
          "The Dendro DMG Bonus of the character under the effect of Overflowing Lotuslight as created by the Lea Lotus Lamp is increased by 12%. If the Lamp has experienced a Lotuslight Transfiguration previously, the character will also gain 12% DMG Bonus for the corresponding element."
        ]
      }
    ],
    "traveler_hydro": [
      {
        "Name": "Swelling Lake",
        "Type": "C1",
        "Descriptions": [
          "Picking up a Sourcewater Droplet will restore 2 Energy to the Traveler.",
          "Requires the Passive Talent \"Spotless Waters.\""
        ]
      },
      {
        "Name": "Trickling Purity",
        "Type": "C2",
        "Descriptions": [
          "The Movement SPD of Rising Waters' bubble will be decreased by 30%, and its duration increased by 3s."
        ]
      },
      {
        "Name": "Turbulent Ripples",
        "Type": "C3",
        "Descriptions": [
          "Increases the Level of Aquacrest Saber by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Pouring Descent",
        "Type": "C4",
        "Descriptions": [
          "When using Aquacrest Saber, an Aquacrest Aegis that can absorb 10% of the Traveler's Max HP in DMG will be created and will absorb Hydro DMG with 250% effectiveness. It will persist until the Traveler finishes using the skill.",
          "Once every 2s, after a Dewdrop hits an opponent, if the Traveler is being protected by Aquacrest Aegis, the DMG Absorption of the Aegis will be restored to 10% of the Traveler's Max HP. If the Traveler is not presently being protected by an Aegis, one will be redeployed."
        ]
      },
      {
        "Name": "Churning Whirlpool",
        "Type": "C5",
        "Descriptions": [
          "Increases the Level of Rising Waters by 3.",
          "Maximum upgrade level is 15."
        ]
      },
      {
        "Name": "Tides of Justice",
        "Type": "C6",
        "Descriptions": [
          "When the Traveler picks up a Sourcewater Droplet, they will restore HP to the nearest party member with the lowest HP percentage remaining based on 6% of their Max HP."
        ]
      }
    ]
  },
  "Type": "ConstellationLocalization"
}