{
  "LangCode": 0,
  "CharacterAscensionMaterials": {
    "brilliant_diamond_sliver": {
      "Name": "Brilliant Diamond Sliver",
      "Description": "\"Welcome to this world.\"",
      "Effect": null
    },
    "brilliant_diamond_fragment": {
      "Name": "Brilliant Diamond Fragment",
      "Description": "\"Welcome to this world.\"",
      "Effect": null
    },
    "brilliant_diamond_chunk": {
      "Name": "Brilliant Diamond Chunk",
      "Description": "\"Welcome to this world.\"",
      "Effect": null
    },
    "brilliant_diamond_gemstone": {
      "Name": "Brilliant Diamond Gemstone",
      "Description": "\"Welcome to this world.\"",
      "Effect": null
    },
    "agnidus_agate_sliver": {
      "Name": "Agnidus Agate Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "agnidus_agate_fragment": {
      "Name": "Agnidus Agate Fragment",
      "Description": "\"A pilgrimage for a wish; a battle to earn a name...\"",
      "Effect": null
    },
    "agnidus_agate_chunk": {
      "Name": "Agnidus Agate Chunk",
      "Description": "\"A pilgrimage for a wish; a battle to earn a name...\nBurnt to cinders for a dream.\"",
      "Effect": null
    },
    "agnidus_agate_gemstone": {
      "Name": "Agnidus Agate Gemstone",
      "Description": "\"A pilgrimage for a wish; a battle to earn a name...\nBurnt to cinders for a dream.\nIf the intention yet remains, achieved ▉▉'s truth he has.\"",
      "Effect": null
    },
    "varunada_lazurite_sliver": {
      "Name": "Varunada Lazurite Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "varunada_lazurite_fragment": {
      "Name": "Varunada Lazurite Fragment",
      "Description": "\"My ideals have no stains.\"",
      "Effect": null
    },
    "varunada_lazurite_chunk": {
      "Name": "Varunada Lazurite Chunk",
      "Description": "\"My ideals have no stains.\nI must correct you. People here bear no sins in the eyes of the gods...\"",
      "Effect": null
    },
    "varunada_lazurite_gemstone": {
      "Name": "Varunada Lazurite Gemstone",
      "Description": "\"My ideals have no stains.\nI must correct you. People here bear no sins in the eyes of the gods... Only laws and the Tribunal can judge someone.\nThey can judge even me. So praise my magnificence and purity.\"",
      "Effect": null
    },
    "vajrada_amethyst_sliver": {
      "Name": "Vajrada Amethyst Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "vajrada_amethyst_fragment": {
      "Name": "Vajrada Amethyst Fragment",
      "Description": "\"This body is the noblest and most eminent of all in this world.\"",
      "Effect": null
    },
    "vajrada_amethyst_chunk": {
      "Name": "Vajrada Amethyst Chunk",
      "Description": "\"This body is the noblest and most eminent of all in this world.\nIt should hold absolute control over this world.\"",
      "Effect": null
    },
    "vajrada_amethyst_gemstone": {
      "Name": "Vajrada Amethyst Gemstone",
      "Description": "\"This body is the noblest and most eminent of all in this world.\nIt should hold absolute control over this world.\nIt once promised its people a dream: the never-changing 'eternity.\"",
      "Effect": null
    },
    "vayuda_turquoise_sliver": {
      "Name": "Vayuda Turquoise Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "vayuda_turquoise_fragment": {
      "Name": "Vayuda Turquoise Fragment",
      "Description": "\"Still, the winds change direction.\"",
      "Effect": null
    },
    "vayuda_turquoise_chunk": {
      "Name": "Vayuda Turquoise Chunk",
      "Description": "\"Still, the winds change direction.\nSomeday, they will blow towards a brighter future...\"",
      "Effect": null
    },
    "vayuda_turquoise_gemstone": {
      "Name": "Vayuda Turquoise Gemstone",
      "Description": "\"Still, the winds change direction.\nSomeday, they will blow towards a brighter future...\nTake my blessings and live leisurely from this day onward.\"",
      "Effect": null
    },
    "shivada_jade_sliver": {
      "Name": "Shivada Jade Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "shivada_jade_fragment": {
      "Name": "Shivada Jade Fragment",
      "Description": "\"Sorry...\"",
      "Effect": null
    },
    "shivada_jade_chunk": {
      "Name": "Shivada Jade Chunk",
      "Description": "\"Sorry...\n...to also have you shoulder the grievances of the world.\"",
      "Effect": null
    },
    "shivada_jade_gemstone": {
      "Name": "Shivada Jade Gemstone",
      "Description": "\"Sorry... to also have you shoulder the grievances of the world.\nSince you could endure my bitter cold, you must have the desire to burn?\nThen, burn away the old world for me.\"",
      "Effect": null
    },
    "prithiva_topaz_sliver": {
      "Name": "Prithiva Topaz Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "prithiva_topaz_fragment": {
      "Name": "Prithiva Topaz Fragment",
      "Description": "\"The currencies that flow through this land are my flesh and blood.\"",
      "Effect": null
    },
    "prithiva_topaz_chunk": {
      "Name": "Prithiva Topaz Chunk",
      "Description": "\"The currencies that flow through this land are my flesh and blood.\nFor thus did I become the guarantor of the people's hard work, wisdom, and future.\"",
      "Effect": null
    },
    "prithiva_topaz_gemstone": {
      "Name": "Prithiva Topaz Gemstone",
      "Description": "\"The currencies that flow through this land are my flesh and blood.\nFor thus did I become the guarantor of the people's hard work, wisdom, and future.\nThis is the trust I have placed in them. Betray it, and you taint my blood.\"",
      "Effect": null
    },
    "nagadus_emerald_sliver": {
      "Name": "Nagadus Emerald Sliver",
      "Description": "Character Ascension Material.",
      "Effect": null
    },
    "nagadus_emerald_fragment": {
      "Name": "Nagadus Emerald Fragment",
      "Description": "\"I had a very, very long dream...\"",
      "Effect": null
    },
    "nagadus_emerald_chunk": {
      "Name": "Nagadus Emerald Chunk",
      "Description": "\"I had a very, very long dream...\"\n\"In it, people were holding hands, dancing in a circle, be they sages or fools, dancers or warriors, puppets or statues of gods...\"",
      "Effect": null
    },
    "nagadus_emerald_gemstone": {
      "Name": "Nagadus Emerald Gemstone",
      "Description": "\"I had a very, very long dream...\"\n\"In it, people were holding hands, dancing in a circle, be they sages or fools, dancers or warriors, puppets or statues of gods...\"\n\"That dancing circle embodied everything about the universe. Life has always been the end, while it is wisdom that shall be the means.\"",
      "Effect": null
    }
  },
  "NormalBossMaterials": {
    "hurricane_seed": {
      "Name": "Hurricane Seed",
      "Description": "The imploded form of an Anemo Hypostasis upon its defeat. It contains the essence of Anemo energy.\nIt is said that the power to create hurricanes resides within its seemingly fragile body. This butterfly of pure Anemo energy must be waiting for the day to conjure up storms once again.",
      "Effect": null
    },
    "lightning_prism": {
      "Name": "Lightning Prism",
      "Description": "An Electro Hypostasis channels nearby elemental energy to repair damaged elemental entities. Contains the essence of Electro energy.\nA common prism separates white light into component colors; a Lightning Prism, however, channels flowing energy and weaves them into lightning. It will continue to do so even after the Electro Hypostasis has been defeated.",
      "Effect": null
    },
    "basalt_pillar": {
      "Name": "Basalt Pillar",
      "Description": "A pillar formed by the shell of a Geo Hypostasis, composed of high-density Geo energy. It is a testament to Geo's status as the heaviest of the elements. Maybe the reason a Geo Hypostasis creates this pillar out of its shell and raises itself is just to get closer to the sky, not to combat enemies.",
      "Effect": null
    },
    "hoarfrost_core": {
      "Name": "Hoarfrost Core",
      "Description": "The exposed core of a defeated Cryo Regisvine. Pure Cryo elements are contained within it. Energy and thoughts that swell deep within the earth will eventually erupt on the surface. Even the deathly silent frost will attach to living things on the ground, turning even ordinary vegetation like vines into huge, vicious predators.",
      "Effect": null
    },
    "everflame_seed": {
      "Name": "Everflame Seed",
      "Description": "A seed that fuels the unending flames of the Pyro Regisvine. It emits Pyro energy as if it will burn all that has ever sprouted from the ground.\nEndless desires flow among turbulent energy deep within the earth. What desire could steadily hold such fire to the plants and long so eagerly to bathe everything in unquenchable flames?",
      "Effect": null
    },
    "cleansing_heart": {
      "Name": "Cleansing Heart",
      "Description": "A palmful of eternal water left by an oceanid.\nThough it has already diffused among the depths of the lake, its purity remains all the same. But why would a creature so pure and clean as an oceanid covet the appearance of a being that roams the land, and assume such a form with pure water? They need not breathe nor do they require sustenance...",
      "Effect": null
    },
    "juvenile_jade": {
      "Name": "Juvenile Jade",
      "Description": "A crystalline substance taken from a Primo Geovishap. Within it is contained the potential to become a dragon.\nThese dull crystals are precipitated within the bodies of vishaps sleeping in the mountains. Liyue folklore holds that they will gather power over many years, after which this crystal will, at last, replace their original heart, and the vishap will become a true dragon — one that can shake the mountains and split the earth..",
      "Effect": null
    },
    "crystalline_bloom": {
      "Name": "Crystalline Bloom",
      "Description": "An ice crystal of exceeding purity that is created in the frigid blooming of a Cryo Hypostasis.\nThese frosty crystals will continue to grow according to their own cold, rigid laws, till one day a flower of winter shall bloom and freeze everything.Perhaps it is stagnant time, that never-thawing bosom, that is the essence of this undying flower.",
      "Effect": null
    },
    "marionette_core": {
      "Name": "Marionette Core",
      "Description": "This core can power the inorganic Maguu Kenki and cause it to wield a blade like a living being.\nFlesh decays, and with it decay all martial arts mastery and all poignant memories.\nPerhaps only by converting one's four limbs and body into sturdy mechanical parts, and by at last sacrificing one's very own heart for a sophisticated mechanical one, can one transcend the impermanence of the fleshly form...",
      "Effect": null
    },
    "perpetual_heart": {
      "Name": "Perpetual Heart",
      "Description": "The core that powers the autonomous movements of the Perpetual Mechanical Array.\nSome theorize that the symbols on these cores have knowledge and logic inscribed upon them in a language that eyes cannot perceive. Some go a step further and believe that these unique Ruin machines autonomously decided to forsake a biomimetic form to pursue strength of function on account of their especially large cores and complex inscriptions.",
      "Effect": null
    },
    "smoldering_pearl": {
      "Name": "Smoldering Pearl",
      "Description": "A crystallization of a Pyro Hypostasis that constantly emits heat.\nEven the burning flames shall one day grow cold, and even the ashen firewood can will itself back into a raging blaze. It must then be the will of the world that Pyro Hypostases should constantly cool down and heat up, much like the universe teems with endless life... until the fated darkness shall one day descend and bring it all to naught.",
      "Effect": null
    },
    "dew_of_repudiation": {
      "Name": "Dew of Repudiation",
      "Description": "A strange water droplet left behind by the collapse of the Hydro Hypostasis.\nIt has strong rejection properties, and this forms the basis of one of the Hydro Hypostasis' attack patterns as well. They say that water contains memories and willpower, and that these things can grow when bodies of water meld together. However, the waves conjured by the Hydro Hypostasis are incompatible with the currents that flow above and below ground. Even if it were to flow into the surpassingly pure waters of Petrichor, this drop of water will likely resist assimilation as strongly as mercury.",
      "Effect": null
    },
    "storm_beads": {
      "Name": "Storm Beads",
      "Description": "Crackling Electro pearls left behind by the Thunder Manifestation.\nIt is said that Thunder Manifestations will only descend upon lands where powerful hatred dwells. The singers say that it is the unbearable disappointments and sufferings of life that drive them to forever wander the broken earth, unleashing sky-searing lightning as they go.",
      "Effect": null
    },
    "riftborn_regalia": {
      "Name": "Riftborn Regalia",
      "Description": "A broken horn that you obtained from defeating the Wolflord. That said, it should not have left anything behind after your hunt.\nEven a lord among the Riftwolves is nothing before monsters of a higher pedigree.\n\"Gold\" mass-produced these malformed wolf packs almost as if by accident, like shrunken drawings on discarded sheets of paper, and the horns on this one represent its authority to command its dark brood to dissolve space itself.",
      "Effect": null
    },
    "dragonheirs_false_fin": {
      "Name": "Dragonheir's False Fin",
      "Description": "A piece of biological tissue that you found after defeating the Bathysmal Vishaps.\nAlthough it looks like a fin of some kind, it does not actually have any function at all.\nThe people of Byakuyakoku once investigated the Bathysmal Vishaps quite deeply. Their most distinctive feature was the ability to choose what traits it wished to pass on to its offspring. Because of their great hatred for humanity, these vishaps will lose any visual acuity by the time they reach maturity.At the same time, they have evolved a certain degree of elemental polymorphism for combat purposes.",
      "Effect": null
    },
    "runic_fang": {
      "Name": "Runic Fang",
      "Description": "A “fang” with which the mysterious, snakelike machine of old dug into mountains’ depths. There are many ominous runes carved on it.\nIt is said that giant serpents lurk in the dark fissures deep beneath the ground. Burning with eternal resentment and malice toward the world above, they throw themselves into digging great tunnels, yet none know what their malicious purposes are…",
      "Effect": null
    },
    "majestic_hooked_beak": {
      "Name": "Majestic Hooked Beak",
      "Description": "An elongated bill that you found after defeating the Jadeplume Terrorshroom.\nResearchers still consider it a miracle even now that some soft Fungi have evolved these rock-hard hooked beaks. This magnificent king amongst Fungi has been leisurely pacing on the finish line of evolution. Now and then, it emits a long call to all the living beings in the rainforest: Even the most helpless and timid creature may one day become the monarch of the woods.",
      "Effect": null
    },
    "thunderclap_fruitcore": {
      "Name": "Thunderclap Fruitcore",
      "Description": "The core of an Electro Regisvine, wrapped in razor-sharp leaves, wantonly emits Electro energy.\nThe roaring energy rampaging deep within the earth is eager to pour out its rage, thus even tainting these unfortunate vines with its mania, causing them to wail and flail their branches frantically. One can hardly tell whether it longs for others to taste the pain of being continuosly electrocuted and charred or if it is struggling, looking forward to its inevitable doom.",
      "Effect": null
    },
    "perpetual_caliber": {
      "Name": "Perpetual Caliber",
      "Description": "A motive device obtained from a mysterious ruin machine.\nThe machine it once powered may have been destroyed, but it continues to rotate all the same.\nThere should be no such thing as an energy source that can sustain itself forever in this world, and most research results obtained in the field of \"perpetual motion\" have been eventually proved false. Yet, this device is proof that a now-destroyed civilization once reached heights that present-day nations could not hope to match...",
      "Effect": null
    },
    "light_guiding_tetrahedron": {
      "Name": "Light Guiding Tetrahedron",
      "Description": "A core component obtained via defeating a mysterious ruin machine.\nTo this day, these ancient devices have not forgotten the dreams of their masters or their own duties: to build a thousand palaces, to administrate three thousand machines, to sow ten thousand flowers that shall never bloom again, and to recreate a paradise now buried beneath the desert sands for the sake of all who live in this world.\nThough the lord of the desert no longer lives, and those dreams have long been corrupted by sinful whispers, and though all the magical pillars have been broken and have collapsed, the great beast once favored by the king hides still within the great searing storm.",
      "Effect": null
    },
    "quelled_creeper": {
      "Name": "Quelled Creeper",
      "Description": "The final coalesced form of the Dendro Hypostasis. The tough vines protect a pure cubic elemental crystal.\nDendro defies any common logic yet exists in perfect harmony with life. Elemental Hypostases, on the contrary, are most distant in appearance to all living beings. The combination of these two should probably never have appeared in this world. It is said that such elemental hypostases have the intelligence to \"learn\" and have thus understood the colors and dreams of the forest, a process that has transformed them into this shape over thousands of years.",
      "Effect": null
    },
    "pseudo_stamens": {
      "Name": "Pseudo-Stamens",
      "Description": "The pale wing-sheathes hiding in a Wenut's tail are as thin as the blooming stamens of a flower.\nIt is said that in the past, even before the beginning of time, they used to travel through the moist land under meadows and forests, similar to birds flying across the sky and fish swimming in the water. It is generally believed that their mimicry of flowers is to lure lost prey caught by sandstorms. There is also a theory, however, that their imitation of a blooming flower was inspired by the splendid blossoms countless epochs ago, which have long gone the way of the desert winds.",
      "Effect": null
    },
    "evergloom_ring": {
      "Name": "Evergloom Ring",
      "Description": "A mystical weapon obtained after defeating the Four-Armed Envoy of dark tidings.\nRings are shaped like passageways, which is why arcane formations that are meant to produce some mystical effect are often ring-shaped. Such rings are perhaps gateways intended to guide the universe itself.",
      "Effect": null
    },
    "artificed_spare_clockwork_component_coppelia": {
      "Name": "Ar­ti­ficed Spare Clock­work Com­po­nent — Cop­pe­li­a",
      "Description": "An artificed spare clockwork component belonging to Coppelia. It powers this artificed dancer.\nAccording to its creator's design, the story of the artificed dancer with delicate joints ends at a merry moment. Coppelia will send whoever attempts to disturb that moment to a chapter of misfortune with her superb combat skills.",
      "Effect": null
    },
    "artificed_spare_clockwork_component_coppelius": {
      "Name": "Ar­ti­ficed Spare Clock­work Com­po­nent — Cop­pe­li­us",
      "Description": "An artificed spare clockwork component belonging to Coppelius. It powers this artificed dancer.\nThe artificed dancer whirls to a platinum tune, performing an unending waltz of icewind. Coppelius's dance will not stop. He will continue whirling till the bell tolls.",
      "Effect": null
    },
    "emperors_resolution": {
      "Name": "Emperor's Resolution",
      "Description": "The war hammer of the Emperor of Fire and Iron. The mighty crab has crushed countless foes with this giant claw. Be it clockwork meka, other Fontemer Aberrants, or hunters with ill-placed curiosity — all have yielded under its power.\nFontemer Aberrants are different from human beings in that the concepts of aristocracy or inheritance are entirely foreign to them. None of them are born superior. One that survives deadly predators and adversities is able to accumulate infinite power as it keeps hunting and feeding over centuries. Such a creature is often referred to as an overlord for the fear it inspires.",
      "Effect": null
    },
    "fontemer_unihorn": {
      "Name": "Fontemer Unihorn",
      "Description": "The electricity-emitting section of the Millennial Pearl Seahorse, and its regalia, the symbol of its surpassing might — now snapped off amidst a clash against a mighty challenger.\nAs the greatest predator that can arise from seahorses, this being's evolutionary journey is not the same as that experienced by other Fontemer Aberrants. It did not start from a base form before growing larger and stronger, but instead grew limbs and a horn that have no place on an ordinary seahorse. Even its musculature and skeleton have changed. It really seems to resemble a fantastical beast from legends of yore more than its original shape. In the imaginations of poets and authors, even seahorses can frolick upon the earth.",
      "Effect": null
    },
    "tourbillon_device": {
      "Name": "\"Tourbillon Device\"",
      "Description": "The core component of the Experimental Field Generator.\nA precision-machined mechanical component that counteracts the effects of gravity via high-speed rotation. The revolution speed is so fast that it is almost impossible to capture with the naked eye.\nThroughout its long history, the Fontaine Research Institute of Kinetic Energy Engineering has always warred against a flood that once washed countless lives away, and may yet cover the earth and sky one day far in the future, searching for a means to survive.\nArkhium, with its immense energetic potential and power to shatter the shackles of the earth, was once considered the key to the gate of salvation.",
      "Effect": null
    },
    "water_that_failed_to_transcend": {
      "Name": "Water That Failed To Transcend",
      "Description": "The only remnants of Hydro Tulpas after their parts are dispersed.\nThis substance is very similar to the crystals extracted from the bodies of Fontemer Aberrants, but they contain a lot of tiny impurities, like the bubbles in glass crafted by clumsy craftsmen.",
      "Effect": null
    }
  },
  "LocalSpecialities": {
    "calla_lily": {
      "Name": "Calla Lily",
      "Description": "A flower that grows near water sources. When cooked, the petals have a chunky texture, yet are sweet and a little bitter.",
      "Effect": null
    },
    "cecilia": {
      "Name": "Cecilia",
      "Description": "A beautiful flower with a name that suits its appearance. It only grows where harsh winds blow, and is just as intangible as the true heart of an unbound soul.",
      "Effect": null
    },
    "dandelion_seed": {
      "Name": "Dandelion Seed",
      "Description": "A tiny seed that rides on the wind. Even without its feathered wings, it still holds the hope from afar within.",
      "Effect": null
    },
    "philanemo_mushroom": {
      "Name": "Philanemo Mushroom",
      "Description": "A fungus that grows in the warm caress of the wind. It is as everlasting as the wind, nourishing life.",
      "Effect": null
    },
    "small_lamp_grass": {
      "Name": "Small Lamp Grass",
      "Description": "A wild grass that emits light at night. Used in cooking to enhance other flavors.",
      "Effect": null
    },
    "valberry": {
      "Name": "Valberry",
      "Description": "A plump and translucent berry that has a fragrant smell and a sweet, refreshing taste. In the past, the storm watchers' only solace was the sweetness of this fruit and hope for the city's peace.",
      "Effect": null
    },
    "windwheel_aster": {
      "Name": "Windwheel Aster",
      "Description": "A plant that adores the wind. To the proud children of the wind, or the citizens of Mondstadt, the Windwheel Asters are \"the visible winds.\"",
      "Effect": null
    },
    "wolfhook": {
      "Name": "Wolfhook",
      "Description": "A berry with thorns that often gets attached to a wolf's pelt. When you look at it, you can almost hear the echoing cries of the wolves in the woods.",
      "Effect": null
    },
    "cor_lapis": {
      "Name": "Cor Lapis",
      "Description": "A precious crystal of condensed pure Geo element that usually grows along with other minerals. It's also commonly called \"Cor Petrae.\"",
      "Effect": null
    },
    "glaze_lily": {
      "Name": "Glaze Lily",
      "Description": "An extremely ancient flower that was said to be commonly seen in Liyue. It transforms the memories of the land into its fragrance during florescence.",
      "Effect": null
    },
    "jueyun_chili": {
      "Name": "Jueyun Chili",
      "Description": "A spicy plant native to Liyue. Merely smelling it makes one hot and thirsty.",
      "Effect": null
    },
    "noctilucous_jade": {
      "Name": "Noctilucous Jade",
      "Description": "A rare mineral that glimmers in the dark. It's said to be a mutated gemstone condensed from the flourishing elements of the world.",
      "Effect": null
    },
    "qingxin": {
      "Name": "Qingxin",
      "Description": "A translucent white flower that only grows on the highest stone peaks. It eschews the warmth and moisture of the plains to gaze out afar from the solitary mountaintops.",
      "Effect": null
    },
    "silk_flower": {
      "Name": "Silk Flower",
      "Description": "A crimson flower that blooms like the rainbow clouds in Liyue. It can be made into silky-smooth fabric.",
      "Effect": null
    },
    "starconch": {
      "Name": "Starconch",
      "Description": "Empty seashells brought ashore by the tides. Hold it close to your ear, and hear the longing calls of the sea.",
      "Effect": null
    },
    "violetgrass": {
      "Name": "Violetgrass",
      "Description": "A small flower with strong vitality. It was said its downward-blooming flower keeps its fragrance from dissipating.",
      "Effect": null
    },
    "amakumo_fruit": {
      "Name": "Amakumo Fruit",
      "Description": "The fruit of the Amakumo Grass, which grows on Seirai Island. You can hear it crackling with a tiny current if you hold it up to your ear.",
      "Effect": null
    },
    "crystal_marrow": {
      "Name": "Crystal Marrow",
      "Description": "A crystal that contains a sliver of Tatarigami power. Adding this material during smelting will greatly increase the strength and toughness of metals.",
      "Effect": null
    },
    "dendrobium": {
      "Name": "Dendrobium",
      "Description": "A vibrant plant that has also been named the \"lycoris\" by the poets. It was once thought extinct in the Inazuman archipelago, only to re-emerge now upon the battlefields. It is said that it blooms most enchantingly where much blood was spilled.",
      "Effect": null
    },
    "fluorescent_fungus": {
      "Name": "Fluorescent Fungus",
      "Description": "A mushroom that glows like a night-light. Some curious power lies hidden within it.",
      "Effect": null
    },
    "naku_weed": {
      "Name": "Naku Weed",
      "Description": "Even on windless days, this plant will tremble lightly amid the cries of thunder. The part of it that resembles petals are in fact extensions of the leaves meant to protect the fragile flower.",
      "Effect": null
    },
    "onikabuto": {
      "Name": "Onikabuto",
      "Description": "A strange beetle that inhabits areas rich with Electro energy. Its docile and sedentary temperament could not be more different from the fierce, demonic visage displayed on its armored shell.",
      "Effect": null
    },
    "sakura_bloom": {
      "Name": "Sakura Bloom",
      "Description": "Blossoms from the Sacred Sakura at the Grand Narukami Shrine, filled with a fondness for Inazuma.",
      "Effect": null
    },
    "sango_pearl": {
      "Name": "Sango Pearl",
      "Description": "A precious pearl that grows in the coral of Watatsumi. Gives off a cool sheen like that of a moonlight.",
      "Effect": null
    },
    "sea_ganoderma": {
      "Name": "Sea Ganoderma",
      "Description": "A plant species that only grows in certain regions and islands of the ocean. Though it looks like a fungus of some sort, it actually comes from a substance secreted by certain soft-bodied organisms.",
      "Effect": null
    },
    "henna_berry": {
      "Name": "Henna Berry",
      "Description": "A fruit that grows even in the most hostile of desert environments. Its vibrant crimson fruits are made even more lovely against a backdrop of yellow sand.",
      "Effect": null
    },
    "kalpalata_lotus": {
      "Name": "Kalpalata Lotus",
      "Description": "Flowers from vines that grow on cliff sides. It is called a lotus only because it has a similar appearance to one. Aside from that, it bears no other similar properties to the lotus.",
      "Effect": null
    },
    "nilotpala_lotus": {
      "Name": "Nilotpala Lotus",
      "Description": "Growing in the forest wetlands, these plays only bloom at night with flowers as bright as the moon.",
      "Effect": null
    },
    "padisarah": {
      "Name": "Padisarah",
      "Description": "A holy and noble plant. The conditions for growth in its environment are very demanding. The flower buds can be processed to make valuable spices.",
      "Effect": null
    },
    "rukkhashava_mushrooms": {
      "Name": "Rukkhashava Mushrooms",
      "Description": "A fungus that grows in layers upon layers, like a sea of clouds, and which mostly grows on trees deep in the rainforest. Therefore, they are considered by the people of Sumeru to be the holy crystallization of Rukkhadevata’s legacy.",
      "Effect": null
    },
    "sand_grease_pupa": {
      "Name": "Sand Grease Pupa",
      "Description": "You can only find such husks deep in the desert where the Quicksand Eels breed. The hardened shell is meant to protect the Quicksand Eels' larval bodies until they finally acclimate to the conditions of the dry desert.",
      "Effect": null
    },
    "scarab": {
      "Name": "Scarab",
      "Description": "A tenacious beetle that finds repose within the vast ocean of desert sand. The golden pattern on such beetles' shells hints at some deep relationship between them and the ancient ruins that dot the desert.",
      "Effect": null
    },
    "mourning_flower": {
      "Name": "Mourning Flower",
      "Description": "Crimson flowers that bloom on ancient battlefields. They can even flourish in the depths of the desert. Their drooping flowers seem to be in mourning for heroes long past.",
      "Effect": null
    },
    "trishiraite": {
      "Name": "Trishiraite",
      "Description": "A splendorous stone that can be found in the depths of desolate mountains, seemingly formed from congealed elemental energy.",
      "Effect": null
    },
    "beryl_conch": {
      "Name": "Beryl Conch",
      "Description": "A conch-like structure that gives off a faint glow. Despite the name, it is not a shell but something condensed from pure elemental energy.",
      "Effect": null
    },
    "lumidouce_bell": {
      "Name": "Lumidouce Bell",
      "Description": "A serene and tranquil violet flower. It has a light, soft, and lasting scent and is often used for making luxurious perfumes.",
      "Effect": null
    },
    "lumitoile": {
      "Name": "Lumitoile",
      "Description": "A soft-bodied animal that emits a gentle light. Often found climbing the walls of buildings near the water or underwater.",
      "Effect": null
    },
    "rainbow_rose": {
      "Name": "Rainbow Rose",
      "Description": "A delicate and tender pink flower. Despite their name, Rainbow Roses are essentially more akin to Lilies.",
      "Effect": null
    },
    "romaritime_flower": {
      "Name": "Romaritime Flower",
      "Description": "An ethereal and elegant blue flower. Its tender petals are elastic and water-absorbent, making it the ideal raw material for various daily necessities.",
      "Effect": null
    },
    "subdetection_unit": {
      "Name": "Subdetection Unit",
      "Description": "Detection units produced by Fontaine Research Institute using new models of artificed components. Its original purpose was monitoring all kinds of environmental data.",
      "Effect": null
    },
    "lakelight_lily": {
      "Name": "Lakelight Lily",
      "Description": "A clear and clean azure flower, it is born where Water Veins come together. It has a simple, cool, and elegant fragrance, pungent and refreshing yet gentle.",
      "Effect": null
    },
    "spring_of_the_first_dewdrop": {
      "Name": "Spring of the First Dewdrop",
      "Description": "A limpid drop of dew floating amidst the waters of Morte Region. It is different from other pure water bodies, as though it is a conglomeration of even more pure and primordial Elemental Energy.",
      "Effect": null
    }
  },
  "TalentMaterials": {
    "teachings_of_freedom": {
      "Name": "Teachings of Freedom",
      "Description": "Freedom is the spirit of the land of the wind.\nThe freedom to live is one of such. It is the freedom to live freely and healthily without concerns of one's own safety.",
      "Effect": null
    },
    "guide_to_freedom": {
      "Name": "Guide to Freedom",
      "Description": "Freedom is the spirit of the land of the wind.\nThe freedom of travel is one of such. It is the freedom to traverse the land freely without being obstructed.",
      "Effect": null
    },
    "philosophies_of_freedom": {
      "Name": "Philosophies of Freedom",
      "Description": "Freedom is the spirit of the land of the wind.\nTo sing is one such freedom. To sing on the land created by the Anemo Archon is to send your heart away with the song on the wind.",
      "Effect": null
    },
    "teachings_of_resistance": {
      "Name": "Teachings of Resistance",
      "Description": "Resistance is the backbone of the land of the wind.\nThe history of Mondstadt is one of resistances. People rose up to prevent past conflicts from ever being forgotten, like sprouts breaking through the soil, like the eternal wind eroding through stone walls.",
      "Effect": null
    },
    "guide_to_resistance": {
      "Name": "Guide to Resistance",
      "Description": "Resistance is the backbone of the city of Wind.\nThe history of Mondstadt is one of resistances. People rose up to grant the citizens of Mondstadt the freedom they now enjoy, like the Anemo Archon blowing away the snow, or like Vennessa rising up to fight.",
      "Effect": null
    },
    "philosophies_of_resistance": {
      "Name": "Philosophies of Resistance",
      "Description": "Resistance is the backbone of the land of the wind.\nThe history of Mondstadt is one of resistances. People rose up to allow the future Mondstadt's poetry to freely be that of the wind and be spread across the land.",
      "Effect": null
    },
    "teachings_of_ballad": {
      "Name": "Teachings of Ballad",
      "Description": "Poetry is the soul of the land of the wind.\nPoetry is the manifestations of beautiful feelings. On a beautiful day, the breezes carry with them poetry that touches the heart of people like the wind caressing the leaves.",
      "Effect": null
    },
    "guide_to_ballad": {
      "Name": "Guide to Ballad",
      "Description": "Poetry is the soul of the land of the wind.\nPoetry is the manifestations of the will to encourage. In the dark days, the gales in the streets and alleyways whisper words of fury, like the battle drums, like the low rumbling before the storm.",
      "Effect": null
    },
    "philosophies_of_ballad": {
      "Name": "Philosophies of Ballad",
      "Description": "Poetry is the soul of the land of the wind.\nPoetry is the manifestations of the desire to spread the word. Though nothing is eternal, though nothing will be the same, the wind's poetry will still spread beyond the skies, the land, the seas to every corner of the world.",
      "Effect": null
    },
    "teachings_of_prosperity": {
      "Name": "Teachings of Prosperity",
      "Description": "Prosperity is the people's pursuit in the land of Geo.\nProsperity is the blessing of Liyue, it is the foundation of the great city built by the gods and the people of Liyue, and it is the source of the peace and safety of the land.",
      "Effect": null
    },
    "guide_to_prosperity": {
      "Name": "Guide to Prosperity",
      "Description": "Prosperity is the people's pursuit in the land of Geo.\nProsperity is the promise made by Liyue to its children: To repay the hard-working laborers with enough gold to brighten up this land.",
      "Effect": null
    },
    "philosophies_of_prosperity": {
      "Name": "Philosophies of Prosperity",
      "Description": "Prosperity is the people's pursuit in the land of Geo.\nProsperity is Liyue's past, present, and future. This prosperity is unmatched and unobtainable by any other nations - it all belongs to Liyue and its inhabitants.",
      "Effect": null
    },
    "teachings_of_diligence": {
      "Name": "Teachings of Diligence",
      "Description": "Industriousness is the foundation of the land of Geo.\nDiligence is having the bravery and strength to conquer mountains and seas and to pursue gold and prosperity through honest, hard work.",
      "Effect": null
    },
    "guide_to_diligence": {
      "Name": "Guide to Diligence",
      "Description": "Industriousness is the foundation of the land of Geo.\nIndustriousness is the catalyst that flows in the blood of the people of Liyue, able to turn rocks into gold. It is what lies behind the greatness of its great commercial port.",
      "Effect": null
    },
    "philosophies_of_diligence": {
      "Name": "Philosophies of Diligence",
      "Description": "Industriousness is the foundation of the land of Geo.\nIndustriousness is believing in one's own ability to earn a place in the land of the gods through sweat, wisdom, and power.",
      "Effect": null
    },
    "teachings_of_gold": {
      "Name": "Teachings of Gold",
      "Description": "Gold is the symbol of the land of Geo.\nGold is the blood that flows deep within Liyue's veins, the muscle that makes up Liyue's beating heart, and the bones that make Liyue stand proud.",
      "Effect": null
    },
    "guide_to_gold": {
      "Name": "Guide to Gold",
      "Description": "Gold is the symbol of the land of Geo.\nGold symbolizes conversion. This is the unspoken understanding between Liyue's mountains, land, city, and people. In Liyue, industriousness is converted into gold, and gold into prosperity.",
      "Effect": null
    },
    "philosophies_of_gold": {
      "Name": "Philosophies of Gold",
      "Description": "Gold is the symbol of the land of Geo.\nGold is the wealth of Liyue, but Liyue's true wealth is the hearts of its people that shine like gold.",
      "Effect": null
    },
    "teachings_of_transience": {
      "Name": "Teachings of Transience",
      "Description": "Transience is the dream of the nation of thunder.\nFleeting glories are the highest expression of mortal beauty, for are we mortals not like the flashing lightning itself ? Like a lovely dream or blossoming spark, we shall leave a gorgeous mark on the eternal night sky.",
      "Effect": null
    },
    "guide_to_transience": {
      "Name": "Guide to Transience",
      "Description": "Transience is the dream of the nation of thunder.\nWe find the greatest joys in mortal life in transient dreams, for is life itself not like the shadow of the thunder ? Pursue your dreams into the clouds if you wish, and enjoy the unexpected silence of the dim lamp - lit nights.",
      "Effect": null
    },
    "philosophies_of_transience": {
      "Name": "Philosophies of Transience",
      "Description": "Transience is the dream of the nation of thunder.\nThe fleeting nature of this mortal world is the essence of beauty, for are our lives in this world not akin to the levin flash ? Yet the might of the divine comes suddenly, and before the roar of eternity, who can stand ? ",
      "Effect": null
    },
    "teachings_of_elegance": {
      "Name": "Teachings of Elegance",
      "Description": "Elegance is the form of the nation of thunder.\nElegance brooks no flattery, and the elegant are ever noble. They are like the sea eagles who soar on high to contend with the resounding storms. They will not cater to philistine vulgarity, as one would not cast a flower crown into the mud, staining its dignity.",
      "Effect": null
    },
    "guide_to_elegance": {
      "Name": "Guide to Elegance",
      "Description": "Elegance is the form of the nation of thunder.\nElegance shuns arrogance. The elegant are ever humble, and only by discarding vanity and sloth may one see clearly — and is there not beauty and loveliness even in the basest of appearances?",
      "Effect": null
    },
    "philosophies_of_elegance": {
      "Name": "Philosophies of Elegance",
      "Description": "Elegance is the form of the nation of thunder.\nElegance abhors vulgarity, and the elegant ever walk alone. Resisting base evils, unmoved by base loves, never taking refuge in base ignorance — that is how one perceives the chasm between the elegant and the contemptuous.",
      "Effect": null
    },
    "teachings_of_light": {
      "Name": "Teachings of Light",
      "Description": "Light is the yearning of the land of thunder.\nThe ruler who claims to have perceived all forever aims to hoard celestial glory. But this vision that cannot be shared only leads people to long for it more fiercely, like moths diving into the flame.",
      "Effect": null
    },
    "guide_to_light": {
      "Name": "Guide to Light",
      "Description": "Light is the yearning of the land of thunder.\nThough the sun rays themselves should be blocked by layers upon layers of clouds, there are still those in the thunder god's land who dream of piercing that wrathful sea of lightning to pursue the glory of the divine, fearing not that they shall be cruelly struck down.",
      "Effect": null
    },
    "philosophies_of_light": {
      "Name": "Philosophies of Light",
      "Description": "Light is the yearning of the land of thunder.\nThough they must live forever on the earth, humanity will always reach for the light. Mortals will pursue and surpass, and they will never stop.A sealed eternity may, perhaps, look magnificent, but its essence is death.",
      "Effect": null
    },
    "teachings_of_admonition": {
      "Name": "Teachings of Admonition",
      "Description": "Admonition is the branches of the nation of wisdom.\nAdmonition comes from a pure heart. Only sensible words of goodwill can express profound wisdom and free the sprout of knowledge from the shackles of arrogance.",
      "Effect": null
    },
    "guide_to_admonition": {
      "Name": "Guide to Admonition",
      "Description": "Admonition is the branches of the nation of wisdom.\nAdmonition is paired with wise thinking. Careful deliberation affords humble words a clarity that convinces the wise and enlightens the foolish. Such words allow wisdom to flow like an unobstructed river.",
      "Effect": null
    },
    "philosophies_of_admonition": {
      "Name": "Philosophies of Admonition",
      "Description": "Admonition is the branches of the nation of wisdom.\nAdmonition is completed by good deeds. What is done confers real meaning upon what is said. When one’s mind, words, and deeds are aligned, their nourishment shall guarantee the fruition of wisdom’s tree.",
      "Effect": null
    },
    "teachings_of_ingenuity": {
      "Name": "Teachings of Ingenuity",
      "Description": "Ingenuity is the leaf-veins of the nation of wisdom.\nIngenuity springs forth from benevolent consideration. They say that \"a poisonous tree bears no kind fruit.\" Similarly, ingenious nascent ideas are always born from determined and benign minds, for only they are worthy bearers of wisdom.",
      "Effect": null
    },
    "guide_to_ingenuity": {
      "Name": "Guide to Ingenuity",
      "Description": "Ingenuity is the leaf-veins of the nation of wisdom. Ingenuity sets words of integrity on the right path. One who thinks out of goodwill and in a clever and careful fashion never deviates from the path of boons. Yet one who thinks with contempt and malice shall taint their words with despicable colors.",
      "Effect": null
    },
    "philosophies_of_ingenuity": {
      "Name": "Philosophies of Ingenuity",
      "Description": "Ingenuity is the leaf-veins of the nation of wisdom.\nIngenuity is completed by harmonious conduct. What is done completes what is thought. Wisdom blooms where the mind, words, and practice converge.",
      "Effect": null
    },
    "teachings_of_praxis": {
      "Name": "Teachings of Praxis",
      "Description": "Praxes are the roots of the nation of wisdom.\nPraxes stem from an unwavering will. All wisdom is manifested through the unyielding pursuit of goodness. Where goodness is not practiced, ingenuity and eloquence wither.",
      "Effect": null
    },
    "guide_to_praxis": {
      "Name": "Guide to Praxis",
      "Description": "Praxes are the roots of the nation of wisdom.\nPraxes validate words of honesty. Though one speaks and acts out of goodwill, one has not yet obtained wisdom. Wisdom, born from action, is a signet pressed upon honest words.",
      "Effect": null
    },
    "philosophies_of_praxis": {
      "Name": "Philosophies of Praxis",
      "Description": "Praxes are the roots of the nation of wisdom.\nPraxes bring forth the fruit of wisdom. Practice grants itself meaning, and it is only by treading a path that unites action, speech, and thought that the wise may reach perfection.",
      "Effect": null
    },
    "teachings_of_equity": {
      "Name": "Teachings of Equity",
      "Description": "The shore of the Nation of Water is equity.\nEquity sets boundaries on rights. Without equity, the rights granted by law will be abused, and become a tool to damage our virtuous customs.",
      "Effect": null
    },
    "guide_to_equity": {
      "Name": "Guide to Equity",
      "Description": "The shore of the Nation of Water is equity.\nEquity is the foundation upon which Fontaine was founded. Equity forms the standard of the law. If law loses the essence of equity, it will become a chessboard played for profit.",
      "Effect": null
    },
    "philosophies_of_equity": {
      "Name": "Philosophies of Equity",
      "Description": "The shore of the Nation of Water is equity.\nEquity is the foundation upon which Fontaine was founded. Equity requires the continuous and steady support of morality and law, and morality and law constantly change based upon the invariant principle of equity.",
      "Effect": null
    },
    "teachings_of_justice": {
      "Name": "Teachings of Justice",
      "Description": "The sword of the Nation of Water is justice.\nThe law of Fontaine walks with the sword of justice in hand. Without the guidance of justice, all law is reduced to meaningless words, to be tampered with and slaughtered at a whim.",
      "Effect": null
    },
    "guide_to_justice": {
      "Name": "Guide to Justice",
      "Description": "The sword of the Nation of Water is justice.\nThe law of Fontaine walks with the sword of justice in hand. Justice must be blind, and those who wield the sword of justice must not be led astray by their own interests or affairs.",
      "Effect": null
    },
    "philosophies_of_justice": {
      "Name": "Philosophies of Justice",
      "Description": "The sword of the Nation of Water is justice.\nThe law of Fontaine walks with the sword of justice in hand. Justice means judgment and reconciliation, the blade of judgment arrests the actions of evil, while reconciliation maintains order.",
      "Effect": null
    },
    "teachings_of_order": {
      "Name": "Teachings of Order",
      "Description": "The shield of the Nation of Water is order.\nAll law in Fontaine ultimately serves to maintain a stable order. Without order, there is chaos, and there can be no fairness in chaos.",
      "Effect": null
    },
    "guide_to_order": {
      "Name": "Guide to Order",
      "Description": "The shield of the Nation of Water is order.\nAll law in Fontaine ultimately serves to maintain a stable order. Without the guarantee provided by order, justice will be reduced to unlimited violence, a weapon used by all against all.",
      "Effect": null
    },
    "philosophies_of_order": {
      "Name": "Philosophies of Order",
      "Description": "The shield of the Nation of Water is order.\nAll law in Fontaine ultimately serves to maintain a stable order. Equity and justice come from order, and serve order. Like the still, ripple-less surface of the waters of Fontaine, order is the cornerstone of Fontaine's existence.",
      "Effect": null
    }
  },
  "EventMaterials": {
    "crown_of_insight": {
      "Name": "Crown of Insight",
      "Description": "Once a medium for the storage and transfer of wisdom in ancient times. Now wisdom is found in ancient texts and in profound speech. Nevertheless, this Crown of Insight must still be able to impart some transcendent power and wisdom to its bearer.",
      "Effect": null
    }
  },
  "WeeklyBossMaterials": {
    "dvalins_plume": {
      "Name": "Dvalin's Plume",
      "Description": "A feather from the tail of the Dragon of the East.\nAs a dragon's feather it has experienced more than a thousand years' worth of winds. Its ambition to be free almost evokes light breezes to break it off its current shackles, but its previous owner's recognition of you has kept it in your hands.",
      "Effect": null
    },
    "dvalins_claw": {
      "Name": "Dvalin's Claw",
      "Description": "A claw from the Dragon of the East.\nAs it had once torn through the flesh of the shadow dragon Durin, it used to contain his vicious poison. However, thanks to your purification and healing, it is no longer toxic.",
      "Effect": null
    },
    "dvalins_sigh": {
      "Name": "Dvalin's Sigh",
      "Description": "A bit of power taken from the whirlwinds evoked by the Dragon of the East.\nBeautiful and transparent, both trade winds and tornadoes will work in its name. The winds moves as its companion, its voice, and its freedom. Its enemies are the thousands who stand against the wind.",
      "Effect": null
    },
    "tail_of_boreas": {
      "Name": "Tail of Boreas",
      "Description": "A handful of tail scales from the Great Wolf King of the North.\nEven without its physical body and beyond death, Andrius still possesses extraordinary powers. It took a form comprised of ice and wind to embrace a new challenge, but even such form could not house all of its power. The ice scales that fell during the battle still retain some of its spiritual energy.",
      "Effect": null
    },
    "ring_of_boreas": {
      "Name": "Ring of Boreas",
      "Description": "A bit of crystallized ice from the Great Wolf King of the North.\nThis land was once a realm of sub-zero blizzards and ice storms filled with razor-sharp ice shards, all at the command of Boreas. Though its powers may have diminished, flash-freezing the land is still a breeze.",
      "Effect": null
    },
    "spirit_locket_of_boreas": {
      "Name": "Spirit Locket of Boreas",
      "Description": "A bit of the Great Wolf King of the North's power drawn from its soul.\nThis land was once a realm of sub-zero blizzards and ice storms filled with razor-sharp ice shards, all at the command of Boreas. In its final moments, it finally realized the chilling north wind could only extinguish life, not nurture it; therefore, Boreas let its powers freely flow into the land to protect it and its inhabitants.",
      "Effect": null
    },
    "tusk_of_monoceros_caeli": {
      "Name": "Tusk of Monoceros Caeli",
      "Description": "The horn of a whale that you obtained from defeating Childe, who had unleashed the might of his Delusion.\nIt is said that the shape of one's constellation determines one's character. The image of a whale cruising across the celestial heights represents a solipsism that seeks to crush and devour all in its path. Embracing this aspect of himself, Childe gleefully summoned one such beast before throwing himself into battle against you.",
      "Effect": null
    },
    "shard_of_a_foul_legacy": {
      "Name": "Shard of a Foul Legacy",
      "Description": "The shard of a weapon that you obtained from defeating Childe, who had unleashed the might of his Delusion.\nIt is stained with a profound color that is not of this world, no doubt due to the land of endless darkness that the young boy saw with his own two eyes. Perhaps it has nothing to do with the power of a Delusion, but as they say, the weapon reflects its user...",
      "Effect": null
    },
    "shadow_of_the_warrior": {
      "Name": "Shadow of the Warrior",
      "Description": "A fragment of power that you obtained from defeating Childe, who had unleashed the might of his Delusion.\nIt is the product of a will to fight that has been honed over countless slaughters. If humans do indeed have destinies, then his must surely have been twisted by such deeds. Why else, then, would he always be at the heart of every conflict?",
      "Effect": null
    },
    "dragon_lords_crown": {
      "Name": "Dragon Lord's Crown",
      "Description": "Horns created from hardened jade crystallized over a thousand years are the natural crown of the dragon king.\nInfused with spirit and carved from bedrock, it was born from the mountain's heart to show the strength of the earth to the land amidst monoliths, and its long golden horns are the mark of its ancient strife with an ancient lord. For a time, this horn was shattered and lost its luster, but now it gleams cold and gold as it sits in your palm.",
      "Effect": null
    },
    "bloodjade_branch": {
      "Name": "Bloodjade Branch",
      "Description": "Nurtured by the might of the dragon king, these bone branches glitter with strange, unique colors.\nHatred coursed through the natural streams and kissed the cold moonlight, and from them were these crystalline branches born and grown... Even though they were severed in battle, these branches steeped in dragon blood rustle as if eternally ill - at - ease.",
      "Effect": null
    },
    "gilded_scale": {
      "Name": "Gilded Scale",
      "Description": "Scaled armor that grows naturally over mystical stone, tough and silent, and filled with the strength of the dragon king.\nAcross the years as countless generations returned to the mulch of the earth, gold and obsidian embedded themselves into flesh and blood forged from bedrock before spreading and turning into scales. Searing agony, wordless cries... perhaps they will all vanish when the grudges that spawned them, too, finally come to an end.",
      "Effect": null
    },
    "molten_moment": {
      "Name": "Molten Moment",
      "Description": "A certain deformed fragment containing great might. You obtained this from defeating Signora, who unleashed her original power.\n\"I had a long, long dream.\"\nI dreamed that you and I met again in the pure white world that we created.\"\n\"But I woke up at last, having long been consumed by the raging flames, while you had long returned to the earth along with that poisoned blood.\"\n\"But none of it matters anymore. I must continue forging ahead. I must incinerate everything behind me. I must believe in that pure, spotless, everlasting realm that he spoke of — that I saw in the 'delusion' he let me see, at the end of the horizon of Her Majesty's dreams.\"",
      "Effect": null
    },
    "hellfire_butterfly": {
      "Name": "Hellfire Butterfly",
      "Description": "A warped shard that houses great might. You obtained this from defeating Signora, who unleashed her original power.\nThe seal of ice was broken under duress, and as her former will surged forth from its pale white prison and she remembered her old name once more, the undying butterfly danced amidst burning flesh and blood. And she remembered her past, wandering the land, spreading the flame, burning away all evil — and she recalled the face of the person she could never meet again.",
      "Effect": null
    },
    "ashen_heart": {
      "Name": "Ashen Heart",
      "Description": "A deformed fragment that contains powerful emotions. You obtained this from defeating Signora, who unleashed her original power.\nEven tears cannot extinguish the flames. Molten-hot agony and rage rush through her veins, oozing from her tear ducts.\nThe First Fatuus found her just before her heart could be destroyed by the eternal blaze. He understood that only deeper hate and obsession could quench the fire that devoured her and make her his ally...",
      "Effect": null
    },
    "mudra_of_the_malefic_general": {
      "Name": "Mudra of the Malefic General",
      "Description": "A puppet joint obtained from the Plane of Euthymia. The gesture here symbolizes the concept that \"one sees and one does.\"\nEven now that \"she\" has become a calamitous deity, she can still utilize such transcendent gestures, her sword flashing forth as swiftly as her eyes may see.\nAnd yet, as the countless disasters ground on for far too long, the fierce general's shell had to embrace a new spring.",
      "Effect": null
    },
    "tears_of_the_calamitous_god": {
      "Name": "Tears of the Calamitous God",
      "Description": "A puppet joint obtained from the Plane of Euthymia. The gesture here is in the shape of the baleful Eye of Stormy Judgment.\nSince they are able to bring down curse and catastrophe alike with a mere gaze, it might seem natural to blame life's misfortunes on calamitous deities. However, if you think about it a little harder, if your will is strong enough, and if your convictions are firm enough...\nThe catastrophes go on for too long.Even a baleful gaze must wash itself with tears.",
      "Effect": null
    },
    "the_meaning_of_aeons": {
      "Name": "The Meaning of Aeons",
      "Description": "A small piece of headgear obtained once the dust settled in the Plane of Euthymia.\nOne thought may end all calamity, and there will always be thoughts that may transcend time.\nAmid all this, one wonders if Makoto's true meaning was successfully communicated or not.",
      "Effect": null
    },
    "puppet_strings": {
      "Name": "Puppet Strings",
      "Description": "Tubes that were inserted into the mechanical puppet's back. The colors that flow within them are sometimes dull, and at others, vibrant. The contrast is so great as to be fearful.\nThey provided power to the mechanical puppet, and at the same time served as its strings, controlling it and binding it.\nOnce the support of these tubes is lost, the puppet becomes as weak as a newborn infant, barely able to even move.",
      "Effect": null
    },
    "mirror_of_mushin": {
      "Name": "Mirror of Mushin",
      "Description": "The mirror that was set in Shouki no Kami's chest to separate him from the outside world. The mitsudomoe symbol is emblazoned on it as a deliberate show of status and might.\nThis symbol, however, is no show of obeisance to the master of lightning, but is instead a blade pointed at the existing powers that be in this world. Nor is the mirror a means to shut out the looks of judgment from onlooking people, but is rather a bulwark against this base and sullied world. Within this great temple shall punishment be meted out and ignorance be cleansed.\nDreams shall be overturned, desires shall be cut away, and karma shall be reset.",
      "Effect": null
    },
    "dakas_bell": {
      "Name": "Daka's Bell",
      "Description": "This ball joint, used to connect mechanical limbs together, is shaped almost like a bell. Though it may seem dainty, it can be used to carry an unimaginably large amount of energy.\nIf connected to one's arms, then one will lose all feeling in them.\nAnd all strength in one's legs will dissipate if such joints are connected to them.\nConnect this joint to one's skull...\nAh, hatred, pain, madness, pride — none of these will be washed away.\nMost fortunate.",
      "Effect": null
    },
    "worldspan_fern": {
      "Name": "Worldspan Fern",
      "Description": "A fern taken from the oasis within Apep's body.\nAt the dawn of time, the world belonged to the dragons. There, the ferns were the first to sprout in the lush verdant world of Apep's court.\nIn the ages after, these ferns would become trees, vines, roots, and leaves, blanketing the world with their touch. But Apep still remembers the first frond as it stretched freely toward the sky, making a sound so delicate as to go unheard.",
      "Effect": null
    },
    "primordial_greenbloom": {
      "Name": "Primordial Greenbloom",
      "Description": "A primordial flower procured from the oasis within Apep.\nWith the passing of eons, flowers grew in fragrance and volume, and they gained a collection of titles as numerous as the stars in the night sky.\nHowever, this first flower to bloom never bore any name. For the dragons of old, even if a rose lost its name, it would not lose its scent. Naming things is but how lesser, ephemeral beings understand the world. Life is not constrained by words, and will always grow and evolve.",
      "Effect": null
    },
    "everamber": {
      "Name": "Everamber",
      "Description": "A piece of amber taken from the oasis within Apep. Inside the amber, a small, long-extinct insect remains frozen in time.\nTo the tree, it was circumstance that led this little life to be wreathed within its amber. But for said life, this was fate.\nFollowing the heaven-sent disaster, wood, vines, roots, and all manner of flora withered and turned to dust. A great many life forms disappeared.\nBut in the stillness of amber, a nameless insect endures in this otherworldly oasis, reaching a future that no others of its kind could.",
      "Effect": null
    },
    "lightless_silk_string": {
      "Name": "Lightless Silk String",
      "Description": "A slender strand that somehow ended up entangled on your weapon while fighting the All-Devouring Narwhal.\nIn ancient Fontaine, some thought that Fortuna, which ruled the world, was woven from countless fibers, like the strings of a harp. Strings that resonate with the majestic music would bring happiness to all, while discord would destroy the fabric of the universe.",
      "Effect": null
    },
    "lightless_eye_of_the_maelstrom": {
      "Name": "Lightless Eye of the Maelstrom",
      "Description": "A strange \"substance\" obtained from fighting against the All-Devouring Narwhal. Its actual weight far exceeds what would be expected given its size.\nEverything gathers around heavy objects, just as gold attracts more than iron, or the ground more than in the breeze blowing above. Just as light cannot escape from the vortex of darkness, cause and effect is attached to fate, perhaps irreversibly so.",
      "Effect": null
    },
    "lightless_mass": {
      "Name": "Lightless Mass",
      "Description": "A fragment produced from the intense battle against the All-Devouring Narwhal.\nThe universe is a dark and cold place.\nBut look carefully. Inside are always faint glimmers of light, like pearls gleaming from within the sand, splinters of diamond sprinkled over asphalt, lights lancing through the fog on a misty night, and sparks that ignite the brightest blazes.",
      "Effect": null
    }
  },
  "WeaponAscensionMaterials": {
    "tile_of_decarabians_tower": {
      "Name": "Tile of Decarabian's Tower",
      "Description": "The place now known as Stormterror's Lair was once the capital city of Decarabian, the God of Storms. Since this dream of prosperity was created entirely by his divine might, the broken pieces left behind by the shattering of that dream still possess great power.",
      "Effect": null
    },
    "debris_of_decarabians_city": {
      "Name": "Debris of Decarabian's City",
      "Description": "Decarabian, the God of Storms, was content with the capital city he had raised, and accepted the worship of the people from atop his tower. But he knew not that the people did not bow to him out of respect or adoration.",
      "Effect": null
    },
    "fragment_of_decarabians_epic": {
      "Name": "Fragment of Decarabian's Epic",
      "Description": "Andrius once declared war upon Decarabian, but failed to even scratch the capital of the Lord of the Tower. If it were not for the song of freedom that shattered the city in an instant, Decarabian's dream would have gone on forever.",
      "Effect": null
    },
    "scattered_piece_of_decarabians_dream": {
      "Name": "Scattered Piece of Decarabian's Dream",
      "Description": "The people did not bow to Decarabian out of respect or adoration, but because the harsh winds had laid them low. This was the shattered dream and ambition of the Anemo Archon[Note 1] before the rise of Barbatos.\nHe tried so hard to make his dream come true, and so the fragments of that dream are still mighty.",
      "Effect": null
    },
    "boreal_wolfs_milk_tooth": {
      "Name": "Boreal Wolf's Milk Tooth",
      "Description": "Andrius' wolf pack is its blessed honor guard, and even the milk teeth of a wolf's cub possess great potential.\nIn the past, the gods had the responsibility to love all people. Andrius was therefore quite unusual in that he became leader of the wolves, while only welcoming abandoned babies and wanderers when it came to humans.",
      "Effect": null
    },
    "boreal_wolfs_cracked_tooth": {
      "Name": "Boreal Wolf's Cracked Tooth",
      "Description": "The life of a wolf is not without violence; broken bones or cracked teeth are nothing special.\nAndrius found humans to be a disappointment, but believed babies to be innocent. If both the wolf pack and the adopted children chose each other, then they become a Lupical, a fated family.",
      "Effect": null
    },
    "boreal_wolfs_broken_fang": {
      "Name": "Boreal Wolf's Broken Fang",
      "Description": "The wolf pack also understands that humans are not solitary creatures. The honorary broken tooth is a parting gift said to bring protection and luck.\nIn the legends of a far-off world, a female wolf once adopted two great humans. Their home was known as the Cave of Wolves, or Lupercal - that word meaning the same thing as Lupical does in this world.",
      "Effect": null
    },
    "boreal_wolfs_nostalgia": {
      "Name": "Boreal Wolf's Nostalgia",
      "Description": "The Wolf King, believing himself to despise humans, thought himself unable to envision a happy life for humanity, making him unworthy of becoming the Lord of the Winds of the world. Therefore, he chose to disappear. Yet, in truth, he gazes on the ones abandoned by the world ever so gently.",
      "Effect": null
    },
    "fetters_of_the_dandelion_gladiator": {
      "Name": "Fetters of the Dandelion Gladiator",
      "Description": "It's a human thing to exaggerate a hero's story, even to the point of elevating the fetters that once bound the hero to the level of an enemy of true freedom.\nAs a result, these fetters were granted extraordinary powers.",
      "Effect": null
    },
    "chains_of_the_dandelion_gladiator": {
      "Name": "Chains of the Dandelion Gladiator",
      "Description": "The chains that once bound the great hero Vennessa. In truth, all gladiators would have worn chains in that era, and Vennessa was but one of many.",
      "Effect": null
    },
    "shackles_of_the_dandelion_gladiator": {
      "Name": "Shackles of the Dandelion Gladiator",
      "Description": "Vennessa was not truly bound by her chains. If she had so wished, no ordinary physical constraints forged in Mondstadt could have held her, for the land there yielded no ore of exceptional quality, nor did it possess the divine flame of her ancestral home.\nShe was only bound by her responsibility to take care of her tribespeople.",
      "Effect": null
    },
    "dream_of_the_dandelion_gladiator": {
      "Name": "Dream of the Dandelion Gladiator",
      "Description": "Vennessa may have been freed from slavery, but she then found herself subject to many other, even greater forms of bondage. What began as a duty to her tribespeople extended to all of Mondstadt, then to the concept of freedom itself, and beyond a point even to the whole world.\nWhat she really hoped for, in truth, was that the world might grow stronger.",
      "Effect": null
    },
    "luminous_sands_from_guyun": {
      "Name": "Luminous Sands from Guyun",
      "Description": "The stone pillars that tower amid the Guyun Stone Forest were once the stone spears Morax used to defeat his enemies. Over time, the gods' substance has seeped into the pillars that pin them down, lending them divine power. The pillars sometimes shed fragments of hatred and curses.",
      "Effect": null
    },
    "lustrous_stone_from_guyun": {
      "Name": "Lustrous Stone from Guyun",
      "Description": "The learned know that Guyun Stone Forest is far more than simply a miraculous sight on the sea to behold: It is the cemetery of the former gods of Liyue. Hatred and filth have periodically risen up from it, but all have been subdued by a demon-conquering young man.",
      "Effect": null
    },
    "relic_from_guyun": {
      "Name": "Relic from Guyun",
      "Description": "The stone spear has a glimmering core formed by the power of the defeated gods. Their hatred is not directed at Morax, however, for they have lost themselves a long time ago and are incapable of holding personal grudges.",
      "Effect": null
    },
    "divine_body_from_guyun": {
      "Name": "Divine Body from Guyun",
      "Description": "That which lurks within and animates this relic are the divine remains of lamenting gods. They are unrealized ideals, designs for a prosperous humanity that could never be. They may now lie deep within stone and sea, but they will not go quietly into the night.",
      "Effect": null
    },
    "mist_veiled_lead_elixir": {
      "Name": "Mist Veiled Lead Elixir",
      "Description": "Jueyun Karst is the realm of the mighty and illuminated adepti. But other than the ability to control the elements of the world, Jueyun Karst is also home to three other untold secrets: Alchemy, Sigils, and Sub-Space Creation.",
      "Effect": null
    },
    "mist_veiled_mercury_elixir": {
      "Name": "Mist Veiled Mercury Elixir",
      "Description": "With Fulu (Sigils), the adepti can store their power in the form of symbols, and with Waijing (Sub-Space Creation) they can fashion a cosmic paradise with the power of their minds. The manufacture of elixirs, however, has always been shrouded in mystery, for certain death follows for any who swallow them.",
      "Effect": null
    },
    "mist_veiled_gold_elixir": {
      "Name": "Mist Veiled Gold Elixir",
      "Description": "Elixirs are in fact pills made from metal alloys. They were created by the adepti, and are able to grant weapons transcendent powers.\nHowever, they are rarely seen in the world due to the hubris of the practitioners of martial arts, who prized the ways of combat over the paths of the adepti.",
      "Effect": null
    },
    "mist_veiled_primo_elixir": {
      "Name": "Mist Veiled Primo Elixir",
      "Description": "An elixir of the highest quality. It embodies a state of intertwining order and chaos, and is said to mirror how the world was when it was first created. Of course, a certain someone knows that this was not the case.",
      "Effect": null
    },
    "grain_of_aerosiderite": {
      "Name": "Grain of Aerosiderite",
      "Description": "A black meteor once fell beyond Liyue's Sea of Clouds, said to have fallen to vanquish a monster. However, it was stained by powerful tainted blood, so this item no longer possesses the pure power of Rex Lapis.",
      "Effect": null
    },
    "piece_of_aerosiderite": {
      "Name": "Piece of Aerosiderite",
      "Description": "Rumors of sea monsters are commonplace in Liyue, since the other shore is an unknown region that lies outside of Teyvat.\nWithout the protection of The Seven, all that lies beyond is unknown chaos. Only power beyond the order of Teyvat is able to stain the power of Rex Lapis black.",
      "Effect": null
    },
    "bit_of_aerosiderite": {
      "Name": "Bit of Aerosiderite",
      "Description": "The coastal nations of Teyvat refer to the region beyond the protection of The Seven as the Dark Sea. It is said many defeated gods refused to live under the new order of The Seven, so they fled to remote islands and became evil gods. However, their powers came from the same source as Rex Lapis, separate from this all-devouring darkness.",
      "Effect": null
    },
    "chunk_of_aerosiderite": {
      "Name": "Chunk of Aerosiderite",
      "Description": "When Khaenri'ah was destroyed, a great sinner created endless monsters with dark, alien blood flowing through their veins. They rampaged across the land, destroying all in their paths. They were mutated lifeforms, and the mutations were caused by powers from beyond this world. The black serpentine dragon Durin that attacked Mondstadt was one such mutated being.",
      "Effect": null
    },
    "coral_branch_of_a_distant_sea": {
      "Name": "Coral Branch of a Distant Sea",
      "Description": "Watatsumi Island is the furthest from Narukami Island in the Inazuman island chain, and its name means \"the god of the oceans\" in the island's ancient tongue. Legend has it that when the great serpent first arose within the abyssal nation of ever-night, its fluorescent body was covered in myriad-colored coral.",
      "Effect": null
    },
    "jeweled_branch_of_a_distant_sea": {
      "Name": "Jeweled Branch of a Distant Sea",
      "Description": "This coral cannot be found anywhere in Teyvat, but was a gift that the great serpent obtained when it broke into the Dark Sea. For that abyssal snake, to be filled with coral was to be mighty, and its power would be shaved away as those corals were lost. In other words, those corals contain power far beyond the norm.",
      "Effect": null
    },
    "jade_branch_of_a_distant_sea": {
      "Name": "Jade Branch of a Distant Sea",
      "Description": "Fleeing into the Dark Sea, the god that had lost everything met the abandoned people who had nothing within the ocean depths. Thus it elected to remain and become their \"Orobashi no Mikoto,\" their \"Watatsumi Omikami.\"\nIt is said that the great snake god once broke off all the coral branches on its body to give light to the children who were curled up in the darkness. They also say that it used these coral branches to create a huge ladder to allow those children to once again reach the surface and see the light of day.",
      "Effect": null
    },
    "golden_branch_of_a_distant_sea": {
      "Name": "Golden Branch of a Distant Sea",
      "Description": "The meaning that lies behind the name \"Watatsumi\" is simply the unrequited hopes that the abandoned people who dwelt in the deep sea pinned upon the serpent god that led them.\nAnd it was also because the serpent god now had people who worshiped it that it stayed in the world it should have long fled, breaking off the coral branches that adorned its body, treading upon land where it should not have, and facing a foe it could never hope to match — till at last, its divine form was sundered along with the mountains, its ichor turned into plasma, and its will and power became a curse that could never be extinguished: Tatarigami.",
      "Effect": null
    },
    "narukamis_wisdom": {
      "Name": "Narukami's Wisdom",
      "Description": "In the past, the ancients would climb the peak now known as Mt. Yougou and bend wood that had been charred by lightning into a hook to offer as an effigy unto the thundering force that lit up the skies and shook the earth. This shape would eventually become the \"Electro Mitsudomoe\" symbol, symbolizing the favor, wisdom, and might of Electro, and also the people who represent these values.",
      "Effect": null
    },
    "narukamis_joy": {
      "Name": "Narukami's Joy",
      "Description": "Those who belong to the Shogunate Commissions are those who administer and exercise power. In the monster-filled tales of the ancient past, those who were deeply trusted by the Shogun would bear talismans with this hooked design on their person, and just as the word \"commission\" means to \"joyfully serve\" in the old tongue, those who received her favor would return it with love and loyalty. Yet, after a certain point in time, nothing would be as it was before.",
      "Effect": null
    },
    "narukamis_affection": {
      "Name": "Narukami's Affection",
      "Description": "All demons who wander in the wilderness or live amongst mortals will be attracted by the sight of the Almighty Narukami Ogosho, represented by the Electro Mitsudomoe. Though their lives may be longer than any creature, they will at last come to their end. If those with limited lifespans hanker after eternity, then they can only pray that \"Eternity\" remembers them. And she did indeed answer their prayers, remembering them all, friend and foe alike, in her heart. No matter whether it was the demon owls who resided amidst the fog and ripped through the skies, the bake-danuki who dared to trespass her imperial gardens, or that female oni, lovely as the moon and mighty in battle, yet who would eventually come to blows with her... Whether it was the tengu who soared on dark wings or the Kitsune Saiguu who once walked by her side, but who eventually disappeared forever...\nThese countless tales have come to rest within her heart, and someday, they will surely shine again in the eternal paradise of her dreams.",
      "Effect": null
    },
    "narukamis_valor": {
      "Name": "Narukami's Valor",
      "Description": "The treasure of the lord of thunder is her majesty, and that majesty is embodied in her valor and wrath. Her wrath comes from the love that persists in her heart, and her valor supports that anger. Thus, whomsoever should block the path towards eternity or lay a finger on Inazuma's people shall become her foe.\nThey say that there were four great spirits, three divine foxes, and two great swords — but that the symbol of Her Excellency, the Almighty Narukami Ogosho, could only be a single strike, unsurpassed and brilliant as a meteor.",
      "Effect": null
    },
    "mask_of_the_wicked_lieutenant": {
      "Name": "Mask of the Wicked Lieutenant",
      "Description": "Folktales tell that once upon a time, there lived an oni named Torachiyo. Torachiyo was a highly skilled warrior, such that it was once said the Torachiyo might dance amid a thousand blades, juunihitoe robes becoming shredded like falling violet petals, and yet not receive a single wound. Yet this oni would eventually betray the Shogun and revolt, becoming shorn of an arm and a horn in the battle before fleeing and slaying itself in a fit of furious madness.\nHearsay holds that the stubborn oni often hold fear and distress in their hearts. That they should fantasize about eternity yet fear the moment, and are apt to become swallowed by terror or anger is their just reward. This mask depicts Torachiyo, fangs bared.",
      "Effect": null
    },
    "mask_of_the_tigers_bite": {
      "Name": "Mask of the Tiger's Bite",
      "Description": "\"Sumirezome Sangetsu Kogetsukan\" depicts the fierce oni Torachiyo shattering the Shogun's naginata with a single bite, thus gaining the upper hand for a time. As such, masks that are based on him have finely crafted fangs.\nIn the denouement of this tale, the wounded oni fled into the forest, deathly afraid of showing himself even to the cold moonlight. The wind that whispers through the alleys and valleys can be said to resemble his quiet cries of agony, and so there is a poetic seasonal expression for this in Inazuma: \"Torachiyo's Wind.\"",
      "Effect": null
    },
    "mask_of_the_one_horned": {
      "Name": "Mask of the One-Horned",
      "Description": "In the lost songs of the oni nursemaids, Torachiyo was an elegant young man, strong of body and fair of face. He was once a beloved lieutenant of the Shogun, and he followed her into the dark abyssal realms to repel the defiled ones, winning renown for the oni, whose blood thinned with each passing day.\nNone now sing these songs, but the mask of a horned oni, even in a different form, still possesses power beyond the norm.",
      "Effect": null
    },
    "mask_of_the_kijin": {
      "Name": "Mask of the Kijin",
      "Description": "Chiyo, a warrior of the oni tribe with the Electro Mitsudomoe emblem emblazoned on her back, was once swallowed whole by a beast from beyond this world that had a tiger's body and a serpent's tail while holding back the forces of darkness. At last, she tore the creature's innards apart from within, breaking free.\nThis is the origin of the phrase \"Chiyo the Tiger-Bite,\" and would be changed over many years to \"Torachiyo.\"\nBut within the belly of the beast, she was stained by a deep sin and saw her comrades ripped to shreds by those blood-red teeth. Steeped in darkness as far as the eye could see, she would eventually draw her sword upon the Almighty Narukami Ogosho. Her sword-arm and one horn would be cloven, and she would flee from the city into the forest like a wounded beast. There, they say that she was taken for some unknown monster and slain by the tengu, or perhaps by the Shuumatsuban — or perhaps by a scion of the Iwakura Clan training deep in the mountains, for her features had been twisted by hatred and the agony of her wounds.Or perhaps she even met the oni - masked, sword - bearing doll near the corpse of the giant serpent, and there ended her life's journey.\nFew among those who fought against the abyss in those days were spared pitch - dark dreams.Those who slew monsters and then became them were hardly the minority.The border between worlds grows fragile, and corruption of this kind is perhaps not merely monodirectional.",
      "Effect": null
    },
    "copper_talisman_of_the_forest_dew": {
      "Name": "Copper Talisman of the Forest Dew",
      "Description": "Under the instructions of the First Sage, the ancestors of the forest people made these talismans using withered trees to commemorate the Lord of Verdure.\nThe talisman's shape was inspired by the forest dew. It symbolizes the permeation of wisdom into mortal minds.",
      "Effect": null
    },
    "iron_talisman_of_the_forest_dew": {
      "Name": "Iron Talisman of the Forest Dew",
      "Description": "Later, the Lord of Verdure taught people the mystery of the forging of black iron. The innocent mortals thus grasped the knowledge of using fire to forge blades.\nThe Lord of Verdure took pleasure in their knowledge — Lethal as fire and blades were to her, they made ordinary people powerful.",
      "Effect": null
    },
    "silver_talisman_of_the_forest_dew": {
      "Name": "Silver Talisman of the Forest Dew",
      "Description": "In the myriad lore of the forest, the one in the striped cape that resembled blazing flames was the Greater Lord of the Labyrinths and the Owner of the Moon-Mirrored Spring.\nWhen he bowed his head and struck up a friendship with the Lord of Verdure, the tokens of their friendship were the gems that glimmered like water and silver that gleamed like the moonlight.\nTo repay such a gesture, the Lord of Verdure promised to keep secrets for the Greater Lord of the Labyrinths and safeguard the intricate and beautiful dreams of the rainforest.\nNo one could have foretold that the magnificent mansion of secrets and dreams would later fade away amidst the shroud of the dark flame of oblivion, after which its ash returned to the soil and became nutrients for the virgin rainforests.",
      "Effect": null
    },
    "golden_talisman_of_the_forest_dew": {
      "Name": "Golden Talisman of the Forest Dew",
      "Description": "\"Mortals hold dear three things only: the spring water that embraces the moonlight, verdant life, and ageless youth...\"\nThe nature of \"wisdom\" is not domination over all minds or scheming to gain all the benefit. Instead, it is about empowering even ordinary beings to one day overcome their imposed constraints.\nThough the roar of the tiger is no longer heard in the forest and the resilient guardians would seclude themselves within the dreams of children... On the night when every secret golden seal is lifted and all dreams glow like amber in the moonlight, perhaps she and her beloved people will eventually win genuine freedom.",
      "Effect": null
    },
    "oasis_gardens_reminiscence": {
      "Name": "Oasis Garden's Reminiscence",
      "Description": "People used to say that the Lord of Flowers was the Lord of Joy and Happiness. Freshwater sprang from her sleeves, and thus was the oasis of blossoming flowers born in the desert. Flowers and grasses followed in her footsteps, and gleaming moonlight cleared the way for her.\nIn the bitter days when the sky turned its back on the ground, the Lord of Flowers extended her mercy to each and every one of the mortals, letting them regain their happiness and egos, allowing leisure and luxury to resume.",
      "Effect": null
    },
    "oasis_gardens_kindness": {
      "Name": "Oasis Garden's Kindness",
      "Description": "In the literature buried deep beneath the yellow sands, the Lord of Flowers was the Mistress of Dreams.\nShe bestowed dreams upon the exiled, the manic, and the foolish. In those dreams, they were presented with their dearest delights. Burdened by the brutality of reality, they were fascinated by the charm of the Lord of Flowers and captivated by her beauty and care.",
      "Effect": null
    },
    "oasis_gardens_mourning": {
      "Name": "Oasis Garden's Mourning",
      "Description": "The Lord of Flowers was in an amicable relationship with the Jinn.\nThe Mistress of Flowers and Oases joined hands with the Lord of Deserts and built Ay-Khanoum, the \"City of Amphitheaters,\" which carried the meaning of \"City of the Moon Maiden\" in the ancient language of the Jinn.\nLater, however, it was said that the Lord of Flowers died due to the malice of the burning sun and yellow sand, after which the blossoms of purple Padisarahs were never seen again in the oases.\nAfter the departure of the Lord of Flowers, the sandstorms keened, the Jinn sobbed, and the moonlight-silver gem disc lost its original, glad purpose, giving off a mournful glimmer.",
      "Effect": null
    },
    "oasis_gardens_truth": {
      "Name": "Oasis Garden's Truth",
      "Description": "\"Who would worship a departed god?\"\nThe Lord of Flowers was once in alliance with two other gods. Apart from wisdom and power, she also brought mercy and joy to her people.\nJust as the earth needs more than the burning sunshine and pouring rain, to the people of the Lord of Flowers, joy and love, singing and music, and wine and extravagance were just as vital as strength and sensibility.\nIt is said that flowers blossom so that they may enjoy a spectacular death, and that death was precisely the wholehearted pursuit of the Lord of Flowers — for death adds bitterness to lost joy, and intensifies with time across endless memories.\nThe ignorant Lord of Deserts was never aware of her reasoning. He only reveled in her immense charm and grace — and as misguided as such fervent affections might be, they were well within the calculations of the Lord of Flowers.",
      "Effect": null
    },
    "echo_of_scorching_might": {
      "Name": "Echo of Scorching Might",
      "Description": "A long time ago, the people of the Lord of Deserts carved these imperial insignias based on robust beetles to memorialize the bright sun that marked the shifting of day and night, as well as the infinity of such times.\nThough the name of that Lord is no longer mentioned, these imperial insignias have been preserved through time, each bearing a faint ambiance of those past glories.\nThese insignias travel with the descendants of the Eremite Tribe, silently telling the tales of their then-Lord.",
      "Effect": null
    },
    "remnant_glow_of_scorching_might": {
      "Name": "Remnant Glow of Scorching Might",
      "Description": "To weave together myriad thoughts and reign over countless souls — this is the essence of power.\nHowever, power is not cold-blooded tyranny. Its true ideal, at its heart, is to create a utopia free of worry, schemes, and slavery.\nIt was just as the silent lord saw in the crystal's secrets, and just as the lost companion had once taught.\nThe dark insect insignia and the steel judgment thus laid the foundations of the kingdom's rules.",
      "Effect": null
    },
    "dream_of_scorching_might": {
      "Name": "Dream of Scorching Might",
      "Description": "Silver moonlight and clear springs once completed the scenery of the oases. But as the Lord of Flowers faded in the darkening sandstorm, so was the worriless golden paradise submerged by death.\nIn the poetry of the Eremite Tribe, the moon cast its silver light on the crimson mantle, causing Al-Ahmar, the Mourning King, to be driven to madness.\nIn a melancholic desert ballad, driven by the haunting nostalgia, the lonely king created an ever-youthful dreamland in the center of the desert, where undisturbed water sprang up and perpetual dusk remained.",
      "Effect": null
    },
    "olden_days_of_scorching_might": {
      "Name": "Olden Days of Scorching Might",
      "Description": "In the era when the ignorant Lord of Deserts ruled, his power descended upon every inch of the land like the scorching sun.\nAncient stone tablets record that he turned his power into seven rays of blinding light or seven pillars, which he granted equally and mercifully to everyone. No one was neglected, nor was anyone discontented.\nThat was a forgotten golden era, an era when the Lord of Flowers had faded into the sands and the Lord of Verdure was determined to leave. Only the descendants in the yellow sand chose to follow their god. Even as the grim shadow of calamity loomed, the power in which they had faith shone brightly like amber and gold.\nYet calamity befell nonetheless, and the golden insectoid insignias were buried beneath the depths of shrine and palace, under collapsed pillars engraved with images of eagles and bulls.",
      "Effect": null
    },
    "fragment_of_an_ancient_chord": {
      "Name": "Fragment of an Ancient Chord",
      "Description": "A harp with rotten keys. Its voice blocked, it cannot be played nor its sound heard.\nIt is said the descendants of the forgotten music once lacquered mechanical wooden harps with gold in order to revive the magnificent remnants of the ancient dynasty, futilely attempting to match them to the silent golems...A long time passed, and then more, and the rotten, off-key harps remained in the grasp of those silent giants, caressed by the waves, playing only sorrowful strains.",
      "Effect": null
    },
    "chapter_of_an_ancient_chord": {
      "Name": "Chapter of an Ancient Chord",
      "Description": "Legends say that the survivors of that ancient dynasty once cast a harp out of black iron to commemorate and mourn.\nA harp cast of black iron cannot be played. To mourn that ancient dynasty that was once so proud of its golden music, those remaining forged this heavy instrument and its yet weightier silence.But no matter what, the black iron harp remained as silent as that lost era.",
      "Effect": null
    },
    "movement_of_an_ancient_chord": {
      "Name": "Movement of an Ancient Chord",
      "Description": "In that great disaster, the golden palace sank with its throne, the music was shattered, the notes turned to silence...\nBut the remnants of that empire never gave up their desire for salvation and to surpass fate.\nTo save their waning civilization and their desire to transcend, the Golden Troupe played melodies most wondrous, enticing children to offer their precious souls to the sleeping golems.",
      "Effect": null
    },
    "echo_of_an_ancient_chord": {
      "Name": "Echo of an Ancient Chord",
      "Description": "The God King's Grand Symphony is composed of countless melodies linked together, but its main thesis is submerged under the common destiny of the Water Nation.\nThe harmonies of those carefree years and sonatas were once the greatest representation of civilization and order, but when the prosperous empire descended into a playground for tyrants, the brutal despots tore the connection with the source asunder under the cover of golden cloaks, and discord finally swarmed through the empire—The original song of fate continued to ring out on a score of fading gold, unperturbed by all... until all was dissolved, and all returned to chaos.",
      "Effect": null
    },
    "dross_of_pure_sacred_dewdrop": {
      "Name": "Dross of Pure Sacred Dewdrop",
      "Description": "Legends say that before the birth of life, there was a dense primordial sea. It is the purest origin of all things, and one day, it will also swallow all life... and those things which did not arise from it will be filtered out, becoming naught but floating detritus.\n\"The existence of detritus also has meaning — What kind of thing would be rejected by the source of all things that swallows all life?\" the [sic] young Harmost asked the great usurper, pondering this conundrum.",
      "Effect": null
    },
    "sublimation_of_pure_sacred_dewdrop": {
      "Name": "Sublimation of Pure Sacred Dewdrop",
      "Description": "\"Life that came from the primordial sea is inevitably fated to return to it.\" Thus spoke the Harmost Boethius. \"But there are infinite possibilities for humans to transcend, and even the waters of the primordial sea cannot completely dissolve them...\"\nThe arrogant usurper once attempted to mix insoluble Ichor with pure water, to contain wisdom and memories, allowing his subjects and servants to discard their physical bodies, and obtain independent, eternal lives.\nBut the pain of severing soul and body cannot be endured by any ordinary life, and the usurper's order tore apart and shattered souls...\nThe Ichor was dyed black by the crying and howling of so many souls, and it lost its harmony and wisdom, leaving only chaos and madness.",
      "Effect": null
    },
    "spring_of_pure_sacred_dewdrop": {
      "Name": "Spring of Pure Sacred Dewdrop",
      "Description": "This is a relic from a time when the Lochknights still roamed — the knights said, there were still loyal spirits in the mountain springs and valleys where none tread, guarding those pure, unpolluted springs...\nHowever, the creator of artificial Ichor couldn't tolerate any discord in his great symphony. It is said that wherever the Harmost Boethius went, the natural nectar was buried, the aqueducts of the empire were built, and the spirits born of pure water vanished without a trace...",
      "Effect": null
    },
    "essence_of_pure_sacred_dewdrop": {
      "Name": "Essence of Pure Sacred Dewdrop",
      "Description": "A dense and pure solution, derived and refined from drops of the vast primordial sea. The ancient God King once believed it would bring eternal life and infinite wisdom, but listening carefully— it was quietly, faintly prophesizing the final end of all dissolving into one.\nThis was once the God King's unfinished Grand Symphony — a boundless, sourceless golden Ichor replacing the wild primeval waters, and the glorious immortal sages bringing nectar-like enlightenment to the ignorant corners of the world.\nBut the God King's delusions ultimately sank into the depths of the black abyss, and with the ravages of time, the golden Ichor was eventually corroded by the primordial soup...\nThe tuner turned a blind eye to the evil omens, and supporting his broken body, continued to give life to his compatriots according to the plans once laid, so that the old order might one day return...\nEven today, many mad poets and painters of Fontaine see the apocalypse experienced by Boethius, a reminder of the inescapable cycle of the world.",
      "Effect": null
    },
    "broken_goblet_of_the_pristine_sea": {
      "Name": "Broken Goblet of the Pristine Sea",
      "Description": "Legend says that when the first usurper came to the primordial sea, the first sovereign gave him a goblet of water.\nLater, he became the unquestioned god-king, and used this goblet of water to refine the mysterious drops of dew, establishing a splendid and powerful empire.\nBut that is now an ancient story, whose main characters now sleep in the phosphorescence of the schools of the deepwater fish.",
      "Effect": null
    },
    "wine_goblet_of_the_pristine_sea": {
      "Name": "Wine Goblet of the Pristine Sea",
      "Description": "What kind of empire can last for a thousand years? After returning from the kingdom of dragons, the usurper once pondered this question.\nCombining the immortal stone with the Ichor essence extracted from primordial water, and carved into a race as black as iron— with arcane lithos for skin and Ichor for blood, never again fearing the curse of returning to the primeval past...\nThe silent golem still dreams the dream of the empire — not knowing it has been over a thousand years since the empire's obliteration.",
      "Effect": null
    },
    "silver_goblet_of_the_pristine_sea": {
      "Name": "Silver Goblet of the Pristine Sea",
      "Description": "In the years when the golden shroud covered the land, pure spring water had to be hidden away in concealed mountain streams, and the Lochknights were born in these sanctuaries.\nThe knights swear by armor of silver, to protect the spirits born from pure water, to protect their fellows who also keep faith in the one true font, resisting the omnipresent golden power that blotted out the sky and outshone the sun.\nBut that is an ancient legend... Not long after the empire collapsed and sank, the knights who resisted the usurper shed their armor, and their stories were hidden in a tangled web of stories and ballads.",
      "Effect": null
    },
    "golden_goblet_of_the_pristine_sea": {
      "Name": "Golden Goblet of the Pristine Sea",
      "Description": "When the Usurper of the sunken city played the last movement of the golden symphony, the favored musician stole the golden goblet brimming with Ichor.\nShocked by the foolhardy betrayal of the God King, the musician summoned the last guards, and used the insoluble Ichor to seal the dragon beneath the tall tower, and sank into the abyss with the capital.\nAfterwards, this noble thief vanished silently from history, and only the \"Golden Troupe\" faithfully remembers his prophecy.",
      "Effect": null
    }
  },
  "EliteEnemyMaterials": {
    "heavy_horn": {
      "Name": "Heavy Horn",
      "Description": "A crude horn used by hilichurls to warn each other. Given the damage to the horn, it won't be warning anyone any time soon.",
      "Effect": null
    },
    "black_bronze_horn": {
      "Name": "Black Bronze Horn",
      "Description": "A metallic monster horn that can only be obtained from especially strong hilichurls, since blowing on the horn takes real strength.",
      "Effect": null
    },
    "black_crystal_horn": {
      "Name": "Black Crystal Horn",
      "Description": "A metallic horn with an ominous shine decorated with black crystals of an unknown source. It has hardly been used at all. It is likely a ceremonial item of the hilichurls'.",
      "Effect": null
    },
    "dead_ley_line_branch": {
      "Name": "Dead Ley Line Branch",
      "Description": "Fragile branches from deep within the earth. Even after years of age, from beneath it's mottled surface you can see that its power is not yet entirely lost.",
      "Effect": null
    },
    "dead_ley_line_leaves": {
      "Name": "Dead Ley Line Leaves",
      "Description": "A twig from deep within the earth. Though it is far from where it once lay, its leaves still pulsate with energy.",
      "Effect": null
    },
    "ley_line_sprout": {
      "Name": "Ley Line Sprout",
      "Description": "It is said that there was a great tree whose roots once spread out to every corner of the world, and this branch is said to be part of it. It is almost if it was never broken off and taken far away, for its vitality is such that it still sprouts new leaves even now.",
      "Effect": null
    },
    "chaos_device": {
      "Name": "Chaos Device",
      "Description": "Comes from ancient defunct relic structures. A part that once held the structure together. Its aesthetically-pleasing engineering is quite exquisite.",
      "Effect": null
    },
    "chaos_circuit": {
      "Name": "Chaos Circuit",
      "Description": "Comes from ancient defunct relic structures. Was once a logic circuit responsible for movement functions. Sadly, no one is able to make sense of how it worked.",
      "Effect": null
    },
    "chaos_core": {
      "Name": "Chaos Core",
      "Description": "Comes from ancient defunct relic structures. The core that once drove a mechanical beast. Should you come to understand its workings and reproduce it, you could perhaps change the world.",
      "Effect": null
    },
    "mist_grass_pollen": {
      "Name": "Mist Grass Pollen",
      "Description": "Strange spores created by Mist Grass in enclosed spaces. They are the Cicins' favorite food.",
      "Effect": null
    },
    "mist_grass": {
      "Name": "Mist Grass",
      "Description": "Well-preserved Mist Grass. Some would take advantage of the Cicins' love for the Mist Grass to control them.",
      "Effect": null
    },
    "mist_grass_wick": {
      "Name": "Mist Grass Wick",
      "Description": "A rare bundle of Mist Grass that gives off a faint glow. Those who carry it invite both the Cicins and misfortune.",
      "Effect": null
    },
    "hunters_sacrificial_knife": {
      "Name": "Hunter's Sacrificial Knife",
      "Description": "A sharp alloy weapon. Though its owner has been lost, it still reflects a disturbingly cold light.",
      "Effect": null
    },
    "agents_sacrificial_knife": {
      "Name": "Agent's Sacrificial Knife",
      "Description": "An oddly-shaped weapon made with superior Snezhnayan technology that once belonged to a senior agent. Proper training is required for using this strange weapon.",
      "Effect": null
    },
    "inspectors_sacrificial_knife": {
      "Name": "Inspector's Sacrificial Knife",
      "Description": "In the hands of its lord, this fierce weapon has handled many \"debts.\" No one has eyes in the back of their heads, and this weapon and its related techniques are designed around that weakness.",
      "Effect": null
    },
    "fragile_bone_shard": {
      "Name": "Fragile Bone Shard",
      "Description": "A bone shard once carried by a Geovishap Hatchling. Although they are quite fragile, they seem to still harbor some indescribable power.",
      "Effect": null
    },
    "sturdy_bone_shard": {
      "Name": "Sturdy Bone Shard",
      "Description": "A fragment of an unknown creature's bones that appear to be prized by Geovishap Hatchlings for some reason.\nThe fragment appears to be quite aged. Despite being dragon-like beasts with no spoken language, they still seem to have some sort of special affection for these bone shards.",
      "Effect": null
    },
    "fossilized_bone_shard": {
      "Name": "Fossilized Bone Shard",
      "Description": "A fossilized bone fragment sometimes found after defeating Geovishap Hatchlings.\nGeovishap Hatchlings all dream of growing into great dragons one day. They see these fossils as dragon bones and greatly cherish them, perhaps because they too hope to attain the dragons' longevity and power.",
      "Effect": null
    },
    "chaos_gear": {
      "Name": "Chaos Gear",
      "Description": "Comes from a now-inactive ancient Ruin machine. This is the energy source of that biomimetic mechanism.",
      "Effect": null
    },
    "chaos_axis": {
      "Name": "Chaos Axis",
      "Description": "Comes from a now-inactive ancient Ruin machine.\nEven the great techniques and unknown power of this device must come to nothing should the machine that contained them ever fail to maintain structural integrity.",
      "Effect": null
    },
    "chaos_oculus": {
      "Name": "Chaos Oculus",
      "Description": "Comes from a now-inactive ancient Ruin machine.\nThe \"Ruin\" part of the name comes from the areas where they are most active. However, Ruin machines actually have little in common with the detritus in which they are often found.\nIn the ancient past, these ruins were once part of a civilization mighty enough to almost touch the dome of the firmament, while \"ruin\" still waits in the deep places of the earth, awaiting the order to arise and tread all kingdoms underfoot.",
      "Effect": null
    },
    "dismal_prism": {
      "Name": "Dismal Prism",
      "Description": "This was once a prism that could polarize light, but has grown dull through the passing of years.",
      "Effect": null
    },
    "crystal_prism": {
      "Name": "Crystal Prism",
      "Description": "A prism that can bend light. Illusory images can be made using such prisms, giving such devices — in a manner of speaking — the power to sway human hearts.",
      "Effect": null
    },
    "polarizing_prism": {
      "Name": "Polarizing Prism",
      "Description": "A prism that can bend light. In the darkness, these prisms can spread thin light into a wider area. Perhaps this is due to this quirk that these prisms can grant a measure of peace to those whose hearts are oft shrouded in darkness.",
      "Effect": null
    },
    "concealed_claw": {
      "Name": "Concealed Claw",
      "Description": "Residual body tissue left behind by one of the Riftwolves.\nBy ordinary logic, these objects, so alien to this world, should not have remained behind after these abnormal creatures were excised from the land.",
      "Effect": null
    },
    "concealed_unguis": {
      "Name": "Concealed Unguis",
      "Description": "Body tissue left behind by one of the Riftwolves.\nThough they are quite wondrous indeed, these hunting hounds of \"Alfisol\" are nothing of note before Durin of \"Humus.\"",
      "Effect": null
    },
    "concealed_talon": {
      "Name": "Concealed Talon",
      "Description": "A sharp nail left behind by one of the Riftwolves.\nAll the marvels in the world must pale before \"Cretaceus,\" the greatest work of them all.",
      "Effect": null
    },
    "gloomy_statuette": {
      "Name": "Gloomy Statuette",
      "Description": "An idol made in the likeness of some unknown person.\nEven though this carving has seen many years pass, it still has not been damaged in any way. It seems that its previous owner must have cherished it like some holy icon.",
      "Effect": null
    },
    "dark_statuette": {
      "Name": "Dark Statuette",
      "Description": "An idol made in the likeness of some unknown, one-eyed person.\nYou can feel a strange warmth emanating from within as you hold onto it, like the shoulder of a dear friend. Perhaps this icon can indeed give people who understand its significance the courage to carry on.",
      "Effect": null
    },
    "deathly_statuette": {
      "Name": "Deathly Statuette",
      "Description": "A one-eyed carving that emanates an ominous energy, with no indication of what it's made of.\nAs you gaze upon this idol, you can almost hear a strange, comforting whisper...\n\"See, my child. All that lies under the throne of heaven shall be destroyed by upheaval. The eternal peace of the pitch-dark void shall embrace us all.\"",
      "Effect": null
    },
    "chaos_storage": {
      "Name": "Chaos Storage",
      "Description": "Comes from a now-inactive ancient Ruin Drake.\nRuin Drakes can absorb Elemental Energy from the outside and store it in this component inside their \"neck.\"",
      "Effect": null
    },
    "chaos_module": {
      "Name": "Chaos Module",
      "Description": "Comes from a now-inactive ancient Ruin Drake.\nThe dragons were once the most primitive and ancient bodily form of the supreme elements until they were defeated, conquered, or assimilated.",
      "Effect": null
    },
    "chaos_bolt": {
      "Name": "Chaos Bolt",
      "Description": "Comes from a now-inactive ancient Ruin Drake.\nAmong the lost ancient kingdoms, there was a group of people who were obsessed with the idea of mimesis. Be it the Hypostases' pure ordered elements or the ancient primitive power of the dragons, these people believed that they might all be replicated and modified to the point where they had surpassed their natural counterparts.\nBy this means, a superior and unsullied bodily form could replace the continuously decaying and shattering order.",
      "Effect": null
    },
    "inactivated_fungal_nucleus": {
      "Name": "Inactivated Fungal Nucleus",
      "Description": "Body tissue left behind by a Fungus that has been exposed to intense elemental stimulation.\nIts soothing texture makes it shockingly good for stress relief. However, frequent usage can also easily lead to the Fungi multiplying, and thus the material is not suitable for any commercial use.",
      "Effect": null
    },
    "dormant_fungal_nucleus": {
      "Name": "Dormant Fungal Nucleus",
      "Description": "Body tissue left behind by a Fungus that has been exposed to intense elemental stimulation.\nThere was once a protracted debate among Amurta researchers on whether the Fungi should be categorized as plants or animals. In the end, they reached an agreement and closed the case for good — the Fungi shall be its own category, neither plant nor animal.",
      "Effect": null
    },
    "robust_fungal_nucleus": {
      "Name": "Robust Fungal Nucleus",
      "Description": "Body tissue left behind by a Fungus that has been exposed to intense elemental stimulation.\nIt is generally believed that the Fungi evolved into more mobile forms to better disperse their spores.\nA poet once depicted a shared dream of the Fungi in which their spores covered every inch of the mountains and oceans. The world had never been more tranquil. Then the Fungi turned into fish, birds, beasts, men, and gods, relying on rainfall, land, and their own kind who had returned to the earth.",
      "Effect": null
    },
    "a_flower_yet_to_bloom": {
      "Name": "A Flower Yet to Bloom",
      "Description": "A wild flower that a Hilichurl Rogue treasured. It was plucked before it could bloom.\nThe hilichurl takes nothing with it in its sojourn across the wilderness save this flower.",
      "Effect": null
    },
    "treasured_flower": {
      "Name": "Treasured Flower",
      "Description": "A wild flower that a Hilichurl Rogue treasured, bereft of any special qualities.\nFlowers can be used as gifts or offerings to express one's feelings in many cultures.",
      "Effect": null
    },
    "wanderers_blooming_flower": {
      "Name": "Wanderer's Blooming Flower",
      "Description": "A blooming wild flower that a Hilichurl Rogue treasured, bereft of any special qualities.\nThe eternal outlander asks not for reward, but only to see their deeds come to fruition...",
      "Effect": null
    },
    "rift_core": {
      "Name": "Rift Core",
      "Description": "A shard left by Breacher Primus.\nIt bears no resemblance to any other known form of life in the world.",
      "Effect": null
    },
    "foreign_synapse": {
      "Name": "Foreign Synapse",
      "Description": "A shard left by Breacher Primus.\nThis strange life form originates in Elynas and inhabits the area.",
      "Effect": null
    },
    "alien_life_core": {
      "Name": "Alien Life Core",
      "Description": "Breacher Primus's Core.\nTher is no way to exterminate this life form. One reduced to nothing but its core will resurrect the next day or in decades. Luckily, it is neither aggressive nor intelligent, so Fontainians can just keep their distance.",
      "Effect": null
    },
    "drop_of_tainted_water": {
      "Name": "Drop of Tainted Water",
      "Description": "A small drop of water obtained from a defeated Tainted Hydro Phantasm.\nThe life force in it has yet to ebb away.",
      "Effect": null
    },
    "scoop_of_tainted_water": {
      "Name": "Scoop of Tainted Water",
      "Description": "Water obtained from a defeated Tainted Hydro Phantasm.\nThe life force in it has yet to ebb away.\nToday, with the Oceanids extirpated from Fontaine, strange elemental life forms that are far from elegant have appeared in the waters.",
      "Effect": null
    },
    "newborn_tainted_hydro_phantasm": {
      "Name": "Newborn Tainted Hydro Phantasm",
      "Description": "A new lifeform that arose from the dispersed Tainted Hydro Phantasm Tainted Hydro Phantasm.\nIt is trapped inside a bottle.\nThe life contained within the waters is formless, and formless life is born of water and gains water's shape.",
      "Effect": null
    },
    "old_operatives_pocket_watch": {
      "Name": "Old Operative's Pocket Watch",
      "Description": "A standard-issue pocket watch given to Fatui Operatives.\nThe erosion and oxidation on the casing serve as a loyal record of its owners' days spent as an instrument, enforcing the Fatui's will.",
      "Effect": null
    },
    "operatives_standard_pocket_watch": {
      "Name": "Operative's Standard Pocket Watch",
      "Description": "A standard-issue pocket watch given to Fatui Operatives.\nThe head of the watch is not well-designed, as the outer casing has way too many sharp angles, which can cause excessive wear and tear on clothes. As such, there will always be those who will stuff this watch into a more practical, less distinctive casing for use.",
      "Effect": null
    },
    "operatives_constancy": {
      "Name": "Operative's Constancy",
      "Description": "An accessory with a Delusion mounted on it. This is source of the Fatui Operative's power.\nThat said, taking it off would not detract from the fact that said Operative has physical abilities far beyond that of ordinary humans, forged through long years of training and combat experience. As for them, they are well-aware that they have sacrificed their past, present, and future upon the altar of the Fatui's ideal paradise, such that the damage they cause themselves on account of using a Delusion's power matters not at all.",
      "Effect": null
    }
  },
  "CommonEnemyMaterials": {
    "slime_condensate": {
      "Name": "Slime Condensate",
      "Description": "A thick coating found on slimes. Most commonly seen material in elemental workshops.",
      "Effect": null
    },
    "slime_secretions": {
      "Name": "Slime Secretions",
      "Description": "Mildly purified slime secretions. Harmful to the skin. Please avoid direct exposure.",
      "Effect": null
    },
    "slime_concentrate": {
      "Name": "Slime Concentrate",
      "Description": "Concentrated slime essence. When left alone, it will begin to move on its own.",
      "Effect": null
    },
    "damaged_mask": {
      "Name": "Damaged Mask",
      "Description": "A broken bone mask that once belonged to some hilichurl.\nNow more broken than complete, it can no longer perform its primary function.",
      "Effect": null
    },
    "stained_mask": {
      "Name": "Stained Mask",
      "Description": "A bone mask covered in unidentifiable stains and a mysterious odor.\nYet such is the devotion of hilichurls to masks that they will wear it nonetheless.",
      "Effect": null
    },
    "ominous_mask": {
      "Name": "Ominous Mask",
      "Description": "A glossy bone mask with oil markings painted on it, meant to intimidate enemies.\nNo one really knows why hilichurls are so fascinated with masks. Some say it's because they don't want to see their own reflections in the water.",
      "Effect": null
    },
    "divining_scroll": {
      "Name": "Divining Scroll",
      "Description": "A scroll that likely relates to some kind of magic. Exudes an inexplicable but ominous warmth.",
      "Effect": null
    },
    "sealed_scroll": {
      "Name": "Sealed Scroll",
      "Description": "An old scroll lacking in detail and clarity. By following the images on it, some magical creatures can recreate a small part of its magic.",
      "Effect": null
    },
    "forbidden_curse_scroll": {
      "Name": "Forbidden Curse Scroll",
      "Description": "A scroll inscribed with ancient images. It is said that few can decipher its meaning, and the few scholars that have all went mad.",
      "Effect": null
    },
    "firm_arrowhead": {
      "Name": "Firm Arrowhead",
      "Description": "A roughly produced arrowhead. Though unimpressive, neither it nor the bow should be underestimated, for even the bravest knight can be felled by an arrow from the rear.",
      "Effect": null
    },
    "sharp_arrowhead": {
      "Name": "Sharp Arrowhead",
      "Description": "A well-made arrowhead. Sharp enough to penetrate armor with the ease of a rock through the surface of water.",
      "Effect": null
    },
    "weathered_arrowhead": {
      "Name": "Weathered Arrowhead",
      "Description": "An old arrowhead coated in blood. The arrowhead has long since lost its sharpness and thus its use as a weapon.\nHowever it represents the pride of a hunter and acts as both an amulet and a medal.",
      "Effect": null
    },
    "recruits_insignia": {
      "Name": "Recruit's Insignia",
      "Description": "An insignia to identify the recruits. Makes one wonder about what the ones joining the Fatui's war machine were thinking.",
      "Effect": null
    },
    "sergeants_insignia": {
      "Name": "Sergeant's Insignia",
      "Description": "An insignia with a different shape to tell the sergeants from new recruits. Perhaps there are complicated emotions behind it.",
      "Effect": null
    },
    "lieutenants_insignia": {
      "Name": "Lieutenant's Insignia",
      "Description": "An armband to identify officers. The Fatui possess a colossal army, so there must be something extraordinary about the ones who achieved this rank within the group.",
      "Effect": null
    },
    "treasure_hoarder_insignia": {
      "Name": "Treasure Hoarder Insignia",
      "Description": "A signet that proudly represents its owner's position as a member of the Treasure Hoarders. The pursuit of treasure knows no bounds. That said... is being a thief something to be proud of?",
      "Effect": null
    },
    "silver_raven_insignia": {
      "Name": "Silver Raven Insignia",
      "Description": "A raven insignia used by members of the Treasure Hoarders to identify each other. The Treasure Hoarders ask for no resume. Anyone who has an insatiable desire for treasure and is backed up by an equal amount of courage can become a worthy member.",
      "Effect": null
    },
    "golden_raven_insignia": {
      "Name": "Golden Raven Insignia",
      "Description": "A raven insignia that symbolizes the pride and the guiding principle of the Treasure Hoarders. Whether it's hidden amidst the vastness of the land or in the depths of the seas, as long as there are treasures to be hunted down, the spirit of Treasure Hoarders, who will stop at nothing to acquire them, will never die.",
      "Effect": null
    },
    "whopperflower_nectar": {
      "Name": "Whopperflower Nectar",
      "Description": "Nectar extracted from the stamen of a Whopperflower that contains trace amounts of elements. The taste of the nectar has a hint of Sweet Flower in it.",
      "Effect": null
    },
    "shimmering_nectar": {
      "Name": "Shimmering Nectar",
      "Description": "Nectar that is full of pure elements.\nScholars generally concur that Whopperflowers are advanced life forms among the elemental plants, but there has yet to be a satisfactory explanation regarding their predatory habits.",
      "Effect": null
    },
    "energy_nectar": {
      "Name": "Energy Nectar",
      "Description": "A thick and sticky honey that is full of energy. The Whopperflower hunts by tricking its prey, a process it uses to possibly evolve into a more powerful and pure form.",
      "Effect": null
    },
    "old_handguard": {
      "Name": "Old Handguard",
      "Description": "A battle-worn handguard that was once mounted on an Inazuman blade.\nFor those adept in the art of the sword, the tsuba is a defense from the edge of an opponent's blade. For beginners, it is a defense made for their own right hand, to protect it from itself.",
      "Effect": null
    },
    "kageuchi_handguard": {
      "Name": "Kageuchi Handguard",
      "Description": "A handguard mounded upon a sword of some distinction.\nInazuma has a long tradition of sword-making. When making swords, smiths will often make several different weapons at once, before choosing from among them the \"shinuchi,\" or the best weapon, while the others are known as \"kageuchi.\"",
      "Effect": null
    },
    "famed_handguard": {
      "Name": "Famed Handguard",
      "Description": "An intricately-made handguard that was mounted upon a famed weapon.\nSome believe that swords have souls and lives of their own, and thus deserve their own names. Those who love their blades will be acknowledged by them in turn. But those who see their swords as friends or even lovers should be warned that this relationship is built on death and bloodshed. The passions of those who dance with their blade amid crimson showers must surely be cooled someday by fickle steel.",
      "Effect": null
    },
    "spectral_husk": {
      "Name": "Spectral Husk",
      "Description": "An energy core that allows the Specters to float.\nIt contains a small amount of elemental energy. Most of the rest has already dispersed.",
      "Effect": null
    },
    "spectral_heart": {
      "Name": "Spectral Heart",
      "Description": "An energy core that allows the Specters to float.\nThese elemental life-forms have strange behavioral patterns and will periodically surge in number before disappearing.",
      "Effect": null
    },
    "spectral_nucleus": {
      "Name": "Spectral Nucleus",
      "Description": "A complete energy core that can sometimes be found after defeating Specters.\nThere is a debate among those who just have to divide the world into winners and losers: what floats better — a Specter or an Anemo Slime?",
      "Effect": null
    },
    "fungal_spores": {
      "Name": "Fungal Spores",
      "Description": "A small amount of glittering spore powder left behind by Floating Fungi. Seems that a sneeze is all it takes for this powder to vanish without a trace.",
      "Effect": null
    },
    "luminescent_pollen": {
      "Name": "Luminescent Pollen",
      "Description": "A small parcel of luminescent Fungal Spore powder, a common medical ingredient in the land of rainforests. Merchants usually sell them in paper packets.",
      "Effect": null
    },
    "crystalline_cyst_dust": {
      "Name": "Crystalline Cyst Dust",
      "Description": "A huge lump of spore powder collected from a structurally complete spore cyst. Put it in an appropriate environment, and the area might be filled with a thriving aggregation of Floating Fungi later...",
      "Effect": null
    },
    "faded_red_satin": {
      "Name": "Faded Red Satin",
      "Description": "A piece of red satin used to cover the eyes. The fabric is slightly torn.\nMany Eremites tend to cover their eyes with textiles, but the original intention of this practice has long been lost to the sands of time.",
      "Effect": null
    },
    "trimmed_red_silk": {
      "Name": "Trimmed Red Silk",
      "Description": "A piece of red silk trimmed with simple decorations.\nA seasoned warrior can detect weaknesses from their foe's eyes and thus take advantage. The Eremites have long since lost a master to serve, and now they have no one to trust but themselves. Word has it that they are more than convinced that all things betray, even their own eyes.",
      "Effect": null
    },
    "rich_red_brocade": {
      "Name": "Rich Red Brocade",
      "Description": "A piece of red brocade woven with golden thread.\nThose born in the gilded desert under the sun occasionally sing a song, of which the meaning has been forgotten. They would praise the scorching sun that illuminates the earth as equally as ever and bewail the afterglow at the end of the dusk. Some unfamiliar words recur at the end of the song, which are said to be the names of ancient gods. Legend has it that when the King of the Desert was still alive, his people chose to cover their eyes as they dared not look upon him, whose brilliance was beyond that of the sun.",
      "Effect": null
    },
    "desiccated_shell": {
      "Name": "Desiccated Shell",
      "Description": "The ruined shell of a Consecrated Beast.\nA tangible effigy to the grand calamity that devoured the lands of yore, usually only discovered in places few dare tread.",
      "Effect": null
    },
    "sturdy_shell": {
      "Name": "Sturdy Shell",
      "Description": "A sturdy shell of a Consecrated Beast.\nThe remains of a ruinous beast that once gnawed at the flesh of great, fallen beings. Even should the beasts sup a sliver of power from the gods of yesteryear, they too will greet the same and as said gods.",
      "Effect": null
    },
    "marked_shell": {
      "Name": "Marked Shell",
      "Description": "The marked shell of a Consecrated Beast inscribed with ancient script.\nOn the pallid contours of the shell, the regrets of a time long past have been inlaid. One day, the bones of the beast will scatter like dust in the wind, and then, finally, may the exalted deceased greet their final rest…",
      "Effect": null
    },
    "transoceanic_pearl": {
      "Name": "Transoceanic Pearl",
      "Description": "A small crystal obtained from a defeated Fontemer Aberrant.\nFontemer Aberrants arise from Fontaine's sea. They are believed to be a unique life form born from the mysterious energy in the water.",
      "Effect": null
    },
    "transoceanic_chunk": {
      "Name": "Transoceanic Chunk",
      "Description": "A crystal obtained from a defeated Fontemer Aberrant.\nIt gives off a somewhat mysterious energy.\nAlthough many legends speak of great life forms residing in remote seas beyond human reach, ordinary oceans can hardly compare to the vibrant seas of Fontaine.",
      "Effect": null
    },
    "xenochromatic_crystal": {
      "Name": "Xenochromatic Crystal",
      "Description": "A large crystal obtained from a defeated Fontemer Aberrant.\nIt contains a mysterious energy.\nAll rivers and seas originate in Fontaine, but the water loses all its unique properties once it flows outside Fontaine's borders.",
      "Effect": null
    },
    "meshing_gear": {
      "Name": "Meshing Gear",
      "Description": "Clockwork meka's gear.\nIt is a crucial part of the meka's transmission structure. The whole system will malfunction if this gear is absent.",
      "Effect": null
    },
    "mechanical_spur_gear": {
      "Name": "Mechanical Spur Gear",
      "Description": "Clockwork meka's gear.\nAlthough many breakthroughs have been made in the kinematics of clockwork meka, its dynamics research has not seen any major advancements beyond the framework laid down by Alain Guillotin four hundred years ago.",
      "Effect": null
    },
    "artificed_dynamic_gear": {
      "Name": "Artificed Dynamic Gear",
      "Description": "Clockwork meka's gear.\nPrecision processing and advancement of material science are the keys to clockwork meka development in Fontaine. With the help of advanced equipment, any engineer is capable of making a meka that outshines \"Lord-Artificer\" Alain Guillotin's creation.",
      "Effect": null
    }
  },
  "EnhancementMaterials": {
    "wanderers_advice": {
      "Name": "Wanderer's Advice",
      "Description": "These experiences are still beneficial even if one does not live in Teyvat.",
      "Effect": "Character EXP material. Gives 1,000 EXP."
    },
    "adventurers_experience": {
      "Name": "Adventurer's Experience",
      "Description": "These experiences are very beneficial for journeys into the unknown.",
      "Effect": "Character EXP material. Gives 5,000 EXP."
    },
    "heros_wit": {
      "Name": "Hero's Wit",
      "Description": "These experiences are extremely precious for a pilgrim traveling through Teyvat in order to be closer to Celestia.",
      "Effect": "Character EXP material. Gives 20,000 EXP."
    },
    "enhancement_ore": {
      "Name": "Enhancement Ore",
      "Description": "A refined ingot with endless possibilities that can be used to enhance weapons.",
      "Effect": "Weapon EXP material. Gives 400 EXP."
    },
    "fine_enhancement_ore": {
      "Name": "Fine Enhancement Ore",
      "Description": "For reasons unknown, this special and refined ore can be absorbed by weapons to greatly increase their strengths.",
      "Effect": "Weapon EXP material. Gives 2,000 EXP."
    },
    "mystic_enhancement_ore": {
      "Name": "Mystic Enhancement Ore",
      "Description": "Legend has it that this refined ingot contains the memories of battles that had taken place in the land. The weapons that benefit from these memories naturally become sentient.",
      "Effect": "Weapon EXP material. Gives 10,000 EXP."
    }
  },
  "RefinementMaterials": {
    "festering_dragon_marrow": {
      "Name": "Festering Dragon Marrow",
      "Description": "This is the product of purifying Durin's vile venom, which has seeped into and spread throughout Dragonspine's ley lines. By using it on a bloodthirsty sword with a strong affinity for such materials, you can increase that sword's power.",
      "Effect": null
    },
    "the_visible_winds": {
      "Name": "\"The Visible Winds\"",
      "Description": "An intricately-made ornament that symbolizes the windmills and windblumes, and is that which adorns the limbs of the Windblume Ode. The wind is invisible and intangible, but the windmills that keep turning and the swaying flowers in the emerald fields are \"the visible winds\" that show people that the breeze will always care for all life in Mondstadt.",
      "Effect": null
    },
    "fragments_of_innocence": {
      "Name": "\"Fragments of Innocence\"",
      "Description": "Pages scattered on the wind. Each one is filled to the brim with childlike wonder, and their dimensions are an exact match for \"Dodoco Tales.\" The abundant innocence and pure love therein will never fade, and just like the never-ending adventure in the book — this passionate fairy tale shall forever soar in the wake of the author's footsteps.",
      "Effect": null
    },
    "akos_sake_vessel": {
      "Name": "Ako's Sake Vessel",
      "Description": "This was the favored liquor vessel of Ako Domeki, who once ruled over the Seirai region.\nThe sea has brought it onto an angler's hook.",
      "Effect": null
    },
    "emperors_balsam": {
      "Name": "Emperor's Balsam",
      "Description": "The intense fragrance of this paste seems to have sealed the spirit of sea life within. Smear it on the Luxurious Sea-Lord to tender this unique claymore and make it harder still.",
      "Effect": null
    },
    "alkahest": {
      "Name": "Alkahest",
      "Description": "A silver substance shining with an otherworldly light that is a deadly corrosive poison to things of this world. And yet it also has the power to sublimate matter...",
      "Effect": null
    },
    "ointment_of_sight": {
      "Name": "Ointment of Sight",
      "Description": "Special Deep Sea Unagi oil, which was once used to maintain Enkanomiya's sacred artifacts, has been carefully processed for the purpose of making this shining eye most bright indeed.",
      "Effect": null
    },
    "glowing_gem": {
      "Name": "Glowing Gem",
      "Description": "Specialized refinement material for Fading Twilight.\nCor Lapis delicately refined by ancient arts practiced by the early inhabitants of The Chasm. It glimmers slightly with a light that resembles either the radiance of dawn or the dying twilight. Appearing in caverns where none may see either form of light, it must have brought some small comfort to those who fought against the dark enemy.",
      "Effect": null
    },
    "original_fish_ointment": {
      "Name": "Original Fish Ointment",
      "Description": "Ointment refined from a catch from the great lake in the north. It has the effect of temporarily restoring the energy of the fish that could be made into fine bows. It is said that in the lake dwell aquatic creatures that cannot be seen anywhere else in Teyvat.",
      "Effect": null
    },
    "plume_of_the_changing_winds": {
      "Name": "Plume of the Changing Winds",
      "Description": "Specialized refinement material for \"Missive Windspear.\"\nAn ancient feather carved from turquoise. It was once used as an ornament or a token of sorts.",
      "Effect": null
    },
    "parasol_talcum": {
      "Name": "Parasol Talcum",
      "Description": "A powdery substance meant to bind bamboo to an umbrella.\nEven as the seasons change and the past dissolves, memory and thoughts will always remain, slumbering beneath an umbrella to rest in the shroud of a dream.",
      "Effect": null
    },
    "unfading_silky_grace": {
      "Name": "Unfading Silky Grace",
      "Description": "Specialized refinement material for \"Mailed Flower.\"\nDecorations can always provide a little something beyond an item's value and function. In times like these, an unwithering flower can lend some romantic essence to even a weapon.",
      "Effect": null
    },
    "congealed_pupa_wax": {
      "Name": "Congealed Pupa Wax",
      "Description": "In the Great Red Sand, the youth who later became the King of Invokations was requested by the descendants of the Ibis King to spend a few days formulating bowstring wax from Sand Grease Pupae. However, the legendary bow disappeared along with the Ibis King, and only the recipe for making pupa wax was passed down from generation to generation. Perhaps it's still waiting for the day when it can be used again.",
      "Effect": null
    },
    "martens_omni_fix": {
      "Name": "Martens' Omni-Fix",
      "Description": "Not only can it prevent oxidation and erosion by forming an isolation layer on certain materials, but it also helps lubricate, clean, and polish. It was once all the rage in Fontaine. In the advertisements back then, a legendary figure from the Fleuve Cendre used it to maintain the famous curved copper tube.",
      "Effect": null
    }
  },
  "ForgingMaterials": {
    "iron_chunk": {
      "Name": "Iron Chunk",
      "Description": "This iron ore can be turned into a multitude of handy items in the hands of a skilled craftsman. Mineral ores' presence on the surface usually indicates abundant ore veins underneath.",
      "Effect": null
    },
    "white_iron_chunk": {
      "Name": "White Iron Chunk",
      "Description": "This white iron ore can be turned into a variety of splendid items in the hands of a skilled craftsman. It is suffused with memories of battles fought across the land, which makes it a great material for crafting weapons.",
      "Effect": null
    },
    "crystal_chunk": {
      "Name": "Crystal Chunk",
      "Description": "An uncut crystal. Only professional craftsmanship can bring out its true value. This kind of limpid rock is a precious gift of the land, which can be utilized as a valuable weapon-making material.",
      "Effect": null
    },
    "magical_crystal_chunk": {
      "Name": "Magical Crystal Chunk",
      "Description": "This crystal was eroded by the energy of the Ley Lines and cannot be processed by ordinary means. Original Resin can, however, refine it into an invaluable material.",
      "Effect": null
    },
    "starsilver": {
      "Name": "Starsilver",
      "Description": "A rare and precious ore formed by the unique geographical conditions and Ley Lines of Dragonspine.",
      "Effect": null
    },
    "amethyst_lump": {
      "Name": "Amethyst Lump",
      "Description": "An uncut crystal that can only be found in Inazuma. Some professional craftsmanship will bring out its true value.",
      "Effect": null
    },
    "northlander_bow_billet": {
      "Name": "Northlander Bow Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star bows. Philosophers believe marble has the potential to be sculpted into a beautiful statue. Likewise, these billets have the potential to become something greater.",
      "Effect": null
    },
    "northlander_catalyst_billet": {
      "Name": "Northlander Catalyst Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star catalysts. Philosophers believe marble has the potential to be sculpted into a beautiful statue. Likewise, these billets have the potential to become something greater.",
      "Effect": null
    },
    "northlander_claymore_billet": {
      "Name": "Northlander Claymore Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star claymores. Philosophers believe marble has the potential to be sculpted into a beautiful statue. Likewise, these billets have the potential to become something greater.",
      "Effect": null
    },
    "northlander_polearm_billet": {
      "Name": "Northlander Polearm Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star polearms. Philosophers believe marble has the potential to be sculpted into a beautiful statue. Likewise, these billets have the potential to become something greater.",
      "Effect": null
    },
    "northlander_sword_billet": {
      "Name": "Northlander Sword Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star swords. Philosophers believe marble has the potential to be sculpted into a beautiful statue. Likewise, these billets have the potential to become something greater.",
      "Effect": null
    },
    "midlander_bow_billet": {
      "Name": "Midlander Bow Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star bows.\nPhilosophers believe that there are four purposes behind earthly things. The purpose of these billets is to become a weapon worthy of accompanying a hero.",
      "Effect": null
    },
    "midlander_catalyst_billet": {
      "Name": "Midlander Catalyst Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star catalysts.\nPhilosophers believe that there are four purposes behind earthly things. The purpose of these billets is to become a weapon worthy of accompanying a hero.",
      "Effect": null
    },
    "midlander_claymore_billet": {
      "Name": "Midlander Claymore Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star claymores.\nPhilosophers believe that there are four purposes behind earthly things. The purpose of these billets is to become a weapon worthy of accompanying a hero.",
      "Effect": null
    },
    "midlander_polearm_billet": {
      "Name": "Midlander Polearm Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star polearms.\nPhilosophers believe that there are four purposes behind earthly things. The purpose of these billets is to become a weapon worthy of accompanying a hero.",
      "Effect": null
    },
    "midlander_sword_billet": {
      "Name": "Midlander Sword Billet",
      "Description": "Weapon forging material. Can be used to forge 4-star swords.\nPhilosophers believe that there are four purposes behind earthly things. The purpose of these billets is to become a weapon worthy of accompanying a hero.",
      "Effect": null
    },
    "condessence_crystal": {
      "Name": "Condessence Crystal",
      "Description": "A bright and clear crystal with a core that is both tough and malleable.",
      "Effect": null
    }
  },
  "Currencies": {
    "mora": {
      "Name": "Mora",
      "Description": "Common currency. The one language everybody speaks.",
      "Effect": null
    },
    "anemo_sigil": {
      "Name": "Anemo Sigil",
      "Description": "An insignia that shows the recognition of the winds of Mondstadt.\nCan be exchanged for special items in Mondstadt.",
      "Effect": null
    },
    "geo_sigil": {
      "Name": "Geo Sigil",
      "Description": "An insignia that shows the recognition of the cliffs of Liyue.\nCan be exchanged for special items in Liyue.",
      "Effect": null
    },
    "dendro_sigil": {
      "Name": "Dendro Sigil",
      "Description": "A sigil that serves as a sign of recognition from the trees, grass, and flowers in Sumeru. Offer it to the Tree of Dreams deep in the woods to receive the rewards from the forest.",
      "Effect": null
    },
    "electro_sigil": {
      "Name": "Electro Sigil",
      "Description": "A sigil that serves as a sign of the acknowledgment given by the thundering islands of Inazuma. Offer them to the Sacred Sakura of the Grand Narukami Shrine to raise your Sacred Sakura's Favor level.",
      "Effect": null
    },
    "hydro_sigil": {
      "Name": "Hydro Sigil",
      "Description": "A sigil that serves as a sign of recognition from the waters in Fontaine.\nOffer it to the Fountain of Lucine to receive the rewards from the springs.",
      "Effect": null
    },
    "genesis_crystal": {
      "Name": "Genesis Crystal",
      "Description": "An energy crystal from the very origin of the universe. Formed from within nothingness out of pure potential and hope, it contains enough energy to create a newborn star.",
      "Effect": null
    },
    "masterless_stardust": {
      "Name": "Masterless Stardust",
      "Description": "Currency used to purchase rare resources from the Shop.",
      "Effect": null
    },
    "masterless_starglitter": {
      "Name": "Masterless Starglitter",
      "Description": "Currency used to purchase rare resources from the Shop.",
      "Effect": null
    },
    "primogem": {
      "Name": "Primogem",
      "Description": "A primordial crystalline gem that's beyond the mundane world. Shines with the condensed hopes and dreams of universes that once were.",
      "Effect": null
    },
    "realm_currency": {
      "Name": "Realm Currency",
      "Description": "Currency of the realm. Used within the Serenitea Pot to exchange for various items.",
      "Effect": null
    }
  },
  "Fishies": {
    "fruit_paste_bait": {
      "Name": "Fruit Paste Bait",
      "Description": "A very commonly-seen bait made from mashing, fermenting, and kneading Sunsettias and Wheat together. It atomizes very quickly upon hitting the water and exerts an incredible attraction on small fish. Due to the ease of its making, cheap price, and its excellent efficacy, it has also been jokingly called the \"Fisher's Trusty Treasure\".\nSuitable for catching Medakas, Dawncatchers, and Crystalfish.",
      "Effect": null
    },
    "false_worm_bait": {
      "Name": "False Worm Bait",
      "Description": "This imitation worm bait is made mostly out of condensate, and will twist its body according to the underwater currents, resulting in its fatal attraction to overly-curious fish. Professionals will even add some fruit to it to increase its fragrance and make it utterly irresistable.\nSuitable for catching Shirakodai and Angelfish.",
      "Effect": null
    },
    "redrot_bait": {
      "Name": "Redrot Bait",
      "Description": "Fish bait made from mixing Dendrobium and mashed meat. The unique rank sweetness of this bait spreads very quickly in the water, attracting fierce aquatic predators. Use with caution, however! Put too much of this bait down and you might hook in nastier customers than you bargained for!\nSuitable for catching Sticklebacks, Bettas, Venomspine Fish, Akai Maou, and Snowstriders.",
      "Effect": null
    },
    "fake_fly_bait": {
      "Name": "Fake Fly Bait",
      "Description": "Mimetic fly bait made from vibrantly-colored materials. It has no scent, and is specialized to attract large fish with sharp vision. It is often well-suited to more advanced angling techniques. The fishing associations of various regions regard the skilled use of such bait as one of the conditions for its members' advancement in rank.\nSuitable for catching Koi, Pufferfish, and Rays.",
      "Effect": null
    },
    "sugardew_bait": {
      "Name": "Sugardew Bait",
      "Description": "The bait is based on rose dew and has been mixed with sun-dried Harra Fruit powder. It has a spicy taste and a sweet aftertaste, just like the life of a fisherman. The harvest after going through all the weather-beaten days and roaring waves is particularly gratifying.\nSuitable for: Angler and Axe Marlin.",
      "Effect": null
    },
    "sour_bait": {
      "Name": "Sour Bait",
      "Description": "A type of bait based on flour mixed with the pulp and seeds of Bulle Fruit. When tossed into the water, it quickly spreads a sweet and sour fragrance that is irresistible to fishes such as Heartfeather Bass. A group of anglers once resorted to eating this bait in an emergency after they had run out of supplies, and were poisoned as a result. To prevent such accidents from happening again, this type of bait was made much sourer than it was before – so sour in fact that simply holding it up to their noses makes people feel dizzy and causes their eyes to stream, let alone putting it in their mouths...\n\nSuitable for catching Heartfeather Bass.",
      "Effect": null
    },
    "flashing_maintenance_mek_bait": {
      "Name": "Flashing Maintenance Mek Bait",
      "Description": "A unique type of Trap said to utilize technology developed by the Fontaine Research Institute. Equipped with a metal protective cage and hook bars, the device contains a light made from Marcotte extract.\nWhen tossed in water, the light flashes at a certain frequency to attract nearby Maintenance Meks, which are often referred to as \"Water Maintenance Fish\" or \"Iron Fish.\" Maintenance Meks have powerful bites, but they are only able to bite onto the specially made external bars which hook them firmly in place. The contraption is essentially a special kind of bait designed to catch valuable \"Iron Fishes.\"\n\nSuitable for catching Maintenance Meks.",
      "Effect": null
    },
    "medaka": {
      "Name": "Medaka",
      "Description": "A lively, energetic fish famous for its petal-shaped tail.\nMost such creatures lived out their lives peacefully as ornamental fish. But when it was discovered that their meat was flavorful, less bony, and very fatty, they would also come to find themselves carefully prepared and served up on meal tables.",
      "Effect": null
    },
    "glaze_medaka": {
      "Name": "Glaze Medaka",
      "Description": "A lively, energetic fish famous for its petal-shaped tail.\nThis species has inscrutable behavioral patterns, and they can often be seen bursting into struggling fits out of the blue, as if bearing some sort of unseen pain. This phenomenon, however, does not occur at all when they are alone. Some researchers believe that this peculiarity stems from their natural desire to perform.",
      "Effect": null
    },
    "sweet_flower_medaka": {
      "Name": "Sweet-Flower Medaka",
      "Description": "A lively, energetic fish famous for its petal-shaped tail.\nIt might be because this fish has a sweet tooth, but every bone in its body seems to serve as an antenna to seek out sweet treats. Following this absolute ideology, they swim through every creek and river in Teyvat in search of tasty sweets. True egalitarians, they will never reject any morsel, and certainly not because there's a hook attached. Have bait, will bite, as they say.\nBeginner friendly.",
      "Effect": null
    },
    "aizen_medaka": {
      "Name": "Aizen Medaka",
      "Description": "A lively, energetic fish famous for its petal-shaped tail.\nLong ago, there was a funny story that said that you could get Aizen Medaka by throwing normal Medaka into a pot of blue dye. This was most likely born from a child's over-active imagination, but has nonetheless given rise to not a few unscrupulous fish hawkers. This in turn has given rise to some conversations that go something like \"Hey, is it just me, or is the blue on your fish washing off?\" In response, the Ministry of Civil Affairs specifically posted this notice: \"The market is a wet and wild place. Beware of influxes of blue fish.\"",
      "Effect": null
    },
    "dawncatcher": {
      "Name": "Dawncatcher",
      "Description": "A rare species of Medaka that has a brilliant sheen. It seems like a variant species of the normal Medaka, but it has a very different appearance and living habits.\nThere is a rumor that these fish have the mystical ability to predict the weather. If they leap out of the water to catch the dawn's first light as it pierces the skies, then there will surely be a fine, sunny day to come.",
      "Effect": null
    },
    "crystalfish": {
      "Name": "Crystalfish",
      "Description": "A rare Medaka that glitters like crystal. Its patterns are very intricate indeed, to the point where it is often called the \"Medaka Aesthete.\"\nSome merchants will claim that these Medaka will lay a crystal pearl under certain extreme conditions and that this pearl is both an item of great price and a sign of quality. This has made these fish very sought after by people from all walks of life and caused their market value to soar. However, this is just amusing to the fishermen, who know the inside story: That object is merely a Loach Pearl that the fish ate by mistake. It rolled into the fish's salty intestines, only to spat back out of the mouths of merchants with an agenda. Some grounds for a price hike that is!",
      "Effect": null
    },
    "brown_shirakodai": {
      "Name": "Brown Shirakodai",
      "Description": "A gentle, elegant butterflyfish variant. It has a lovely, streamlined dorsal fin, and has the nickname \"Queen of the Waters.\"\nEarthen-colored patterns run across its body, and its temper is also as steady as stone. They can go a bit overboard, however, and will sometimes lie at the bottom and not move an inch, just like a rock, leading some buyers to think that they've bought some hopelessly moribund old fish.",
      "Effect": null
    },
    "purple_shirakodai": {
      "Name": "Purple Shirakodai",
      "Description": "A gentle, elegant butterflyfish variant. It has a lovely, streamlined dorsal fin, and has the nickname \"Queen of the Waters.\"\nLovely purple patterns run across its body, and they love to swim together in schools to fend off natural dangers and predators. But once this quirk of theirs was grasped by seasoned fisherpeople, they realized that all one needed to do was to lure a single fish into the trap, and all the rest would follow.",
      "Effect": null
    },
    "tea_colored_shirakodai": {
      "Name": "Tea-Colored Shirakodai",
      "Description": "A gentle, elegant butterflyfish variant. It has a lovely, streamlined dorsal fin, and has the nickname \"Queen of the Waters.\"\nTea-colored patterns swirl around this inquisitive fish that seems strongly interested in everything around it. Unfortunately, its method of expressing interest in anything is to have a nibble to see if it can be eaten. This isn't a malicious move by any means, but it has landed this species in hot water many times all the same.",
      "Effect": null
    },
    "abiding_angelfish": {
      "Name": "Abiding Angelfish",
      "Description": "A rare and valuable butterflyfish variant from Liyue. At present, it can only be found near water bodies around the abodes of the adepti. Its pale white lines are very striking, and it has greater longevity than other members of the species and is thus regarded to be a lucky fish blessed by the adepti.\nMost people from Liyue will refuse to eat this fish on principle, given the common respect for the adepti, but some fear no such superstition and claim that eating these fish can help one extend one's years.",
      "Effect": null
    },
    "raimei_angelfish": {
      "Name": "Raimei Angelfish",
      "Description": "A rare and valuable butterflyfish variant from Inazuma. It loves water bodies suffused with Electro, and seems to derive joy from electric currents.\nIt is said that these fish were once from the same line as the Abiding Angelfish of Liyue, until traveling merchants exported them to Inazuma. There, their behavioral patterns underwent an unexpected shift. At present, some researchers have begun to use them in conjunction with Electro Slimes for experiments.\n\"Ma... Mah... Mah tung ith numm...\" — A certain greedy gourmet after trying a Raimei Angelfish dish.",
      "Effect": null
    },
    "lunged_stickleback": {
      "Name": "Lunged Stickleback",
      "Description": "A swift, fierce fish with spiny fins whose spiny mouth can pierce the current when it swims at full speed. Its capabilities have earned it the nicknames \"The Cutter\" and \"Hard-To-Get.\"\nUnlike others of its kind, the lunged stickleback can live in dried, muddy pools for a long time. Other than its gills, it can also breathe through its degenerated scales, which is a feature much more similar to that of amphibians. As such, apart from dealing with uninvited anglers, it also has to deal with an academic vote of no confidence in it still being a stickleback.",
      "Effect": null
    },
    "betta": {
      "Name": "Betta",
      "Description": "A swift, fierce fish with spiny fins whose spiny mouth can pierce the current when it swims at full speed. Its capabilities have earned it the nicknames \"The Cutter\" and \"Hard-To-Get.\"\nAmong sticklebacks, this sort would either count as the proudest, or a rather close second place. They are especially prickly during courtships, where even the slightest breeze or smallest ripple might trip their fuse. A hobbyist once observed one such specimen charging at waving seagrass, as if such flagrant dancing was some major provocation against the stickleback king or something.\n\"If you encounter one underwater, do not look it in the eyes.\" — Angler's Atlas, Betta Chapter",
      "Effect": null
    },
    "venomspine_fish": {
      "Name": "Venomspine Fish",
      "Description": "A swift, fierce fish with spiny fins whose spiny mouth can pierce the current when it swims at full speed. Its capabilities have earned it the nicknames \"The Cutter\" and \"Hard-To-Get.\"\nThe Venomspine Fish's most well-known trait is its poisonous spines, which contain a neurotoxin that is fatal to smaller prey but proves far weaker against large organisms, mostly only causing mild confusion or hallucinations.\n\"Fill 'er up, Rex, my good lad! Fill 'er up to the brim for big brother!\" — A certain fisherman from Liyue who was accidentally pricked.",
      "Effect": null
    },
    "akai_maou": {
      "Name": "Akai Maou",
      "Description": "A stickleback with a fierce appearance and a manner to match. It will fight anyone and anything under the sea for food — a veritable and much-feared robber in red. Its fiery-red coloration seems to have much to do with Pyro, for while they cannot quite become flame generators, they do have some control over high temperatures. They can convert energy from their food and focus it on their dangerous snouts, making them underwater scoundrels indeed.\n\"Need to drill wood to make a flame? This is your best friend.\" — Angler's Atlas, Akai Maou Chapter",
      "Effect": null
    },
    "snowstrider": {
      "Name": "Snowstrider",
      "Description": "A rare stickleback that only dwells in snowy, mountainous regions. It is quite possibly due to this that it has a much cooler temperament as compared to other sticklebacks. This species has a unusually great love for the bitter cold, almost as if they were parent and child. Though they can live in warmer waters, but any removal from such conditions is like striking a spiritual blow to them, and they will become depressed and refuse to multiply.\n\"Not a recommended catch.\" — Angler's Atlas, Snowstrider Chapter",
      "Effect": null
    },
    "golden_koi": {
      "Name": "Golden Koi",
      "Description": "A large fish said to be the descendant of dragons.\nWith the horn on its head and its scaleless form clad as if in golden armor, it looks every bit like a king underwater. In truth, its bloodline and behavior could not be more different from that of a dragon — it can neither call forth the wind and rain nor the power of domination and is actually often the victim of food-snatching due to its weak character. A real shame, of course, that it looks so very majestic. As such, it lost the nickname \"Descendant of Dragons,\" and is now termed the \"False Dragon\" instead.",
      "Effect": null
    },
    "rusty_koi": {
      "Name": "Rusty Koi",
      "Description": "A large fish said to be the descendant of dragons.\nThis is a variant species of Koi, and is sometimes termed the \"awakened dragon\" amongst them. In stark contrast to its rather shabby appearance, the Rusty Koi has shed its opulent gold tabard in exchange for a hard armor of rusty bronze. Very strong-willed, it will fight any interloper that dares to steal its food or enter its territory. In terms of pure fighting capability, it is even a match for smaller sea monsters and has thus been given the nickname \"Ironbone Dragon\" in honor of its strength, which is considered the backbone of its species' future revitalization.",
      "Effect": null
    },
    "pufferfish": {
      "Name": "Pufferfish",
      "Description": "Round and short pelvic fins, a plump body, and a plain face make up most people's first impression of the pufferfish. This is by and large an accurate assessment of its character as well: dull, slow, and lazy. However, few people know that this rather silly exterior hides a killer technique — this fish is capable of sucking water into its body before expelling it like a cannon from its mouth with such force and pinpoint accuracy that even fishermen might be stunned by it. Truly, it is a first-rate killer in the water.\n\"Pufferfish ahead? Watch for spittle!\" — Angler's Atlas, Pufferfish Chapter",
      "Effect": null
    },
    "bitter_pufferfish": {
      "Name": "Bitter Pufferfish",
      "Description": "A rare pufferfish variant. As the name suggests, this creature spreads bitterness wherever it goes in the underwater world.\nIts water cannon projectiles are slower and smaller than those of its ordinary counterparts, but the power of such attacks is undiminished due to the incredibly bitter pheromones within. During their courtship phase, an observer might bear witness to the curious sight of males and females of this species blasting each other with these water cannons. Perhaps passing on the bitterness of life is also a manifestation of love.",
      "Effect": null
    },
    "divda_ray": {
      "Name": "Divda Ray",
      "Description": "A strange cartilaginous fish that was once thought to be a fantastical creature, only recorded in some ancient scrolls of art on Watatsumi Island. As the seal over Enkanomiya was opened, their true forms were laid bare before the eyes of all.\nIt is said that the bodily forms of these curious creatures will change color as time passes. When they are young, they are as gold as sunlight. Rays at this stage of life earned the name \"Divda\" in those ancient scrolls, which means \"the tail end of innocence.\"",
      "Effect": null
    },
    "formalo_ray": {
      "Name": "Formalo Ray",
      "Description": "A strange cartilaginous fish that was once thought to be a fantastical creature, only recorded in some ancient scrolls of art on Watatsumi Island. As the seal over Enkanomiya was opened, their true forms were laid bare before the eyes of all.\nIt is said that the bodily forms of these curious creatures will change color as time passes. When they are young, they are as gold as sunlight. Later in life, however, their colors deepen, and their two 'wings' will be colored with a purple as deep as the night. Rays at this stage of life earned the name \"Formalo\" in those ancient scrolls, which means \"the maw of greed.\"",
      "Effect": null
    },
    "halcyon_jade_axe_marlin": {
      "Name": "Halcyon Jade Axe Marlin",
      "Description": "A fish with unique morphology and Sumeru's cousin to the butterfly fish. This fish has a broad skeleton and a unique curved body. Legend has it that the first fishermen to catch this fish had their rods tilted at the end of the tail fin and found that the two, when combined, resemble a polearm, hence giving rise to the name \"Axe Marlin.\" This name has made much more of an impression than its scientific name, the \"Anchor Hook Butterfly,\" and it is thus colloquially used amongst most people.\nThe jade-colored Axe Marlin prefers to live in areas where aquatic plants flourish, and where its shape easily blends in with the background. Small fish that wander through the grass often bump into their camouflaged bodies and become dazed, but the marlin doesn't feel provoked, and will instead offer shelter to its neighbors.",
      "Effect": null
    },
    "lazurite_axe_marlin": {
      "Name": "Lazurite Axe Marlin",
      "Description": "A fish with unique morphology and Sumeru's cousin to the butterfly fish. This fish has a broad skeleton and a unique curved body. Legend has it that the first fishermen to catch this fish had their rods tilted at the end of the tail fin and found that the two, when combined, resemble a polearm, hence giving rise to the name \"Axe Marlin.\" This name has made much more of an impression than its scientific name, the \"Anchor Hook Butterfly,\" and it is thus colloquially used amongst most people.\nAlthough its namesake is a weapon, and its strength surpasses that of many other fish, Axe Marlin mostly have a kind personality, especially those with blue and gold stripes on the body. Due to their hard scales and big size, Axe Marlins are able to handle attacks from other aquatic creatures, waiting until their attacker is exhausted and leaves.<\nTheir strength can also prove challenging for a master fisherman, whose only choice is to treat them as large beasts — to drain their stamina more efficiently and eventually catch them, one must go all out the moment an Axe Marlin bites.\"",
      "Effect": null
    },
    "peach_of_the_deep_waves": {
      "Name": "Peach of the Deep Waves",
      "Description": "A medium-sized, round fish with horn-like cartilages that are used to dig underwater burrows, build shelters and drive away creatures that try to harm them.\nThis species' whole body is pink and the tail fin is green, colors that are associated with the Zaytun Peach. These fish are, as their name suggests, so sweet that they are considered \"ideal for dessert.\"\nDoubtless, owing to various factors, the fish dessert that the fish chefs were hoping to create did not pan out. Because this type of fish is rare and expensive, it is often farmed as an ornamental fish.\nThere is a large customer base that doesn't want to spend too much Mora on this kind of pufferfish, but nevertheless can't get enough of its bright colors. There are even enterprising businessmen who have managed to reverse this phenomenon, modeling their Zaytun Peaches after these pufferfish. The sales of those are pretty good.",
      "Effect": null
    },
    "sandstorm_angler": {
      "Name": "Sandstorm Angler",
      "Description": "A medium-sized, round fish with horn-like cartilages that is used to dig underwater burrows, build shelters and drive away creatures that try to harm it.\nThis sandy-colored, plain-looking fish is an important breed. Researchers have managed to deduce the ecological characteristics of the whole pufferfish lineage from the anatomy of this species. With its immense strength and strongest horns amongst its kind, this fish acts as an \"underwater workhorse.\" They have evolved their protective coloration as a result of long-term activities in the riverbed and the bottom of the lake, along with spending all their days with pervasive river and lake sand as companions.",
      "Effect": null
    },
    "sunset_cloud_angler": {
      "Name": "Sunset Cloud Angler",
      "Description": "A medium-sized, round fish with horn-like cartilage that is used to dig underwater burrows, build shelters and drive away creatures that try to harm them.\nAs the longest-living species of pufferfish, they have a light gray color and are easy to identify. The color comes from their unique way of survival — their cutis contains a substance similar to bile, which is far more acidic than that of other fish, causing them to be shunned by many underwater creatures.\nBut when cooked in a special way, the acidity actually adds to the freshness of the fish. As a result, this fish sells very well. At Sumeru's fish markets, you can often see signs that say: \"Do not keep Sunset Cloud Anglers in the same tank as other fish meant for consumption.\"",
      "Effect": null
    },
    "true_fruit_angler": {
      "Name": "True Fruit Angler",
      "Description": "A medium-sized, round fish with horn-like cartilages that is used to dig underwater burrows, build shelters and drive away creatures that try to harm it.\nSpecimens with a greenish tint are the common species in this lineage. They look like an unripe fruit on a tree branch, hence the nickname \"True Fruit.\"\nHowever, there are very few bones in this fish. The meat is fatty and rich, but if it's not handled properly, or you remove its gallbladder too late, the fish's meat will be as sour as unripe fruit. Therefore, \"making this fish delicious\" has become the standard by which all chefs are measured.",
      "Effect": null
    },
    "streaming_axe_marlin": {
      "Name": "Streaming Axe Marlin",
      "Description": "A fish with unique morphology and Fontaine's cousin to the butterfly fish. This fish has a broad skeleton and a unique curved body. Legend has it that the first fishermen to catch this fish had their rods tilted at the end of the tail fin and found that the two, when combined, resemble a polearm, hence giving rise to the name \"Axe Marlin.\" This name has made much more of an impression than its scientific name, the \"Anchor Hook Butterfly,\" and it is thus colloquially used amongst most people.\nIt is said that these sea-blue Axe Marlins were a special type that migrated from Sumeru to Fontaine. Compared to their more mild-tempered cousins in Sumeru, Streaming Axe Marlins are tougher and can survive in far more inhospitable environments. They are also known to travel extremely long distances, comparable even to those covered by some merchant vessels. As a result, some sailors see them as an emblem of courage and patience.",
      "Effect": null
    },
    "rippling_heartfeather_bass": {
      "Name": "Rippling Heartfeather Bass",
      "Description": "Peculiar fishes that look like a heart from the side, which are said to be related to bass. Their dorsal and ventral fins are comprised of flexible bones that are as slender as feathers, hence why researchers proposed the name \"Heartfeather Bass.\"\nAs an important subspecies of the Heartfeather Bass family, Rippling Heartfeather Bass are much better at swimming than their appearance suggests – they can even travel across roaring waves. It is said that their fins produce a rippling sound when they swim above the water against the current. Identifying the fish is already extremely challenging given their protective coloration, so most anglers have never heard this unique sound with their own ears.",
      "Effect": null
    },
    "blazing_heartfeather_bass": {
      "Name": "Blazing Heartfeather Bass",
      "Description": "Peculiar fishes that look like a heart from the side, which are said to be related to bass. Their dorsal and ventral fins are comprised of flexible bones that are as slender as feathers, hence why researchers proposed the name \"Heartfeather Bass.\"\n\"Blazing Heartfeather Bass\" have a unique coloration that shines like sunlight, making them extremely eye-catching in the water. This is said to be a special self-defense strategy which causes other fish that rely on their vision to mistake them for unknown burning objects, keeping potential predators away as a result. Contrary to their flaming appearance, they actually maintain a low body temperature and have a relatively modest food intake. Sometimes, they even go out of their way to stay in the shallows just to get some sunshine.",
      "Effect": null
    },
    "maintenance_mek_initial_configuration": {
      "Name": "Maintenance Mek: Initial Configuration",
      "Description": "Compact assistance meka developed to increase the overall utilization rates of meka teams, providing aid for underwater projects. They were originally designed to remove junk, vegetation, and other underwater debris in order to prevent these from clogging up the vital parts of other clockwork meka, thereby minimizing failure rates. From another point of view, they are undoubtedly benefiting Fontaine's ecosystem greatly as underwater cleaners.\nEquipped with high-sensitivity sensors, the meka can efficiently \"nose out\" target items through smells as well as detect the optical characteristics of underwater junk. As a result, they can be attracted by certain types of bait and are occasionally caught by anglers, who refer to them as \"Water Maintenance Fish\" or \"Iron Fish.\"\nMade of light wood and cheap metal, this model represents the first batch of Maintenance Mek produced after achieving reliable manufacture, and possesses the fundamental capabilities required to fulfill the purpose for which they were designed. Their lifespan, however, is somewhat limited. To make up for that, this model was released in great numbers, and they work in \"group shifts\" – when one group stops functioning after reaching the end of their life cycle, another group that has been deployed underwater beforehand is then activated and takes the next shift. In the eyes of ordinary people, these \"Iron Fishes\" seem to be able to reproduce themselves in a never-ending stream. Catching a few of them from time to time is certainly no cause for a guilty conscience.",
      "Effect": null
    },
    "maintenance_mek_water_body_cleaner": {
      "Name": "Maintenance Mek: Water Body Cleaner",
      "Description": "Compact assistance meka developed to increase the overall utilization rates of meka teams, providing aid for underwater projects. They were originally designed to remove junk, vegetation, and other underwater debris in order to prevent these from clogging up the vital parts of other clockwork meka, thereby minimizing failure rates. From another point of view, they are undoubtedly benefiting Fontaine's ecosystem greatly as underwater cleaners.\nEquipped with high-sensitivity sensors, the meka can efficiently \"nose out\" target items through smells as well as detect the optical characteristics of underwater junk. As a result, they can be attracted by certain types of bait and are occasionally caught by anglers, who refer to them as \"Water Maintenance Fish\" or \"Iron Fish.\"\nCompared to the mass-deployed \"Initial Configuration\" model, the \"Water Body Cleaner\" model is more mature and coated with erosion-resistant material. The researchers responsible for this project introduced periodic callback and maintenance instead of just leaving them on their own after release. They would send out homing signals through flashing of a certain frequency in order to retrieve the meka, which they would then release again following maintenance and examination. Over time, certain individuals began to use this flashing method as a type of \"bait\" to catch these meka, and it is now widely known among the angling community.",
      "Effect": null
    },
    "maintenance_mek_situation_controller": {
      "Name": "Maintenance Mek: Situation Controller",
      "Description": "Compact assistance meka developed to increase the overall utilization rates of meka teams, providing aid for underwater projects. They were originally designed to remove junk, vegetation, and other underwater debris in order to prevent these from clogging up the vital parts of other clockwork meka, thereby minimizing failure rates. From another point of view, they are undoubtedly benefiting Fontaine's ecosystem greatly as underwater cleaners.\nEquipped with high-sensitivity sensors, the meka can efficiently \"nose out\" target items through smells as well as detect the optical characteristics of underwater junk. As a result, they can be attracted by certain types of bait and are occasionally caught by anglers, who refer to them as \"Water Maintenance Fish\" or \"Iron Fish.\"\nUnder certain conditions, Maintenance Meks will treat the food of some underwater creatures as targets to be cleaned, and thus sometimes find themselves embroiled in conflicts in which they are at a disadvantage due to their small size and lack of power. Over time, an increasing number were being damaged as a result.\nTo protect the previous two models and ensure safe cleaning, researchers utilized existent frameworks and did their best to increase the power density of core structures. In the end, they developed a third model with certain combat capabilities, which was primarily designed to drive away underwater creatures by ramming into them. The new model was rapidly manufactured on the basis of previous processes.\nHowever, the plan to further enhance \"Situation Controllers\" was suddenly terminated by the Fontaine Research Institute. After all, if these little things were capable of driving ferocious underwater creatures away, then what were all the other underwater meka for? In reality, these \"Situation Controllers\" were of no real use against the underwater creatures that actually posed a threat to the other meka, and could only deal with common fishes and damage the ecosystem. As a result, researchers had to shut down some of them intentionally and restrict their offensive capabilities.",
      "Effect": null
    },
    "maintenance_mek_platinum_collection": {
      "Name": "Maintenance Mek: Platinum Collection",
      "Description": "Compact assistance meka developed to increase the overall utilization rates of meka teams, providing aid for underwater projects. They were originally designed to remove junk, vegetation, and other underwater debris in order to prevent these from clogging up the vital parts of other clockwork meka, thereby minimizing failure rates.\nCompared to the other batch-produced models, these special limited-edition \"Platinum Collection\" meks stand out with their clean and bright casing. When trying to attract support from wealthy merchants for the Maintenance Mek project, the development team would send them a fish tank containing one of these exquisite contraptions as a gift – and fine gifts they were indeed! Unfortunately, none of these attempts worked, so the development team adjusted their plans and tried to sell them off as toys to make up for the lack of project funds instead.\nIn the end, due to the accident that we all remember, the whole development team was dismissed and all of their future projects were canceled. At present, all of the remaining Maintenance Meks in Fontaine are totally unsupervised, and the \"Platinum Collection\" batch are no exception – they have all been lost to the water. Disappearing completely off the radar, they have turned out to be the most unique and expensive \"fishes\" in Fontaine. According to an in-depth investigation and cross-examination of the existing data by journalists of The Steambird, \"the deployment of Maintenance Meks has not made any significant difference to the pollution levels of Fontaine's waters, and the effect of the project is still in question.\" Nowadays, surviving \"Platinum Collection\" meks still wander the waters of Fontaine, and they are considered among the most prized of catches. After all, a \"Platinum Collection\" mek is now as rare as the most valuable Ornamental Fish in other nations.",
      "Effect": null
    }
  },
  "CookingMaterials": {
    "ajilenakh_nut": {
      "Name": "Ajilenakh Nut",
      "Description": "A fruit that grows on evergreen trees within desert oases. The flesh under the tough skin is thick, sweet, and delicious, making it an important food source amongst the desert peoples.",
      "Effect": null
    },
    "almond": {
      "Name": "Almond",
      "Description": "A seed with a peculiar fragrance that gives food a refreshing taste.",
      "Effect": null
    },
    "bacon": {
      "Name": "Bacon",
      "Description": "Smoked strips of pork. With just enough fat, but not too greasy.\nMmmmm... Bacon.\nMeat must be processed first to be made into Bacon.",
      "Effect": null
    },
    "bamboo_shoot": {
      "Name": "Bamboo Shoot",
      "Description": "A fresh young bamboo shoot, straight out of the ground. It is a delicious cooking ingredient with an exotic aroma, found exclusively in bamboo-growing regions.",
      "Effect": null
    },
    "berry": {
      "Name": "Berry",
      "Description": "Small brightly-colored fruit. They can be found everywhere, and the taste of them wipes the fatigue of a long journey away.",
      "Effect": null
    },
    "bird_egg": {
      "Name": "Bird Egg",
      "Description": "An incredibly versatile ingredient that can supply all of your daily protein needs.",
      "Effect": null
    },
    "butter": {
      "Name": "Butter",
      "Description": "An extract from milk. With the appropriate application, it can bring rich aromas to even the most basic ingredients.",
      "Effect": null
    },
    "cabbage": {
      "Name": "Cabbage",
      "Description": "A layered, leafy vegetable. Said to have originally been an ornamental plant, it certainly looks great in the pot.",
      "Effect": null
    },
    "carrot": {
      "Name": "Carrot",
      "Description": "A healthy and nutritious vegetable that is crunchy and sweet to the taste. Easy to grow and harvest.",
      "Effect": null
    },
    "cheese": {
      "Name": "Cheese",
      "Description": "Made from fermented milk. With high energy and limitless possibilities, it's used in a wide range of dishes.\nMilk must be processed first to be made into Cheese.",
      "Effect": null
    },
    "chilled_meat": {
      "Name": "Chilled Meat",
      "Description": "Rare, fresh meat.\nThis species of boar is recorded to have gone extinct several hundred years ago and has been preserved by the extreme temperatures on Dragonspine. For the gourmets of Teyvat, this is an ingredient of unspeakable sacrosanctness.",
      "Effect": null
    },
    "coffee_beans": {
      "Name": "Coffee Beans",
      "Description": "A common food in Teyvat with a special aroma. It can be used to make beverages after being ground.",
      "Effect": null
    },
    "crab": {
      "Name": "Crab",
      "Description": "A shelled creature that lives near the ocean. Its flaky, delicious meat can easily be made into tasty dishes.",
      "Effect": null
    },
    "crab_roe": {
      "Name": "Crab Roe",
      "Description": "A delicacy specific to female crabs. A rare and prized ingredient that isn't quite to everyone's taste.",
      "Effect": null
    },
    "cream": {
      "Name": "Cream",
      "Description": "A dairy product made from milk. An essential ingredient in making pastries.",
      "Effect": null
    },
    "eel_meat": {
      "Name": "Eel Meat",
      "Description": "The fresh meat of an Unagi/Eel. If handled properly, it can be used to make fresh, lovely food.",
      "Effect": null
    },
    "fermented_juice": {
      "Name": "Fermented Juice",
      "Description": "A fermented juice with a unique fruity scent. It is often used as a marinade.",
      "Effect": null
    },
    "fish": {
      "Name": "Fish",
      "Description": "A fresh fillet of fish. Handled correctly it can make a rich dish.",
      "Effect": null
    },
    "flour": {
      "Name": "Flour",
      "Description": "A powder ground from wheat. No matter what it goes into it brings a sense of satisfaction to the diner. Wheat must be processed first to be made into Flour.",
      "Effect": null
    },
    "fowl": {
      "Name": "Fowl",
      "Description": "A fresh bird. Handled correctly it can make a hearty meal.",
      "Effect": null
    },
    "glabrous_beans": {
      "Name": "Glabrous Beans",
      "Description": "A common legume in Teyvat with a light aroma. It can be prepared in a variety of ways, and is thus widely accepted by people all over the world.",
      "Effect": null
    },
    "ham": {
      "Name": "Ham",
      "Description": "Smoked leg meat. Even the thinnest slice is packed full of flavor.\nMeat must be processed first to be made into Ham.",
      "Effect": null
    },
    "harra_fruit": {
      "Name": "Harra Fruit",
      "Description": "Growing in the hot humid rainforest, it is a fruit with a special spicy aroma. When ground to powder, spices can be made from it. It is the most valued spice plant in Sumeru.",
      "Effect": null
    },
    "horsetail": {
      "Name": "Horsetail",
      "Description": "A purple plant that sometimes grows amidst Silvergrass but grows taller, straighter, and plumper — like an aristocrat among the paupers.",
      "Effect": null
    },
    "jam": {
      "Name": "Jam",
      "Description": "A puree made from fruit and sugar. Even a little bit can easily wake up drowsy taste buds. Apples and Berries must be processed first to be made into Jam.",
      "Effect": null
    },
    "lavender_melon": {
      "Name": "Lavender Melon",
      "Description": "A brightly-colored fruit. The flesh within transforms into food with a unique mouthfeel when cooked.",
      "Effect": null
    },
    "lotus_head": {
      "Name": "Lotus Head",
      "Description": "An aquatic plant native to Liyue that grows and blooms in pairs. One is fragrant, and the other bitter. It's said to make a good herbal medicine.",
      "Effect": null
    },
    "marcotte": {
      "Name": "Marcotte",
      "Description": "A pink flower with a pearl-like luster and rich scent profile. It is one of the most important ingredients in a perfumer's arsenal.",
      "Effect": null
    },
    "matsutake": {
      "Name": "Matsutake",
      "Description": "A rare fungus that generally grows on or near pine trees. Its delicate aroma gives away its location.",
      "Effect": null
    },
    "milk": {
      "Name": "Milk",
      "Description": "Sweet and fragrant cow's milk. Don't waste a single drop, not even that one rolling down your chin.",
      "Effect": null
    },
    "mint": {
      "Name": "Mint",
      "Description": "A refreshingly cool ingredient. The cool, fresh flavor can cut through the heat of many dishes.",
      "Effect": null
    },
    "mushroom": {
      "Name": "Mushroom",
      "Description": "Hardy common fungi. Can grow anywhere with the right amount of shade and moisture.",
      "Effect": null
    },
    "mysterious_meat": {
      "Name": "Mysterious Meat",
      "Description": "A fresh chunk of meat that seems to be radiating an enigmatic aura. Wonder what it'll taste like?",
      "Effect": null
    },
    "mysterious_meat_product": {
      "Name": "Mysterious Meat Product",
      "Description": "The mysterious meat can become something a lot more ordinary once specially processed.",
      "Effect": null
    },
    "onion": {
      "Name": "Onion",
      "Description": "A spherical vegetable. As vengeance for cutting it, it will make you cry, no matter how brave you are.",
      "Effect": null
    },
    "pepper": {
      "Name": "Pepper",
      "Description": "Peppery. Cuts through oily flavors and excites the taste buds. Goes best on meat.",
      "Effect": null
    },
    "pinecone": {
      "Name": "Pinecone",
      "Description": "Filled with oil-rich seeds. Certainly won't be growing into a tree from inside a squirrel's stomach.",
      "Effect": null
    },
    "potato": {
      "Name": "Potato",
      "Description": "A chunky vegetable. A gift from the earth that you never tire of with its multitude of cooking methods.",
      "Effect": null
    },
    "radish": {
      "Name": "Radish",
      "Description": "Rich in fiber and nutrients. Easy to grow and harvest.",
      "Effect": null
    },
    "raw_meat": {
      "Name": "Raw Meat",
      "Description": "A fresh chunk of meat. Handled properly it can be used to make delicious food.",
      "Effect": null
    },
    "rice": {
      "Name": "Rice",
      "Description": "A grain crop commonly found in Teyvat. People of all walks of life enjoy its distinct grainy texture. As the saying goes, \"The same kind of rice can feed one hundred kinds of people.\"",
      "Effect": null
    },
    "salt": {
      "Name": "Salt",
      "Description": "A savory seasoning. A precise but adequate amount will elevate the quality of the cuisine.",
      "Effect": null
    },
    "sausage": {
      "Name": "Sausage",
      "Description": "Finely minced meat wrapped in a skin. A staple of every meat lover's daily diet.\nMeat must be processed first to be made into Sausages.",
      "Effect": null
    },
    "seagrass": {
      "Name": "Seagrass",
      "Description": "A plant that grows in shallow seas. It adds a unique flavor to dishes.",
      "Effect": null
    },
    "shrimp_meat": {
      "Name": "Shrimp Meat",
      "Description": "A whole piece of deep sea shrimp meat, full of nutrients and bursting with delicious flavor.",
      "Effect": null
    },
    "smoked_fowl": {
      "Name": "Smoked Fowl",
      "Description": "Fowl that has been smoked. The firm texture gives new taste to dishes.\nFowl must be processed first to be made into Smoked Fowl.",
      "Effect": null
    },
    "snapdragon": {
      "Name": "Snapdragon",
      "Description": "Can be eaten once cooked. As a spice it can bring wonderful flavor to dishes.",
      "Effect": null
    },
    "spice": {
      "Name": "Spice",
      "Description": "A seasoning with varied flavors. It is made from dried Harra Fruits and can enrich the taste of a dish. Therefore, Sumeru locals say, \"Spice goes well with anything.\"",
      "Effect": null
    },
    "sugar": {
      "Name": "Sugar",
      "Description": "A seasoning derived from Sweet Flowers. Has the power to give both energy and happiness.\nCan be purchased from the merchants in the city, or made with Sweet Flowers.",
      "Effect": null
    },
    "sumeru_rose": {
      "Name": "Sumeru Rose",
      "Description": "Bright and beautiful, these pure purple flowers give off a pleasant fragrance that will give any passerby pause. While some like to call this type of “rambler rose,” its relative lack of multiple flowers means that it falls under a different floral classification.",
      "Effect": null
    },
    "sweet_flower": {
      "Name": "Sweet Flower",
      "Description": "Particularly fragrant flowers. They can be found easily, even in the dark. Just follow the scent.",
      "Effect": null
    },
    "tidalga": {
      "Name": "Tidalga",
      "Description": "An algae floating with the tides that sustains itself by feeding on substances produced by other plants. Though often mistaken for zooplankton, based on its nature, Tidalga is actually a type of phytoplankton.",
      "Effect": null
    },
    "tofu": {
      "Name": "Tofu",
      "Description": "Freshly made bean product that has a silky-smooth tender texture.",
      "Effect": null
    },
    "tomato": {
      "Name": "Tomato",
      "Description": "A bright red ingredient that gives a tangy kick. Yes, the 'fruit or vegetable' debate is still going...",
      "Effect": null
    },
    "wheat": {
      "Name": "Wheat",
      "Description": "Golden sun-kissed tassels. Needs to be ground down to flour for further use.",
      "Effect": null
    },
    "zaytun_peach": {
      "Name": "Zaytun Peach",
      "Description": "The fruit of a forest shrub. Its flesh is firm and sweet. It is said to have a calming effect on the mind.",
      "Effect": null
    }
  },
  "CraftingMaterials": {
    "butterfly_wings": {
      "Name": "Butterfly Wings",
      "Description": "Brightly colored wings. The powder that falls from them shimmers a little. Perhaps this is what allows them to fly?",
      "Effect": null
    },
    "crystal_core": {
      "Name": "Crystal Core",
      "Description": "The core of a crystal butterfly. It absorbs elemental energy that had escaped into the atmosphere.",
      "Effect": null
    },
    "electro_crystal": {
      "Name": "Electro Crystal",
      "Description": "A power-rich crystal that draws electricity from the air around it. Holding it makes your hand a little numb.",
      "Effect": null
    },
    "flaming_flower_stamen": {
      "Name": "Flaming Flower Stamen",
      "Description": "The stamen of a fiercely burning flower. Even after being extinguished, it still emits heat.",
      "Effect": null
    },
    "frog": {
      "Name": "Frog",
      "Description": "Common frog found in moist environments. Full of energy, they secrete a substance that will keep you full of vitality.",
      "Effect": null
    },
    "lizard_tail": {
      "Name": "Lizard Tail",
      "Description": "A lizard tail that curled up after losing its owner. Very bitter, but has skin hardening properties.",
      "Effect": null
    },
    "loach_pearl": {
      "Name": "Loach Pearl",
      "Description": "A shiny pearl spat out by a loach that has mystical medicinal properties.\nMinerals and elemental particles ingested by the loach condense into these mildly magical beads. When threatened, the loach spits them out to confuse predators and escape with its life.",
      "Effect": null
    },
    "luminescent_spine": {
      "Name": "Luminescent Spine",
      "Description": "The light-emitting part of a firefly. Used for courtship, and in medicine to help recover strength.",
      "Effect": null
    },
    "mist_flower_corolla": {
      "Name": "Mist Flower Corolla",
      "Description": "A flower bud encased in solid ice. Even after being picked, the flower continues to emit cold.",
      "Effect": null
    },
    "strange_tooth": {
      "Name": "Strange Tooth",
      "Description": "A Dragontooth you picked up in Dragonspine. Perhaps someone would know something more about it...",
      "Effect": null
    },
    "vitalized_dragontooth": {
      "Name": "Vitalized Dragontooth",
      "Description": "A Dragontooth that has absorbed vitality and now exudes a warmth that-makes one uneasy. Once upon a time, a dragon fell to ruin in a silver valley, painting the bone-white snow an ominous crimson. This crimson symbolizes the might of this dragon.",
      "Effect": null
    },
    "dust_of_azoth": {
      "Name": "Dust of Azoth",
      "Description": "A device that can transmute elemental Ascension Materials and change their Elemental Type.\nIts practical uses notwithstanding, alchemy is the study of the nature of matter and the rules that underpin its transformations, and ultimately it seeks to comprehend the working principles of the world and the flow of the ley lines.\nIt is not known who would share alchemical achievements of this magnitude with the civilizations of the world and why. But although the power to fundamentally transmute elemental energy in its crystallized and inert form is a highly useful one, this device also conceals the grave danger of disrupting the elemental balance...",
      "Effect": null
    },
    "dream_solvent": {
      "Name": "Dream Solvent",
      "Description": "An item capable of changing Character Level-Up Materials obtained from memories and trials into whatever form is needed.",
      "Effect": null
    }
  },
  "ConstellationMaterials": {
    "five_star_stella_fortuna": {
      "Name": "Stella Fortuna",
      "Description": "Constellation Activation Material",
      "Effect": null
    },
    "four_star_stella_fortuna": {
      "Name": "Stella Fortuna",
      "Description": "Constellation Activation Material",
      "Effect": null
    },
    "memory_of_roving_gales": {
      "Name": "Memory of Roving Gales",
      "Description": "The missing star from the Talents of an Anemo-aligned Traveler.",
      "Effect": null
    },
    "memory_of_immovable_crystals": {
      "Name": "Memory of Immovable Crystals",
      "Description": "The missing star from the Talents of a Geo-aligned Traveler.",
      "Effect": null
    },
    "memory_of_violet_flash": {
      "Name": "Memory of Violet Flash",
      "Description": "The missing star from the Talents of an Electro-aligned Traveler.",
      "Effect": null
    },
    "memory_of_flourishing_green": {
      "Name": "Memory of Flourishing Green",
      "Description": "The missing star from the Talents of an Dendro-aligned Traveler.",
      "Effect": null
    }
  },
  "Type": "MaterialLocalization"
}