{
  "LangCode": 0,
  "Nations": {
    "mondstadt": {
      "Name": "Mondstadt",
      "Title": "City of Freedom",
      "Description": "A city of freedom that lies in the northeast of Teyvat.\n\nFrom amongst mountains and wide-open plains, carefree breezes carry the scent of dandelions — a gift from the Anemo God, Barbatos — across Cider Lake to Mondstadt, which sits on an island in the middle of the lake.",
      "Archon": "Barbatos (Venti)"
    },
    "liyue": {
      "Name": "Liyue",
      "Title": "City of Contracts",
      "Description": "A bountiful harbor that lies in the east of Teyvat.\n\nMountains stand tall and proud alongside the stone forest, that, together with the open plains and lively rivers, make up Liyue's bountiful landscape, which shows its unique beauty through each of the four seasons. Just how many gifts from the Geo God lie in wait amongst the rocks of Liyue's mountains?",
      "Archon": "Morax (Zhongli)"
    },
    "inazuma": {
      "Name": "Inazuma",
      "Title": "City of Eternity",
      "Description": "An Isolated Archipelago Far East of Teyvat.\n\nOvercome endless thunderstorms and set foot on the islands of red maple and cherry blossoms. On winding shores and towering cliffs, and in forests and mountains full of secrets, witness the Eternity pursued by Her Excellency, the Almighty Narukami Ogosho.",
      "Archon": "Beelzebul (Ei)"
    },
    "sumeru": {
      "Name": "Sumeru",
      "Title": "City of Wisdom",
      "Description": "The God of Wisdom's enemy is wisdom itself, and the oasis of knowledge is a mirage in the desert of ignorance.\n\nIn the city of scholars there is a push for folly, yet the God of Wisdom makes no argument against it.",
      "Archon": "Lesser Lord Kusanali"
    },
    "fontaine": {
      "Name": "Fontaine",
      "Title": "City of Justice",
      "Description": "A terrestrial sea in the center of Teyvat.\nFollowing the direction of pure currents, crossing wilderness, the depths of the forests and vastness of the sea of sand, arriving at the origin of all the waters of the continent. At the top of the waterfall, in the depths of the capital atop the terrestrial sea... a story that has never been heard, a legend that has been forgotten, like a lost kingdom sunken beneath the waves, yearning for a bard to sing its drowned songs.",
      "Archon": "Focalors"
    }
  },
  "Type": "NationLocalization"
}